{"Contents":{"slug":"Contents","filePath":"Contents.md","title":"Contents","links":["Topics/Symcom-Local-Setup-Details","Topics/Symcom-Developer-Guide-(Work-Chart)","Topics/Symcom-Master-Data-Guide,-API-included","Topics/Source-Import","Topics/Source-Settings","Topics/Symptom-Type-Setting","Topics/Conversion-of-Grading-During-Display","Topics/Synonym-Addition-and-Doubtful-Synonyms","Topics/Bönninghausen-Sources","Topics/Allen-Source-Import","Topics/Hering-source-Import","Topics/Import-section-additional-concepts-=-Allen,-Synonym","Topics/Materia-Medica","Topics/Connections-among-sources","Topics/Reflexive-grades-with-CEs-and-swap-CEs","Topics/Saving-of-comparisons","Topics/Marking-of-symptoms","Topics/Unmarked-and-non-secure-connection-check-before-saving-(Technical-Workflow)","Topics/Listing-of-Initial-Symptoms-in-the-Comparison-Page","Topics/Customized-Array-Creation-for-Initial-Symptom-Display-and-Customized-Pagination","Topics/Editor-Privilege","Topics/Comparison-status-in-different-modes","Topics/Some-jQuery-variables-and-function-name-with-their-usages","Topics/Some-PHP-function-name-and-their-description","Topics/Matched-percentage-and-highlighted-words-process-in-comparison-page","Topics/Translation-of-symptoms","Topics/Rules-relating-to-symptom-import","Topics/All-Connection-Business-Logic","Topics/Basic-Rules-relating-to-connection-of-symptoms-in-comparison-page","Topics/New-Modification-in-CE,-SWAP-CE-Concept","Topics/New-Modification-in-normal-symptom-edit,-CE,-SWAP-CE","Topics/Display-of-connected-symptoms","Topics/Ordering-of-connected-symptoms-on-the-basis-of-their-connection-type","Topics/Rearrangement-of-symptoms-as-per-source-year-and-paste-connections","Topics/Marking-of-Symptoms-(Technical-Details)","Topics/Kent-Import-(Document-Modification)","Topics/Chapter-Structure-Guide","Topics/Chapter-Structure-Creation,-Installation,-Modification-Process","Topics/Chapter-Assignment,-Display,-Saving-Process-(Technical)","Topics/Chapter-assignment-modification","Topics/Chapter-List-Display-and-Sorting-of-Symptoms","Topics/Chapter-Classification-Model-Re-train","Topics/Chapter-Classification-Python-Program","Topics/User-View-Page","Topics/User-View-Show-Source-Setting","Topics/User-view-section-Author-exclusion-and-its-effect-on-CE-symptoms","Topics/Kürzel-combination-(Source-Code-Control)","Topics/Actualization-of-date-and-time","Topics/Editor-Abbreviation-Column-in-Import-and-Materia-Medica","Topics/Search-Function-of-the-Initial-Symptom-During-Comparison","Topics/Punctuation-removal-from-grading","Topics/Comparison-Table-Creation-Process-(Batch-Processing)","Topics/Miscellaneous-Information","Topics/Symptom-Edit-Submission-Workflow","Topics/Important-Functionalities--and--their-workflows","Topics/Custom-text-box-for-page-navigation","Topics/Sorting-of-symptoms-based-on-superscript-numbers","Topics/Rules-applicable-to-new-refactored-database-tables.","Topics/Automatic-Symptom-Connection-Process","Symcom-Synonym-Tool-Developer-Guidelines","Remaining-Task-List-Deductions","Topics/Individual-upgrade-of-symptoms","Topics/Turquoise-Color-Changes","Topics/Unmatched-symptoms-comparison","Topics/Longer-comments-compatible-and-CSS-adjustment-in-symptoms-page","Topics/Navigating-to-initial-symptoms-from-search-window","Topics/Loading-more-comparatives-in-batches","Topics/Edits-in-symptoms-page","Topics/Tiny-MCE-editor-for-grade-settings","Discussions/Conversion-function-and-edits-with-symptoms-in-Symcom","symcom-v2-documentation/Symcom-Documentation-V2.0","symcom-v2-documentation/Project-Structure","symcom-v2-documentation/Local-Setup-Guidelines"],"tags":[],"content":"\n\nSymcom Local Setup Details\n\n\nSymcom Developer Guide (Work Chart)\na. Source Import\nb. Admin Panel\nc. Comparison Process\nd. Creation of comparison and related dynamic SQL tables.\n\n\nSymcom Master Data Guide, API included\n\n\nSource Import\n\n\nSource Settings\n\n\nSymptom Type Setting\n\n\nConversion of Grading During Display\n\n\nSynonym Addition and Doubtful Synonyms\n\n\nBönninghausen Sources\n\n\nAllen Source Import\n\n\nHering source Import\n\n\nImport section additional concepts = Allen, Synonym\n\n\nMateria Medica\n\n\nConnections among sources\na. Connect (Connection)\nb. Connect (Disconnection)\nc. Connect Edit (Connection)\nd. Connect Edit (Disconnection)\ne. Paste (Connection)\nf. Paste (Disconnection)\ng. Paste Edit (Connection)\nh. Paste Edit (Disconnection)\n\n\nReflexive grades with CEs and swap CEs\n\n\nSaving of comparisons\n\n\nMarking of symptoms\n\n\nUnmarked and non-secure connection check before saving (Technical Workflow)\n\n\nListing of Initial Symptoms in the Comparison Page\n\n\nCustomized Array Creation for Initial Symptom Display and Customized Pagination\n\n\nEditor Privilege\n\n\nComparison status in different modes\n\n\nSome jQuery variables and function name with their usages\n\n\nSome PHP function name and their description\n\n\nMatched percentage and highlighted words process in comparison page\n\n\nTranslation of symptoms\n\n\nMySQL Table Structure\n\n\nRules relating to symptom import\n\n\nAll Connection Business Logic\n\n\nBasic Rules relating to connection of symptoms in comparison page\n\n\nNew Modification in CE, SWAP CE Concept\n\n\nNew Modification in normal symptom edit, CE, SWAP CE\n\n\nDisplay of connected symptoms\n\n\nOrdering of connected symptoms on the basis of their connection type\n\n\nRearrangement of symptoms as per source year and paste connections\n\n\nMarking of Symptoms (Technical Details)\n\nGeneral Non Secure (Technical Details)\nNon secure connect and paste (Technical Details)\n\n\n\nKent Import (Document Modification)\n\n\nChapter Structure Guide\n\n\nChapter Structure Creation, Installation, Modification Process\n\n\nChapter Assignment, Display, Saving Process (Technical)\n\n\nChapter assignment modification\n\n\nChapter List Display and Sorting of Symptoms\n\n\nChapter Classification Model Re-train\n\n\nChapter Classification Python Program\n\n\nUser View Page\n\n\nUser View Show Source Setting\n\n\nUser view section Author exclusion and its effect on CE symptoms\n\n\nKürzel combination (Source Code Control)\n\n\nActualization of date and time\n\n\nEditor Abbreviation Column in Import and Materia Medica\n\n\nSearch Function of the Initial Symptom During Comparison\n\n\nPunctuation removal from grading\n\n\nComparison Table Creation Process (Batch Processing)\n\n\nMiscellaneous Information\n\n\nSymptom Edit Submission Workflow\n\n\nImportant Functionalities &amp; their workflows\n\nSource type of a symptom\nSymptom type of a symptom\n\n\n\nCustom text box for page navigation\n\n\nSorting of symptoms based on superscript numbers\n\n\nRules applicable to new refactored database tables.\n\n\nAutomatic Symptom Connection Process\n\n\nSymcom Synonym Tool Developer Guidelines\n\n\nRemaining Task List Deductions\n\n\nIndividual upgrade of symptoms\n\n\nTurquoise Color Changes\n\n\nUnmatched symptoms comparison\n\n\nLonger comments compatible and CSS adjustment in symptoms page\n\n\nNavigating to initial symptoms from search window\n\n\nLoading more comparatives in batches\n\n\nEdits in symptoms page\n\n\nTiny-MCE editor for grade settings\n\n\nConversion function and edits with symptoms in Symcom\n\n\nDocumentation for Symcom Version 2.0:\n\nSymcom Documentation V2.0\nProject Structure\nLocal Setup Guidelines\n"},"index":{"slug":"index","filePath":"index.md","title":"Home","links":["Contents"],"tags":[],"content":"Symcom Documentation\nThis repo contains documentation of Symcom Application buillt by Alegra Labs Gmbh.\nBuilt with Quartz and Obsidian.\nContents"},"Remaining-Task-List-Deductions":{"slug":"Remaining-Task-List-Deductions","filePath":"Remaining Task List Deductions.md","title":"Remaining Task List Deductions","links":[],"tags":[],"content":"1. Testing Individual upgrade of symptoms from comparison final view display list.\n\nTrigerred with edit icon from the comparison final view page.\r\nEdit only converted version.\r\nInclude all grade icons.\r\nSaving in edited_symptom_text_versions SQL table.\r\nFetching from edited_symptom_text_versions for individually upgraded symptoms.\r\nChanges in convertTheSymptom() function.\n\n2. Edit of symptoms, original version, converted version from symptoms list after import. \n\nTriggered from edit icon of the symptoms page.\r\nEdit both original and converted version option active.\r\nChanges will be saved to symptoms table and the final comparison dynamic table.\r\nThere is an issue with the grades though. Only one version of edited grades are stored in the symptoms_grading_settings SQL table. So if, symptoms is edited after import then in some comparison, the symptoms is involved in connections like CE, then the previous edits which were done from the symptoms page will not exists, as the new grade version from CE will be saved in the SQL table. \r\n\r\nQuestions:\r\nDo you want to edit it before involvement of the source in comparison?\r\n\r\nAlternative Solutions:\r\nI think this edit icon can be removed from the symptoms page.\r\nIf any mistake is found, then there is option to remove it or deactivate it from the expert tool.\r\nTo add the symptom, we can use the &quot;import symptoms under same source and remedy&quot;.\n\n3. Addition of prover from CE text modal.\n\nCurruently the detection of prover from CE text editor is not possible as CE text editor and its related backend scripts are programmed to only save the grades for parts of the symptoms involved.\r\n\r\nTo implement will also make the CE process quite complex.\r\nWe can however plan to do this, i.e addition of prover to the symptom from the expert tool.\n\n4. Import of symptoms under the same source and remedy name. \n\nWhen same source and medicine is detected. The values will be retrieved from the SQL quelle_import_master SQL table.\r\nThen check if the source is involved in comparison and if, completed version is available.\r\nIf available then it will be inserted to the symptoms and the final version dynamic SQL tables in the same settings.\r\nIf source is not involved in comparsion then insert in the symptoms table.\r\nIf source is involved in comparison but completed version is not made, then return false, exit the operation.\r\n\r\nImportant:\r\nThe import settings should be exactly the same.\r\n\r\nQuestions:\r\nImport of symptoms under the same source and remedy name\r\n=&gt; What would happen if a source say X is imported, compared with three comparing sources A, B, C and then new symptoms are imported?\r\nIn the program we will have comparisons for :\r\nX_A\r\nX_A_B\r\nX_A_B_C\r\n\r\nIf new symptoms are inserted now then it will part of the new source &quot;X_A_B_C&quot;\r\nwhere X will contain both its original symptoms and new imported symptoms.\r\n\r\nSituation: What if the editor sees mistakes and decides to re-activate comparison &quot;X_A_B&quot;. In this case the new imported symptoms will not be available as the new symptoms was only added to the last comparison source &quot;X_A_B_C&quot;.\r\n\r\n\r\nIf we have to add the new symptoms to all other previous comparisons, then new comparisons needed to be made which would be technically inefficient.\r\n\r\nAlternative Solution:\r\nI think import of symptoms or addition of symptoms should only be added to the symptoms SQL table and to the final version dynamic table.\r\nIn this way, the imported new symptoms will be visible or will be operational from next consequtive comparisons but will not be available for the comparisons which has already been done earlier. It is the only efficient and reasonable way.\n\n5. Import of Heilmittelarchiv sources.\n\nFor this task we need some plannings. \r\nMust come to a common ground. The source should follow the symcom minimum requirments or should be manipulated in some form.\r\n\r\nWe need to add a book with some pre defined author and year.\r\nOnly in this way, it is possible.\r\nBut I also need to know if there are any more requirements.\n\n6. Expert tool after final save \n\nOutside of comparison, i.e. in completed SQl table.\r\nDisconnection amongst symptoms.\r\nConnection amongst symptoms. All connection.\r\nGeneral edits, like edit of text?\r\nDeletion of symptoms. (Could this be deactivaton?)\r\n\r\nWork arounds:\r\nExpert tool button in final view.\r\nOn click, temporary completed table along with connections table will be created from the original tables.\r\nA new webpage will show the final version with abilities to disconnect, checkboxes with all symptoms, toolbar with delete, general edit, to make it as comparative (white symptom), add special data like prover, author, reference.\r\nSave button in expert tool webpage, to implement those changes.\r\nWork with expert tool can be resumed if not saved and opened again later.\n\n15. Chronological sorting of symptoms in the comparison.\n\nCase:\r\nChronological sorting has been defined differently for active working comparisons and the finalized comparison version.\r\n\r\nFor the working comparison, the connections are sorted as per connections. Like in this order (CE, connect, PE, paste)\r\n\r\nFor saved finalized comparison list, the connections are sorted as per the year.\r\n\r\nQuestion:\r\nThe connection in the working comparison needs to be chronologically sorted as per the year?\r\n\r\nNOTE: It will not be simple to maintain each element. Deep JS coding is required. Will take some time. [2 weeks]\n\n14. Speed on all connections. Slowness in the website.\n\n1. If the window.bind is removed, which allows immediate display of the automatic connection initiation pop up. =&gt; Slowness is removed on page load of fresh comparison. =&gt; This can be done but connection loading still takes time.\r\n\r\n2. Loading of comment, translation, footnote has minimum effect on slowness during page load.\r\n\r\n3. Loading of connections =&gt; For 50 initial symptoms, if connections are to be loaded in all connections. It takes time in page reloading.\r\n\r\nNumbers: \r\nFor 50 initials, 30 sec without cache.\r\nFor 50 initials, 22 sec with cache.\r\n\r\n4. Loading after connection like CE, PE takes most time.\r\nNumbers: \r\nFor 50 initials, 36-45 sec.\r\n\r\nThis happens as page is relaoded after these connections. \r\nCould be reduced if page is not reloaded but affected sections are adjusted using JS and JQuery.\r\n\r\nNOTE: I think we can overlook point 3 for now. As loading of connections on page reload will disappear after point 4 is operated. Point 3 will only occur when page is navigated.\r\n\r\nP.S: We could make all the connections to display very fast but it the program has function has show all connections checkbox which needs all connections to be loaded first before the opearations.\n\nAdditional Note:\r\nIt is noteworthy that some tasks are dependant on other tasks and even though implementation on the newer version has been reduced to smaller tasks, yet the association of one task with others will incur some time in the initial days of implementation. The work would however be completed in the overall time period estimated, but parallel work on multiple tasks is obvious. For example, tasks like implementation of connections is also related to displaying the connection and loading the connections for different situations like page reload, previous connection arrangements etc. The loading of connections is associated with slow loading issue task, choronological ordering task etc.  \n"},"Symcom-Developer-Home":{"slug":"Symcom-Developer-Home","filePath":"Symcom Developer Home.md","title":"Symcom Developer Home","links":["Topics/Symcom-Local-Setup-Details","Topics/Rules-relating-to-symptom-import","Topics/Source-Import","Topics/Symcom-Developer-Guide-(Work-Chart)","Topics/Conversion-of-Grading-During-Display","Topics/Symptom-Type-Setting","Topics/Basic-Rules-relating-to-connection-of-symptoms-in-comparison-page","Contents"],"tags":["gardenEntry"],"content":"Symcom Developer Guide\nGetting Started:\nWelcome to the Symcom Developer Guide! If you’re looking for information on individual topics, please follow the contents or topics from the side bar navigation. Continue reading for an introduction to the documentation, Import Process, Comparison, Connections and more!\nHow to use these docs:\nIt is advised to follow the documentation along with the program running live or in local machine. Following and navigating through the scripts along with the technical descriptions provided here will help better understand the technical insights.\nTo locally setup Symcom follow instructions from: Symcom Local Setup Details\nOverview:\nThe site www.reference-repertoy.com is the gateway to the main administrator panel. Upon logging in, addition of new books, new magazines, access to existing books, magazines, and grading configuration for fonts of sources, including details of medicines, authors, publishers, and tester (provers) can be found and edited.\nThe admin panel is also provided with an import section for new source import. Once logged in the user can choose to perform several actions like comparison between different sources, connection of symptoms in the comparison process: addition and modification of provers, source references, authors, synonyms etc. Additionally, there are also platforms like “materia-medica” and “history” to manage and handle the sources inside the Symcom application.\nBelow are some important German words and its English translation for better understanding of the full document.\nThe backend code has been changed to english from german versions. There can still be german words in many parts of the documentation, readers are advised to follow up the below list to avoid any confusion.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGerman wordTranslated to English1. QuelleSource2. ArzneiMedicine, Remedy3. PrüferTester4. LiteraturReference5. LiteraturquellenLiterature reference6. BeschreibungDescription7. KursivCursiv, Italic8. FettBold9. AuflageEdition\nFor a full detailed understanding of the technical aspects, this documentation is provided with a technical guide section.\nSymptom Import:\nImports of new symptoms to existing sources are done in this section. Import settings for sources, medicine and tester are to be filled by the user. Symptoms should be pasted from Microsoft Word document in the text editor.\nCertain rules are there according to which import of symptoms is processed. The program analyses the imported symptoms and saves them according to the rules, confirmations for unrecognized patterns is also done by the program.\nRules relating to symptom import\r\nSource Import\r\nSymcom Developer Guide (Work Chart)\nFont Settings:\nFont settings for display of different symptoms of the Quelle (sources) can be done from the main menu in “Setting Sources” option. The menu contains grading values for different text formats of the symptom. The grading values are set with values like 1, 2, 3 etc. These values are assigned in “Grading” settings menu where each value represents font formats like bold, italics etc.\nWhen for a particular source, the grade is assigned for the already defined grade values in the “Grade Setting” page, the symptoms of the source are converted whenever it is displayed.\nFor example: If for “Bold” option the value is assigned to number 2 in the “Gradings” section and if for a particular source the “Kursiv” option is assigned to number 2 in the “Grade Setting” page then since the number 2 is defined for “Bold’ option, the symptoms in kursiv (italics) will be converted to bold font whenever it is displayed in the Symcom application.\nConversion of Grading During Display\nSymptom Type Setting:\nSymptoms can be defined by a type and the symptom type of a particular source can be defined from the “Symptom Type Setting” menu option.\nSymptom type can also be defined for individual symptom via the edit option for the symptoms. In this case, the individual symptom type setting will be of higher priority than its source values.\nSymptom Type Setting\nComparison:\nComparisons among symptoms of different sources are done in this section. Initial source and comparison source are selected from the existing source list. Language of the symptoms, including percentage to compare is also selected. The comparing sources are always younger than the initial sources in the comparison process.\nIn the comparison page, connection functions like connect, connect-edit, paste, and paste edit can be done among the symptoms. If the editor is in doubt about the connection, the editor has the option to mark the connection as non-secure. All non-secure connections are verified by the supervisor before the final save of the comparison is done. There are also options to add comments and footnotes to the symptoms and view its information and translation.\nMultiple comparing sources can be selected for a single initial source. When multiple combined sources are compared, there may be situations when the initial source may become younger or equal to the comparing source year. In such cases, the symptoms when connected are swapped. Functionality of symptoms for connections, connect-edit, paste, paste-edit and swap are different and follows a series rules.\nBasic Rules relating to connection of symptoms in comparison page\nSaving of Comparisons:\nComparisons after proper inspection of non-secure connections and markings by the editor and the supervisor can be saved. Whenever a comparison is saved, connect, connect-edit and swap connections are preserved for further comparisons and editing. All initial and comparing symptoms become a single symptom list which are displayed chronologically as per their source year. All paste and paste edit connected symptoms are sorted just below its initial parent. This new combined source becomes ready for further comparisons with other sources.\nNOTE: Chronological means ascending to descending here and this sorting order is only required in the final completed comparison version. During comparison, chronological order is not shown rather the latest connection is shown first under the initials in case of combined source comparisons.\n\nContents :\nClick to go through all the topics.\nSome topics are categories into tags for efficient searching. These tags include: import, comparison, general, chaptering, userview"},"Discussions/Conversion-function-and-edits-with-symptoms-in-Symcom":{"slug":"Discussions/Conversion-function-and-edits-with-symptoms-in-Symcom","filePath":"Discussions/Conversion function and edits with symptoms in Symcom.md","title":"Conversion function and edits with symptoms in Symcom","links":[],"tags":[],"content":"*Severe headache,° with deep red eyes and dry lips.\n\n*&lt;asterisk-bold&gt;Severe &lt;/asterisk-bold&gt;&lt;asterisk-bold&gt;headache&lt;/asterisk-bold&gt;&lt;asterisk-normal&gt;,&lt;/asterisk-normal&gt;°&lt;degree-normal&gt; with deep &lt;/degree-normal&gt;&lt;degree-em&gt;red eyes&lt;/degree-em&gt;&lt;degree-normal&gt; and dry lips&lt;/degree-normal&gt;.\nAbove string is passed as a parameter to conversion function.\n// Inside conversion function\n//...\n//...\n$conversionArr = array(\n\t\t\t\t&#039;asterisk-normal&#039; =&gt; &#039;&#039;,\n\t\t\t\t&#039;asterisk-bold&#039; =&gt; &#039;strong&#039;,\n\t\t\t\t&#039;degree-em&#039; =&gt; &#039;em&#039;,\n\t\t\t\t&#039;degree-normal&#039; =&gt; &#039;&#039;,\n\t\t\t\t&#039;degree-bold&#039; =&gt; &#039;strong&#039;\n\t\t\t);\n*&lt;strong&gt;Severe &lt;/strong&gt;&lt;strong&gt;headache&lt;/strong&gt;,° with deep &lt;em&gt;red eyes&lt;/em&gt; and dry lips.\nGlobal grading values:\ngrade 1 : normal\ngrade 2 : italics\ngrade 3 : bold\n\nGrade settings for a particular source:\n"},"symcom-v2-documentation/Automatic-Symptom-Connection-Process":{"slug":"symcom-v2-documentation/Automatic-Symptom-Connection-Process","filePath":"symcom-v2-documentation/Automatic Symptom Connection Process.md","title":"Automatic Symptom Connection Process","links":["tags/comparison"],"tags":["comparison"],"content":"comparison\nThis process is available in the comparison process where an editor can choose to connect the highest matched comparative with the initial symptoms choosing a minimum percentage as lower limit for the automatic connection. Automatic connection only does normal connect connection.\nSome details of the automatic connection process.\n\nThe automatic connection process for comparatives with 100% match or identical pairs (where initial and comparative symptom both have same symptom text and same text format) starts at the time when new comparison process is initiated. These connections appears directly in the comparison page.\nWhen no current connections are made in the comparison page, a notice is shown to the editor to initiate the automatic connection process. If agreed, the editor is asked for automatic connection percentage and referred to the automatic connections page where all comparatives with highest match will be connected.\nA total of 100 initial symptoms are displayed in the automatic connection page. The editor has the option to view symptom info, translation or disconnect any connection.\nOnly cases where no swap connections are possible or comparatives which does not have any previous connections are considered for the automatic connection process.\nIf any time the automatic connection listing page is closed or the review process is cancelled, the editor is automatically redirected to the automatic connections page when the comparison is opened from the materia medica page.\n\nBack-end Operations (Automatic Symptom Connections):\nFrom create-dynamic-comparison-table.php script:\n\nA temporary table for connections is created dynamically.\nThe script automatic-connection-of-symptoms-during-comparison.php is called using shell_exec().\n\nFrom automatic-connection-of-symptoms-during-comparison.php script:\n\nComparison table, absolute URL and editor initials are taken as input parameters.\nExecution for automatic connections are done from the initial symptoms in the main comparison table using batch processing method where initial symptoms are taken in batches of 10.\nFor each batch call to automatic-connection-of-symptoms-per-batch.php script is done via shell_exec().\n\nFrom automatic-connection-of-symptoms-per-batch.php script:\n\nSymptom information are collected for the initial symptom.\nSymptom information for the comparative with highest match percentage with the initial is taken out.\nBoth the symptom string of initial and comparative are sent as parameters to checkIfIdenticalSymptomPairs() PHP function to check if 100% identical match exists between the pairs.\nThe swap cases and comparatives having previous connections are excluded. checkIfPreviuousConnection() PHP function is used for checking if previous connections exists with the comparative symptom.\nFor each initial and comparative pair, all information required for insertion of information in the connections table is taken in a PHP array.\nThe array is then sent to connection-save-script.php via curl_exec() which does the connection and inserts into the connections table.\n\nFrom connection-save-script.php script:\n\nInput parameter connect_type is used for the connect connections.\nIf input parameter check_if_identical_pairs is  true and automatic connection flag automatic_connection is true, then connections is inserted in the connections table.\nIf input parameter check_if_identical_pairs is  false and automatic connection flag automatic_connection is true, then connections is inserted in the temporary connections table.\nIf in case, editor proceeds with manual connection then deleteTemporaryConnectionTable() PHP function deletes the temporary connections table and sets editor_connection_process flag to 0 in pre_comparison_master_data SQL table.\n\nBack-end Operations (Automatic Symptom Connections List Display):\nFrom comparison.php script:\n\nThe automatic connection button with id = editor_connection_process displays a HTML modal with id = automaticConnectionConfirmationBtn on click. This modal on submission redirects the editor to the automatic-connection-list-view.php script.\nIf manual connection is done in the comparison this button is disabled. The button is controlled both from front-end and back-end. The button enabling and disabling classes are controlled by checkTemporaryConnectionTable() PHP function.\n\nFrom automatic-connection-list-view.php script:\n\nIf no temporary connections table is found, this script redirects the editor back to the comparison page.\nThis scripts updates the editor_connection_process field of the pre_comparison_master_data to 1 based on the id of the table.\nThe connections are retrieved from the temporary connections table for that particular comparison.\nPer page 100 initial symptoms are shown and the display of symptoms and their connections are similar to the work flows from the comparison page. The scripts involved are:\n\nsymptom-connection-operations-for-automatic-connections.php\nallIconFunctions2-jay.js\nconnect-saved-for-automatic-list.js\n\n\nIf disconnection of automatic connected symptoms is done by the editor then the flag is_disconnected_by_editor is set to 1 in the temporary connections table. This operation is execution by the connection backend script connection-save-script.php.\nThe finalization of the automatic connections can be done using the button with id = finalize_connection_process.\nThis button on click after confirmation, redirects the editor to automatic-connections-migration-script.php.\n\nFrom automatic-connections-migration-script.php script:\n\nAll connections from the temporary connections table are taken based on is_disconnected_by_editor = 0.\nThe selected automatic connections are then taken in a PHP array connectionsRowDataArray and each of them are then inserted to the connections table of the comparison.\nThe temporary connections table is then deleted.\neditor_connection_process flag in the pre_comparison_master_data is then set to 0.\n"},"symcom-v2-documentation/Local-Setup-Guidelines":{"slug":"symcom-v2-documentation/Local-Setup-Guidelines","filePath":"symcom-v2-documentation/Local Setup Guidelines.md","title":"Local Setup Guidelines","links":[],"tags":[],"content":"Clone the git repository.\n\nPrerequisites:\nGit\r\nComposer 2.8.3\r\nDocker version 26.1.3\r\nDocker Compose version 2.27.1\n\nInstallation steps:\nStep 1:\r\nRun Docker using below command from project root directory. This will install PHP in apache environment and MySQL in two separate containers. Containers will be named syncom-app and db. All dependencies will be installed.\ndocker compose build --no-cache\n\nStep 2:\nAfter build is successful, run the docker containers.\ndocker compose up -d\n\nStep 3:\r\nMake three instances of the terminal. One instance with current working directory as the project root.\r\nIn second instance, go inside the symcom-app container using:\ndocker exec -it symcom-app bash\n\nIn third instance, go inside the db container using:\ndocker exec -it db bash\n\nLog in to MySQL inside db container:\nmysql -u root -p\r\nPassword\n\nThen use database: symcom_db.\nuse symcom_db;\n\nStep 4:\r\nGo to the symcom-app container,\r\nNavigate to symcom-laravel-app.\r\nInstall composer dependencies. composer install --no-dev --optimize-autoloader. The vendor folder will display upon successful installation.\nStep 5:\r\nThe docker-compose.yml file has database values:\nMYSQL_ROOT_PASSWORD: root\r\nMYSQL_DATABASE: symcom_db\r\nMYSQL_USER: user\r\nMYSQL_PASSWORD: password\n\nCreate a .env file in symcom-laravel-app, copy contents from .env.example script and replace the below values:\nDB_HOST=db # the container&#039;s name from docker-compose.yml file\r\nDB_DATABASE=symcom_db\r\nDB_USERNAME=user\r\nDB_PASSWORD=password\n\nStep 6:\r\nFrom the project files, go to symcom-core-app/config/route-sample.php and rename it to route.php and do the below changes:\n$dbHost = &#039;db&#039;; # the container&#039;s name from docker-compose.yml file\r\n$dbUsername = &#039;user&#039;;\r\n$dbPassword = &#039;password&#039;;\r\n$dbName = &#039;symcom_db&#039;;\n\nThen, navigate to symcom-core-app/dev-exp/db-connection-pool-sample.php and rename it to db-connection-pool.php and do the same changes as mentioned above.\nStep 7:\r\nIn the project root terminal instance, navigate to db-setup directory. Execute the below command:\ncat new_symcom.sql | docker exec -i db mysql -u root -proot symcom_db\n\nThis will dumb the SQL data to the symcom_db database.\r\nHere symcom_db is the database name, if it is changes, the new database name should be provided.\nStep 9:\r\nIn the terminal instance of symcom-app container, navigate to symcom-laravel-app inside the container.\nExecute:\nphp artisan key:generate\n\nThis will generate APP_KEY which can be found in the .env file.\nStep 10:\r\nThen, execute migrations command for laravel:\nphp artisan migrate\n\nThis will install oauth SQL tables used by passport from laravel for authentication.\nStep 11:\r\nThen, inside the container, generate laravel passport keys which are used in the authentication process:\nphp artisan passport:keys\n\nThis will create .key file inside the storage directory inside the container.\nStep 12:\r\nThen, inside the container give permission to laravel files created:\nchown -R www-data:www-data storage bootstrap/cache \n\nchmod -R 775 storage bootstrap/cache \n\nfind storage -type f -name &quot;oauth-*.key&quot; -exec chmod 600 {} \\;\n\nStep 13:\r\nGo to the terminal instance of db container:\r\nCheck if personal access token is present in database inside the mysql container:\nSELECT * FROM oauth_clients WHERE personal_access_client = 1;\n\nIf not present, navigate to symcom-laravel-app and create one using:\nphp artisan passport:client --personal\n\nCheck oauth SQL table again:\nSELECT * FROM oauth_clients WHERE personal_access_client = 1;\n\nStep 14:\r\nFrom the project root terminal instance, navigate to symcom-core-app and rename .htaccess-local to .htaccess.\nRouting\nOnce the build is successful and docker containers are running, the application can be accessed at http://localhost/ when running in local environment.\nThe apache .conf file routes core PHP codes to symcom-core-app directory and API links with prefix api-link to symcom-laravel-app directory. Hence, the back-end links should be like this: http://localhost/api-link/login for endpoint login.\nTroubleshoot:\nIf new database is not created after docker compose build, use:\r\ndocker compose down -v\r\n\r\nThis will remove any volume previously built and new database will be created.\r\nAlternatively bash to backend database container after docker built and run is successful using:\r\n\r\ndocker exec -t db bash\r\n\r\nThis takes inside the db container.\r\n\r\nRun: mysql -u root -p\r\n\r\nThis will log in to mysql using root access. Root password is root.\r\n\r\nThen see all databases using: SHOW DATABASES;\r\n\r\nThe new database should be created and if not, then create a new database using mysql CLI commands.\r\n\r\n*** In order to view any tables and select rows other CLI actions can be performed here. ***\n"},"symcom-v2-documentation/Project-Structure":{"slug":"symcom-v2-documentation/Project-Structure","filePath":"symcom-v2-documentation/Project Structure.md","title":"Project Structure","links":["symcom-v2-documentation/Local-Setup-Guidelines"],"tags":[],"content":"project-root\r\n|-db-setup\r\n|-master-data-openapi\r\n|-symcom-core-app\r\n|-symcom-laravel-app\n\nAll files related to core PHP application can be found inside symcom-core-app directory.\r\nAll files related to PHP laravel application can be found inside symcom-laravel-app directory.\nThe whole application is built with core PHP, but the API for master-data including the user login/signup are built using PHP Laravel framework.\nThe master-data-openapi directory contains yml files which includes documentation for the API.\nThe database setup, SQL files are present inside db-setup directory. The installation details of these SQL tables to the docker MySQL database is available in Local Setup Guidelines."},"symcom-v2-documentation/Resolution-of-slowness.-Symcom-Current-Version-vs-New-Version":{"slug":"symcom-v2-documentation/Resolution-of-slowness.-Symcom-Current-Version-vs-New-Version","filePath":"symcom-v2-documentation/Resolution of slowness. Symcom Current Version vs New Version.md","title":"Resolution of slowness. Symcom Current Version vs New Version","links":[],"tags":[],"content":"The slowness as reported by client has been mainly encountered in the comparison page.\r\nUpon thorough analysis, it has been found out that the factors like loading of connections of each symptom and reloading of comparison webpage upon successful operations like CE and PE were majorly responsible.\nIn the current Symcom version, connections are loaded in the below mentioned approach:\nStep 1: Each of the initial symptom ids and comparing symptoms ids are kept in separate PHP arrays during page load.\n\n$singleConnectionsInitials = array();\n$singleConnectionsComparative = array();\nStep 2: These arrays are converted and made compatible as JS arrays.\n\n$singleConnectionsComparativeString = (!empty($singleConnectionsComparative)) ? implode(&#039;,&#039;, $singleConnectionsComparative) : &quot;&quot;;\n var singleConnectionComparativeCheck = [&lt;?php echo $singleConnectionsComparativeString; ?&gt;];\n \nvar singleConnectionInitialCheck = [&lt;?php echo $singleConnectionsInitialsString; ?&gt;];\nStep 3: These arrays are then sent as parameters in JS functions which performs ajax calls to a backend PHP script, which goes through each of the symptom ids in the array, perfoms SQL operations for each of them, fetches connections and sends back the response with connection data to another JS function which makes the html element for each of the connected symptom and attaches the html element in the comparison webpage.\n\nStep 4: Comments, footnotes or translations are furthur loaded into after connections are attached in the webpage.\n\nThis whole operation of taking each symptom ids, connecting to backend script with ajax and attaching the returned response as html elements in the webpage takes much time if many initial symptoms and comparing symptoms are loaded in the webpage which slows down the page reloading operation.\n\nImprovements in the new Symcom version\nIn the new version, loading of connections are not done via JS and ajax calls. When symptoms are loaded from the PHP script, a function is called which checks and loads connections for each of the symptom, so there is no waiting for connections after webpage is loaded once in the browser.\nAny operations of connections like connect, CE, PE, paste or swaps do not reload the webpage. Only the affected symptoms pairs are modified via JS and CSS.\nImprovements were already implemented in the highlighting function for matched words. Each symptom ids are checked with asynchronous JS functions and highlights are added to the symptom texts. These JS functions as compared to the existing versions, do not wait for the whole page to load, and execute in the background and highlights are loaded as user scrolls through the page.\nMoreover, for the comparison page, previously used html attributes and elements but which are obsolete now are being removed. Html elements for the initial and comparing symptoms are now simpler with less elements and data attributes which reduces the load time.\nLoading of comparatives in batches has been implemented like the current version, with improved modifications for highlights function.\nFurthermore, the new version of Symcom has refactored database due to which there are less calls for queries and operations as compared to the current version."},"symcom-v2-documentation/Symcom-Documentation-V2.0":{"slug":"symcom-v2-documentation/Symcom-Documentation-V2.0","filePath":"symcom-v2-documentation/Symcom Documentation V2.0.md","title":"Symcom Documentation V2.0","links":["symcom-v2-documentation/Project-Structure","symcom-v2-documentation/Local-Setup-Guidelines","symcom-v2-documentation/Testings"],"tags":[],"content":"Version 2.0\nSymcom version 2.0 is in development phase and details on the latest changes are mentioned in below links.\nProject Structure\nLocal Setup Guidelines\nTestings"},"Topics/Actualization-of-date-and-time":{"slug":"Topics/Actualization-of-date-and-time","filePath":"Topics/Actualization of date and time.md","title":"Actualization of date and time","links":["tags/general"],"tags":["general"],"content":"general\nWhenever any actions are taken in the comparison page like connect, paste, connect edit, paste edit, comment/footnote/ non secure/ marking operations etc. or in the import page, the latest time and date in the materia medica and import tables are displayed.\nTechnical Help:\nFor updating of time “updateDateOfModifiedSources()” PHP function is used, this function takes the “quelle_id” as parameter  and make changes in the “stand” field of the “quelle_import_master” SQL table.\nRelated PHP scripts:\n\n\nadd-source-translation.php\n\n\ncomparison.php\n\n\ncomparison-super.php\n\n\nconnect-edit-operation.php\n\n\nconnect-swap-opearation.php\n\n\nconnection-delete-script.php\n\n\nconnection-save-script-earlier.php\n\n\nconnection-save-script.php\n\n\nfunctions.php\n\n\npaste-edit-operation.php\n\n\nupdate-marking-symptoms.php\n\n\nupdate-symptom-info-comparison-table.php\n\n"},"Topics/All-Connection-Business-Logic":{"slug":"Topics/All-Connection-Business-Logic","filePath":"Topics/All Connection Business Logic.md","title":"All Connection Business Logic","links":["tags/comparison"],"tags":["comparison"],"content":"comparison\nFor ongoing connection:\n\n\nComparing symptom after connect, further connect can be done with that symptom appearing under other initials.\n\n\nComparing symptom after connect, further paste and paste-edit cannot be done with that symptom appearing under other initials.\n\n\nComparing symptom after connect-edit, further connect can be done with that symptom appearing under other initials.\n\n\nComparing symptom after connect-edit, further paste and paste-edit cannot be done with that symptom appearing under other initials.\n\n\nMultiple connect-edit can be done under same initial.\n\n\nComparing symptom after paste, further connect, connect-edit, paste and paste-edit cannot be done with that symptom appearing under other initials.\n\n\nComparing symptom after paste-edit, further connect, connect-edit, paste and paste-edit cannot be done with that symptom appearing under other initials.\n\n\nComparing symptom after swap connect or swap connect-edit, further connect, connect-edit, paste and paste-edit cannot be done with that symptom appearing under other initials.\n\n\nIf initial symptom has ongoing connection then no swap connect or swap connect-edit connection is possible.\n\n\nIf swap connect or swap connect-edit is done with one initial, no further connections or disconnections are possible with the other comparing symptoms appearing under that initial.\n\n\nAll connected comparing symptoms will be sorted chronologically with year when displayed.\n\n\nFor previous connection:\n\n\nIf a comparing symptom has previous connection like connect, connect-edit, paste, paste-edit or swap and if this comparing symptom is connected with the initial via any connection like connect, connect-edit, paste and paste-edit, then the previous connections will also get connected to the initial.\n\n\nIf initial symptom has previous connection like connect, connect-edit, paste, paste-edit or swap, then after connection of the initial with a comparing symptom, the previous connection of the initial symptom will remain in the same previous connection state.\n\n\nDisconnection of a previous connected symptom will make the symptom a free symptom and the symptom will appear as initial symptom or comparing symptom depending on the source in which it belonged.\n\n\nAny previous connection like connect, connect-edit and swap will not be affected and would act normally in all connection.\n\n\nAll connections between initial and comparing symptoms happens at one-to-one level. When comparing symptoms with previous connections are performed any connections, then the previous relationships die and new connection with initial symptom is established.\n\n\nImportant Points on Disconnection of Edited Connections:\n\n\nIf an edited connection is disconnected that is if disconnection is done on connect-edit, swap connect edit connections then the symptom will go back to its previous state, which means previous grading which was effective on the symptom before that connection will be active.\n\n\nIf a comparing symptom has previous connections as its children and the comparing symptom is connected to the initial, then for the initial symptom the children of the comparing symptoms becomes step children and disconnection amongst any of these step children will not affect the state of the initial or comparing symptom.\n\n\nNOTE: After the comparison is saved, if the saved source is again used as initial or comparing source in a new comparison then the connections in that source will be shown as previous connections."},"Topics/Allen-Source-Import":{"slug":"Topics/Allen-Source-Import","filePath":"Topics/Allen Source Import.md","title":"Allen Source Import","links":["tags/import"],"tags":["import"],"content":"import\nAllen Sources are special sources where symptoms have references linked to it. These references can also have provers who have worked with that particular literature.\nExample of Allen source symptoms:\nAfter eating he seems intoxicated, [1].\nCareless ease, such as is often produced by a small dose of hasheesh, [24].\nHere in both the symptoms the numbers in square brackets “1” and “24” refers to the literature linked to it. These numbers are defined on top of the source document inside a literature block.\nExample:\nLiterature start\n@P:Hahnemann\n1, Hahnemann, R. A. M. L., 2, 273\n@P:Hornburg\n3, Hahnemann, R. A. M. L., 2, 273\n23, Davis, J. E. L, MS. proving, constant effect of the 3d dil.\n24, Wenzel, Trans. of the Alumni Ass. of the Hasp. Coll. of Med., Louisville Med. News, 3, 114, 1877, doses of 10 drops of tincture three times a day, for several days\nLiterature end\nHere, number “1” is linked with reference “Hahnemann, R. A. M. L., 2, 273” and the prover/tester associated with this literature is “Hahnemann”. Similarly, number “24” is linked with reference ” Wenzel, Trans. of the Alumni Ass. of the Hasp. Coll. of Med., Louisville Med. News, 3, 114, 1877, doses of 10 drops of tincture three times a day, for several days” and it is not linked to any provers as there is no direct ordering of provers before the literature with number “24”.\nNOTE: If a reference has multiple provers associated with a particular literature multiple direct ordering can be declared before the reference. Example:\nLiterature start\n@P:First Prover\n@P:Second Prover\n1, Hahnemann, R. A. M. L., 2, 273\n@P:Hornburg\n3, Hahnemann, R. A. M. L., 2, 273\nLiterature end\nHere, literture “1, Hahnemann, R. A. M. L., 2, 273” has multiple provers linked with it.\nTechnical Details:\nNote: In the below details reference and literature mean the same.\nManipulation of Allen source symptoms is done by the importedStringManipulationProces() PHP function which handles all the symptoms during import.\nBackground:\nAllen sources are special sources having literature start OR literatur start at the start of the document and literature end OR literatur end at the end of the document. It is imported from the same form where import of symptoms is done to the sources.\nBasic Workflow:\nStep 1: Literature detection and store.\n\n\nThe literature block with strings literature start and literature end is detected.\n\n\nThe function is continued with “isContinue” flag.\n\n\nKey “isPreDefinedReferenceSection” from “variablesArray” is used for furthur operation.\n\n\nChecks if prover is defined with the help of “directOrderDetection()” function.\n\n\nProvers found are stored in prueferFromParray key of the variablesArray.\n\n\nThe referenceNumber is detected and the reference is first searched if it is already present in the literatures SQL table. If present the id of the reference is taken out.\n\n\nIf literature is not present, new literature is inserted in the literatures SQL table and the ID is taken out.\n\n\nThe reference id, reference text, reference number detected and provers linked are kept in an array and this array is inserted to preDefinedReferenceArray key of the variablesArray.\n\n\nAs the program iterates through all the references and associated provers in the literature, all id’s of the references with the reference number is stored in preDefinedReferenceNumberArray key of the variablesArray. This keys of this array are the literature numbers and the values are literature id’s.\n\n\nStep 2: Linking of literature with the symptoms.\n\n\nAs the program finishes the literature block with the prepared literatures in preDefinedReferenceNumberArray array. The program now continues iteration with all the symptoms.\n\n\nIn the process of symptom string manipulation towards the end of the function, the program searches for the values of preDefinedReferenceNumberArray.\n\n\nIf the literature number in the symptom string is found, it is encapsulated with &lt;sup&gt; html tags.\n\n\nThe literature id associated with that particular literature id is then linked.\n\n\nLiterature text is first stored in the aLiteraturquellen key of the variablesArray and then it is finally added to EntnommenAus key of the same array. After which it is further processed for insertion in itemp_symptoms table and then to symptoms SQL table.\n\n\nAllen Source Import Symptoms in symptoms.php page.\n\nRelated scripts:\nfunctions.php\nsymptoms.php\n"},"Topics/Automatic-Symptom-Connection-Process":{"slug":"Topics/Automatic-Symptom-Connection-Process","filePath":"Topics/Automatic Symptom Connection Process.md","title":"Automatic Symptom Connection Process","links":["tags/comparison"],"tags":["comparison"],"content":"comparison\nThis process is available in the comparison process where an editor can choose to connect the highest matched comparative with the initial symptoms choosing a minimum percentage as lower limit for the automatic connection. Automatic connection only does normal connect connection.\n\nSome details of the automatic connection process.\n\nThe automatic connection process for comparatives with 100% match or identical pairs (where initial and comparative symptom both have same symptom text and same text format) starts at the time when new comparison process is initiated. These connections appears directly in the comparison page.\nWhen no current connections are made in the comparison page, a notice is shown to the editor to initiate the automatic connection process. If agreed, the editor is asked for automatic connection percentage and referred to the automatic connections page where all comparatives with highest match will be connected.\nA total of 100 initial symptoms are displayed in the automatic connection page. The editor has the option to view symptom info, translation or disconnect any connection.\nOnly cases where no swap connections are possible or comparatives which does not have any previous connections are considered for the automatic connection process.\nIf any time the automatic connection listing page is closed or the review process is cancelled, the editor is automatically redirected to the automatic connections page when the comparison is opened from the materia medica page.\n\nBackend Operations (Automatic Symptom Connections):\nFrom create-dynamic-comparison-table.php script:\n\nA temporary table for connections is created dynamically.\nThe script automatic-connection-of-symptoms-during-comparison.php is called using shell_exec().\n\nFrom automatic-connection-of-symptoms-during-comparison.php script:\n\nComparison table, absolute URL and editor initials are taken as input parameters.\nExecution for automatic connections are done from the initial symptoms in the main comparison table using batch processing method where initial symptoms are taken in batches of 10.\nFor each batch call to automatic-connection-of-symptoms-per-batch.php script is done via shell_exec().\n\nFrom automatic-connection-of-symptoms-per-batch.php script:\n\nSymptom information are collected for the initial symptom.\nSymptom information for the comparative with highest match percentage with the initial is taken out.\nBoth the symptom string of initial and comparative are sent as parameters to checkIfIdenticalSymptomPairs() PHP function to check if 100% identical match exists between the pairs.\nThe swap cases and comparatives having previous connections are excluded. checkIfPreviuousConnection() PHP function is used for checking if previous connections exists with the comparative symptom.\nFor each initial and comparative pair, all information required for insertion of information in the connections table is taken in a PHP array.\nThe array is then sent to connection-save-script.php via curl_exec() which does the connection and inserts into the connections table.\n\nFrom connection-save-script.php script:\n\nInput parameter connect_type is used for the connect connections.\nIf input parameter check_if_identical_pairs is  true and automatic connection flag automatic_connection is true, then connections is inserted in the connections table.\nIf input parameter check_if_identical_pairs is  false and automatic connection flag automatic_connection is true, then connections is inserted in the temporary connections table.\nIf in case, editor proceeds with manual connection then deleteTemporaryConnectionTable() PHP function deletes the temporary connections table and sets editor_connection_process flag to 0 in pre_comparison_master_data SQL table.\n\nBackend Operations (Automatic Symptom Connections List Display):\nFrom comparison.php script:\n\nThe automatic connection button with id = editor_connection_process displays a HTML modal with id = automaticConnectionConfiguration on click. This modal on submission redirects the editor to the automatic-connection-list-view.php script.\nIf manual connection is done in the comparison this button is disabled. The button is controlled both from frontend and backend. The button enabling and disabling classes are controlled by checkTemporaryConnectionTable() PHP function.\n\nFrom automatic-connection-list-view.php script:\n\nIf no temporary connections table is found, this script redirects the editor back to the comparison page.\nThis scripts updates the editor_connection_process field of the pre_comparison_master_data to 1 based on the id of the table.\nThe connections are retrieved from the temporary connections table for that particular comparison.\nPer page 100 initial symptoms are shown and the display of symptoms and their connections are similar to the work flows from the comparison page. The scripts involved are:\n\nsymptom-connection-operations-for-automatic-connections.php\nallIconFunctions2-jay.js\nconnect-saved-for-automatic-list.js\n\n\nIf disconnection of automatic connected symptoms is done by the editor then the flag is_disconnected_by_editor is set to 1 in the temporary connections table. This operation is execution by the connection backend script connection-save-script.php.\nThe finalization of the automatic connections can be done using the button with id = finalize_connection_process.\nThis button on click after confirmation, redirects the editor to automatic-connections-migration-script.php.\n\nFrom automatic-connections-migration-script.php script:\n\nAll connections from the temporary connections table are taken based on is_disconnected_by_editor = 0.\nThe selected automatic connections are then taken in a PHP array connectionsRowDataArray and each of them are then inserted to the connections table of the comparison.\nThe temporary connections table is then deleted.\neditor_connection_process flag in the pre_comparison_master_data is then set to 0.\n"},"Topics/Basic-Rules-relating-to-connection-of-symptoms-in-comparison-page":{"slug":"Topics/Basic-Rules-relating-to-connection-of-symptoms-in-comparison-page","filePath":"Topics/Basic Rules relating to connection of symptoms in comparison page.md","title":"Basic Rules relating to connection of symptoms in comparison page","links":["tags/comparison"],"tags":["comparison"],"content":"comparison\nPASTE EDIT RULES\nRule 1 : Paste Editing a Comparative Symptom in some section, will not change the same Comparative Symptom and Percentage in other sections.\nRule 2 : Multiple Paste Edits can be made in one section.\nRule 3 : If a PE is done on a Comparative Symptom in some section. The same Comparative Symptom in other sections cannot have a PE. \nRule 4 : PE is generally shortening of symptom text. \nRule 5: PE symptoms are placed after its connected initial symptom when comparison is finalized and the final comparison list is displayed.\nCONNECT &amp; CONNECT-EDIT RULES\nRule 1: If a Connect-Edit is present in a particular initial symptom, then we cannot do another CE in the same section.\nRule 2: Multiple CE of comparative symptom is possible.\nRule 3: If a Comparative Symptom already has a CE in some section, we should be able to simple Connect the same Comparative Symptom to other Initial Symptoms in other sections.\nRule 4: When we simple Connect a Comparative Symptom with an Initial Symptom in some section, then the Initial Symptom gets connected with the same Comparative Symptom in all other sections. Now, if we CE a Comparative Symptom in the same section and edit the Initial Symptom, then the Initial Symptom will change in all the connections of Comparative Symptoms in all other sections.\nRule 5: A Comparative Symptom that already has a simple Connect, will remain as it is, even if the Initial Symptom Changes due to a CE in the same section, resulting in a fall of Percentage. \nRule 6 : CE is generally change of gradings in the symptom text. \nRule 7: If an initial symptom has been changed grade many times by comparatives via CE, then if in some comparison the initial symptom is displayed with earlier CE connection, then disconnection of the connected CE will changed the initial symptom text to its previous state.\nPASTE RULES\nRule 1: If a Symptom has a Connect or CE or Paste or PE then this Symptom cannot be Pasted anywhere in the Comparison.\nRule 2: Vice Versa, if a Symptom is Pasted, then this Symptom cannot have any Connect or CE or Paste or PE  anywhere in the Comparison. \nRule 3: Paste symptoms are placed after its connected initial symptom when comparison is finalized and the final comparison list is displayed.\nSWAP RULES\nRule 1: SWAP can only be performed for Comparisons of Combined Sources and not on Single Sources. This is because, SWAP connections can occur only when the sources are from the same year or the comparing symptom year is older than the initial symptom year. In single source comparisons, the initial is always older than the comparing year, hence no SWAP is possible.\nRule 2: SWAP takes place only for Normal Connect and Connect-Edit When we Normal Connect or CE a Comparative Symptom with an Initial Symptom and the Initial Symptom is younger (or from the same year) than the Comparative Symptom, the system will prompt the User - Initial Symptom is younger than the Comparative Symptom. Do you want to Connect Vice versa or Connect-Edit Vice versa. (Depending on what action the user is taking, Connect or CE).\nRule 3: The Comparative Symptom which has been Swapped will have the SWAP icon highlighted everywhere in the document (Comparison).\nRule 4 : If an initial symptom is swapped, no further connections can be done with that initial.\nRule 5: If an initial has any connections existing under it, then the symptom cannot be swapped."},"Topics/Bönninghausen-Sources":{"slug":"Topics/Bönninghausen-Sources","filePath":"Topics/Bönninghausen Sources.md","title":"Bönninghausen Sources","links":["tags/import","Topics/Source-Import"],"tags":["import"],"content":"import\nBackground:\nBonninghausen is a special sources where symptoms are of different format in the original document. The source is not compatible for importing in the Symcom database and so Bonnighausen menu point  provides a platform which extracts the symptoms from Bonnighausen source and transfers the converted source and its symptoms to Symcom Master Data.\nIn order to import it, rubrics heading are first imported which is a document with headings and symptoms strings below it.\nExample of content inside the heading import document:\n@K:Gemüt\r\n\r\nI. - 1. - ANGEGRIFFENHEIT ÜBERHAUPT · gemüt\r\n\r\nAngegriffenheit.1\r\n\r\n@K:END\r\n\r\nI. - 1. - ANGST · Furcht · Schreckhaftigkeit · ängstlich\r\n\r\nAngst.1\r\n\r\nI. - 1. - BOSHAFTIGKEIT · gemein\r\n\r\nBoshaftigkeit.2\n\nHere, @K:Gemüt is the chapter hint. I. - 1. - ANGEGRIFFENHEIT ÜBERHAUPT · gemüt is the heading and from the below line Angegriffenheit. is the symptom with page number 1, which is at the end of the symptom string.\nSimilarly, I. - 1. - BOSHAFTIGKEIT · gemein is the heading, the below line Boshaftigkeit. is the symptom string with page number 2 at the end.\nOnce all headings are inserted to the database, the editors copy paste contents from a document which contains many Bonnighausen headings.\nExample of contents from the Bonnighausen headings:\n@G:1\r\n\r\n{2} bttb  I. - 1. - ANGEGRIFFENHEIT ÜBERHAUPT · gemüt  [ 124 ]\r\n\r\n{2} bttb  I. - 1. - ANGST · Furcht · Schreckhaftigkeit · ängstlich  °  [.69 ]\r\n\r\n{2} bttb  I. - 1. - HOFFNUNGSLOSIGKEIT · verzweifelt  °  [.46 ]\r\n\r\n{2} bttb  I. - 1. - MISSTRAUEN · Zweifel · Argwohn  [.27 ]\r\n\r\n{2} bttb  I. - 1. - VERDRIESSLICHKEIT · unzufrieden · mürrisch · übellaunig  [.87 ]\r\n\r\n{2} bttb  I. - 1. - VERLIEBTHEIT · Manie  [.45 ]\n\nIn the import process of these contents, the input headings sent for process are matched with the already existing rubrics headings. When the matched heading is found, the symptom associated with the heading is approved. The approved symptoms can later be transferred to the Symcom Master Data under Bonnighausen source. The un-approved headings are also available for analysis after import process is compete.\nTechnical Details:\nHeading import:\nThe rubrics heading needed to be imported first. The UI for headings import is handled by import-bonninghausen-rubick-headings.php script. The contents pasted in the text box when submitted is first validated by JS function.\nEach input line is processed one by one just like the Source Import process but is handled by importedStringManipulationProcessForBonninghausen() PHP function for string manipulations.\nThe imported symptoms are saved in the bonninghausen_symptoms SQL table. The table structure is same like the symptoms SQL table. Any grades associated in this process is saved in bonninghausen_symptom_grading_settings SQL table.\nThe display of imported headings and symptoms is handled by bonninghausen-symptoms.php script and is similar in code like the symptoms.php script.\nThe deletion of imported headings is handled by new_customised_datatable_list_view_form HTML id which then involves bonninghausen-rubrics-headings-delete.php script for deletion.\nBonnighausen Symptom import:\nThe import-bonninghausen.php script is the main UI for importing and transferring Bonnighausen symptoms. The headings to be imported are pasted in the text box and after submission is validated by JS function and then is processed by the same script.\nEach input line is processed one by one just like the Source Import process but is handled by importedStringManipulationOfBonninghausenHeading() PHP function for string manipulations.\nThe imported symptoms  after match with headings from are saved in the \tbonninghausen_approved_symptoms SQL table. The table structure is same like the symptoms SQL table. Any grades associated in this process is saved in bonninghausen_approved_symptom_grading_settings SQL table.\nThe un-matched headings are inserted in bonninghausen_re_importable_headings.\nThe approved symptoms are display under bonninghausen-approved-symptoms.php script and is similar in code like the symptoms.php script.\nThe un-approved headings are display under bonninghausen-un-approved-heading.php script and is similar in code like the symptoms.php script.\nThe deletion of imported headings is handled by new_customised_datatable_list_view_form HTML id which then involves bonninghausen-master-delete.php script for deletion.\nThe transfer of the symptoms to Symcom Master Data is processed after click on HTML class transfer-btn. It is then handled by bonninghausen-symptoms-transfer-to-main-import.php script. The symptoms and its related gradings are selected from bonninghausen_approved_symptoms and bonninghausen_approved_symptom_grading_settings SQL tables and is then inserted to symptoms and symptom_grading_settings SQL tables.\nOther related SQL table: bonninghausen_import_settings."},"Topics/Chapter-assignment-modification":{"slug":"Topics/Chapter-assignment-modification","filePath":"Topics/Chapter assignment modification.md","title":"Chapter assignment modification","links":["tags/chaptering"],"tags":["chaptering"],"content":"chaptering\r\nAny edits required for assignment chapters or to delete any assigned chapter, mode 1 of the chapter assignment process can be used.\nOn click of Edit option in mode 1, new chapters can be selected from the drop downs.\r\nHTML id chapterAssignSave initiates the save process of the chapters assigned.\r\nThis id calls a JS function saveAssignment() which calls another PHP script chapter-assignment-backend.php via AJAX to perform the operation.\nClicking the cross icons beside the chapter name deleted the chapters.\r\nHTML class deleteChapter is used for initiation of the delete process.\nFor non secure chapters, JS function addnscNoteChapter() is used.\nRelated PHP scrips:\nchapter-assignment.php\r\nchapter-assignment-backend.php\r\ndelete-chapter-assignment.php\r\nchapter-function.js\n"},"Topics/Chapter-Assignment,-Display,-Saving-Process-(Technical)":{"slug":"Topics/Chapter-Assignment,-Display,-Saving-Process-(Technical)","filePath":"Topics/Chapter Assignment, Display, Saving Process (Technical).md","title":"Chapter Assignment, Display, Saving Process (Technical)","links":["tags/chaptering","Topics/Chapter-Classification-Python-Program"],"tags":["chaptering"],"content":"chaptering\nAutomatic assignment process:\nChapters are automatically assigned by the chapter classification python program.\r\nThe python program is called via an API through PHP function fetchChapterForSymptom(). This function in turn call recursionArr() PHP function which separates the primary chapters, primary more chapters and secondary chapters based on the API response.\nThe assigned chapter ids are saved in the database in the completed SQL table of the comparison in a particular format.\nPrimary chapters ##&amp;## Primary More Chapters ##&amp;## Secondary Chapters ##&amp;## Tertiary Chapters.\nAlso, chapters are saved in the symptom_chapter_assignment SQL table which plays an important role during ordering of symptoms within a particular chapter.\nMore on the python chapter classification program. Check here:\r\nChapter Classification Python Program\nRelated-scripts:\nchapter-assignment-initiation.php\r\nmateria-medica.php\n\nOnce this process is complete, for any modification of assigned chapter mode 1 and mode 2 of the chapter assignment process can be used.\nSQL column value of chapter_assigned_complete from the pre_comparison_master_data SQL table is checked if the automatic assignment process is complete.\nImportant:\r\nWhen automatic assignment process is running, please make sure no other functionality of the chapter classification program should be used else the python server might throw an error.\nMode 1 of chapter assignment process\nchapter-assignment.php script is used.\r\nPHP flag $show_all_ns_unassigned is used for showing all the ns and unassigned symptoms.\nPHP function checkIfNoAssignedSymptomExist(completed_table_name)  is used to check if any unassigned chapters exist in the source.\nThe id’s returned by SQL query is kept in a PHP array $arrayWithAllUnassignedIds[]. This id is the used for fetching symptom information.\nBelow are HTML form id used for different processes.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIdAssociated withNoteassignFormLanguage changeassignSaveFormSaving, editing.showAllSymptomFormshowing all symptoms,showWithResetFormresetautoListFormChange to mode 2Target script: chapter-assignment-auto.phpshowNSSymptomsFormShowing non secure and unassigned symptoms.showChapterListFormGo to chapter listing page.Target script: symptom-chapter-list.php\nDisplay of chapter structure and their id’s\nEach chapter returned by the getAllChapters() PHP function is given an id. This id is then saved in the chapter column of the completed_table SQL table of the comparison.\nSuffix “_MC” is added to main chapters, “_SC” to sub chapters and “_SSC” to sub sub chapters.\nSaving of chapter assignment in the database:\nThe id’s of the chapters are saved in the chapter column of the completed_table SQL table of the comparison.  Chapters assignment of weights namely primary, primary more, secondary and tertiary are  saved in the chapter column separated by a delimiter ##&amp;##.\nFor example if assigned primary chapter is “01_MC”, assigned primary more chapters are “02_MC, 05_SC”, secondary chapters are “01_SC, 04_SC, 07_SSC”, then the chapter value in the SQL table will be:\n01_MC ##&amp;##  02_MC, 05_SC ##&amp;## 01_SC, 04_SC, 07_SSC ##&amp;## ##&amp;##\nwhich is of the form:\r\nPrimary chapters ##&amp;## Primary More Chapters ##&amp;## Secondary Chapters ##&amp;## Tertiary Chapters.\nRelated Scripts:\nchapter-assignment-backend.php\n\nMode 2 of chapter assignment process\nchapter-assignment-auto.php script is used.\r\nThe $displayPageId PHP variable is used to scroll and display the active symptom on top of the web browser when mode is changed from 2 to 1.\nImportant PHP functions associated with the chapter assignment process:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFunction namePurposeParameters SentgetArzneiTitelInChapterGet arznei title.arzneiIdcheckIfNoAssignedSymptomExistCheck if unassigned chapter exist.completedTablegetChapterInformationForChapterRetrieve symptom informationOriginal Quelle Id, symptom IdgetAllChaptersGet all chapters name as per structure.fetchChapterNameFetch the chapter name from the chapters tables.Chapter Id Array"},"Topics/Chapter-Classification-Model-Re-train":{"slug":"Topics/Chapter-Classification-Model-Re-train","filePath":"Topics/Chapter Classification Model Re-train.md","title":"Chapter Classification Model Re-train","links":["tags/chaptering"],"tags":["chaptering"],"content":"chaptering\nChapter classification model re-training can be done uploading a .txt file containing the chapter name and symptoms in particular format. The format is like this:\nChapter: Main Chapter Name\nSymptom ...\nSymptom ...\nSubChapter: Sub Chapter Name\nSymptom ...\nSymptom ...\nSubsubChapter: Sub Sub Chapter Name\nSymptom ...\nSymptom ...\n\nThis file can be automatically generated for each compared and chapter classified comparisons using the “Download File for Model Re-train” menu option from chapter assignment mode 1 and mode 2 pages.\nThe file downloaded can be uploaded to train the model using “Model Re-train” menu option. The language should also be appropriately selected in this process.\n\nBackend Scripts:\nchapter-download-file-for-model-re-train.php\nchapter-upload-file-for-model-re-train.php\n\nWorkflow involved in download process:\n\nOnce file down option is clicked, upon confirmation, modal with id chapterFileGenerationModal is initiated and displayed. This modal constitutes of a html form and submission is handled by the chapter-download-file-for-model-re-train.php backend script.\nMain chapter, sub chapter and sub sub chapter are taken out after selection of data from chapter column from the completed table of the particular comparison.\nFiles created are first saved in location /comparison-writing/ and then is deleted after the download process is successful.\n\nWorkflow involved in upload process:\n\nOnce the modal for chapter model re-train is submitting via form with id chapterFileUploadForm it is handled via AJAX.\nThe file and language input are taken to the backend script chapter-upload-file-for-model-re-train.php.\nAPI call on &quot;www.dev.reference-repertory.com:8000/&lt;language&gt;/upload?language=$lang&quot; is done to train the model.\nOn success, the user is notified with a message.\n"},"Topics/Chapter-Classification-Python-API-Guide":{"slug":"Topics/Chapter-Classification-Python-API-Guide","filePath":"Topics/Chapter Classification Python API Guide.md","title":"Chapter Classification Python API Guide","links":["UML","UML/JPGs","UML/DRAWIOs","PresentationNB.pdf"],"tags":[],"content":"Documentation Breakdown\nUML Diagrams\nAll technical documentation can be found under the directory UML.\nThere are provided:\n\n.jpg files, diagrams on the project’s current state.\n.drawio files in case of the need of updating documentation.\n\nSwagger Endpoint\nInformation regarding on how to use the endpoints + HTTP actions can be found on the swagger endpoint.\nExplanation “/input”s return\nPreviously “/input” would return a list of the names of every chapter found, without specifying accompanying symptoms.\nWhereas, currently:\n\nThe chapter’s ID on the database is returned instead of the name of the chapters.\nClassification will only occur to in a safe level of confidence. This is, if it is not clear to which subsubchapter a symptoms belongs, it will not be considered in the classification.\nThese are returned in a list. Where, if symptoms are syntatically considered to be related will be gathered in a ‘sub-list’.\n\nMore on the second change:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nInputClassification*I have a headache[ [ “Head, Inner”, “Forehead” ] ]I have a headache and my eye hurts[ [ “Head, Inner”, “Forehead” ], [ “Eye, Inner”, “Orbit” ] ]My eye hurts and I have migraine[ [ “Eye, Inner”, “Orbit” ], [ “Head, Inner”, “Temples” ] ]I have a headache and a migraine[ [ [ “Head, Inner”, “Forehead” ], [ “Head, Inner” , “Temples” ] ] ]\n*The database ID would be returned normally instead of the name of the chapter. Here the chapter name is used for visualization purposes\nChanges to DB structure\nIf there is ever the need to change the chapter structure in the database it will require to reset the server.\nIf the server is not reset, there might be unexpected behavior when new training data is given.\nHow Naive Bayes works\nGiven it was requested by Dr. Carl Rudolf to provide the resources used to explain how NB works you may find:\n\nThe .pdf for the presentation they were given on Februrary 2024.\nThe link to the video that based the presetation.\n"},"Topics/Chapter-Classification-Python-Database-Guide":{"slug":"Topics/Chapter-Classification-Python-Database-Guide","filePath":"Topics/Chapter Classification Python Database Guide.md","title":"Chapter Classification Python Database Guide","links":["databaseDump.sql","restServer/dataProcessing/util/databaseCredentials.py"],"tags":[],"content":"Connect custom MySQL Server\nThe described set-up is the most user-friendly way to create a local MySQL Server to back the application on. It consists of creating a Docker MySQL Container Server, and connecting it to MySQL Workbench and work from there.\nPrerequirements\n\nHave Docker installed.\nHave MySQL Workbench installed(MySQL Workbench 8.0 CE recommended).\n\nSet up Database Locally in Docker Container\nBE AWARE FOR PRODUCTION!!\nIf container is deleted entire database will be lost. It is suggestable to have MySQL database in local system and have periodical back-ups.\n\nCreate MySQL container server using:\n\ndocker run --name mysql -e MYSQL_ROOT_PASSWORD=&lt;password&gt; -p 3307:3306 -d mysql:8.0.36\nOn MySQL Workbench:\n\nNext to “MySQL Conections” click on ”+”.\nType “MySQLContainerServer” for “Connection Name”.\nChange “Port” to “3307”.\nClick on “OK”.\nThe password for the “root” user is the previous value of “&lt;password&gt;”.\nDouble-click on the “MySQLContainerServer” instance.\nClick on “Server” on the top menu.\nClick on “Data Import”.\nSelect “Import from Self-Contained File”.\nClick on ”…” and select databaseDump.sql.\nNext to “Default Target Schema” click on “New…”.\nType “symptom_classification” and click on “OK”.\nClick on “Start Import”.\nIf application will be run from Docker container set “host” to “host.docker.internal”, else set it to “localhost”.\nGo to databaseCredentials.py and change line 3 to the following parameters:\n\n...nectToMySQL(user=&quot;root&quot;, password=&quot;&lt;password&gt;&quot;, host=&quot;&lt;host&gt;&quot;, port=3307)"},"Topics/Chapter-Classification-Python-Guide":{"slug":"Topics/Chapter-Classification-Python-Guide","filePath":"Topics/Chapter Classification Python Guide.md","title":"Chapter Classification Python Guide","links":["database/README","restServer/dataProcessing/tests/","documentation"],"tags":[],"content":"Medical Symptom Classification System\nSystem Prerequisites\n\nHave python3 installed\nHave the MySQL server set up. Check README.\n\nRunning locally\nFrom the upmost directory of the project run:\npython -m pip install --upgrade pip\ncd ./restServer\npip install -r requirements.txt\npython -m nltk.downloader stopwords\npython -m spacy download en_core_web_md\npython -m spacy download de_core_news_md\nuvicorn main:app\nAfter running the image you may navigate to\r\n127.0.0.1:8000/docs to view the Swagger endpoint and investigate the available endpoints.\nRunning locally with Docker image\nMake sure your port 8000 is open and available. To do so:\ncd ./restServer\nufw allow 8000\ndocker compose up -d --build\nAfter running the image you may navigate to\r\n127.0.0.1:8000/docs to view the Swagger endpoint and investigate the available endpoints.\nAutomated Testing\nAutomated tests can be run as any other individual file. Example:\npython -m restServer.dataProcessing.tests.buildTree0Test\nThis command needs to be called from within the repository’s top directory, i.e.: ”./restServer”.\nRun Individual Files\nFiles (except tests) are not designed to display any output. But, they can be individually ‘ran’ using:\npython -m package.subpackge.file\nThis command needs to be called from within the repository’s top directory, i.e.: ”./restServer”.\nFor further documentation check the documentation directory"},"Topics/Chapter-Classification-Python-Program":{"slug":"Topics/Chapter-Classification-Python-Program","filePath":"Topics/Chapter Classification Python Program.md","title":"Chapter Classification Python Program","links":["tags/chaptering","Topics/Chapter-Classification-Python-Guide","Topics/Chapter-Classification-Python-Database-Guide","Topics/Chapter-Classification-Python-API-Guide"],"tags":["chaptering"],"content":"chaptering\nThe files are present under :\n/home/ubuntu/Documents/Docker/unidev2/restServer\n\nFirst build the docker image:\n sudo docker-compose up -d --build\n\nCheck important topics below:\r\nChapter Classification Python Guide\r\nChapter Classification Python Database Guide\r\nChapter Classification Python API Guide"},"Topics/Chapter-List-Display-and-Sorting-of-Symptoms":{"slug":"Topics/Chapter-List-Display-and-Sorting-of-Symptoms","filePath":"Topics/Chapter List Display and Sorting of Symptoms.md","title":"Chapter List Display and Sorting of Symptoms","links":["tags/chaptering"],"tags":["chaptering"],"content":"chaptering\nChapter List Display\nThe symptom-chapter-list.php script displays the assigned symptoms in order of the chapter structure. At max ten chapters can be displayed in this web page, PHP variable $perPageChapterHead controls the chapter head display.\nThe list displayed in this web page is provided with a “sort” icon for each chapter names. Clicking this button, redirects the program to the symptom sorting page.\nSorting of symptoms within a chapter:\nThe chapter-sort-symptoms.php script is associated with sorting of symptoms within a chapter. Symptoms can be clicked and dragged and drop at any location to sort it. The latest changed symptoms is shown in darker green color and the its previous place in lighter green color just after the drag and drop operation. jQuery function sortable() is used for sorting and retrieving the sorting data in frontend.\nTechnical workflow of sorting of symptoms;\n\nThe symptom is dragged and dropped.\nAjax request is sent to chapter-sort-symptom-backend.php script with newPositions array which contains the symptom ids of the new arrangement.\nAs per the data from newPositions array, the arrangement_order column from the symptom_chapter_assignment SQL table is updated to follow the new order. This column is responsible for display of the symptoms within a chapter in the saved order.\n"},"Topics/Chapter-Structure-Creation,-Installation,-Modification-Process":{"slug":"Topics/Chapter-Structure-Creation,-Installation,-Modification-Process","filePath":"Topics/Chapter Structure Creation, Installation, Modification Process.md","title":"Chapter Structure Creation, Installation, Modification Process","links":["tags/chaptering"],"tags":["chaptering"],"content":"chaptering\nChapter Structure Installation:\nChapter Structure can be initially installed following the chapter classification python program.\r\nWhen the python classification program is installed, the chapter structure and its related database tables are installed in the server.\nChapter Structure Modification:\nIn the chapter structure tables: chapter_main_head, chapter_sub_head, chapter_sub_sub_head, a column structure_id exists which controls the structure of the chapters.\nThe value of this id can be decimal and if new chapter is to be added under any main chapter or sub chapters, the values can be manipulated so that the new chapter appears in order as desired.\nHere’s an illustration:\nSuppose the below is data from  chapter_main_head SQL table.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nidmain_head_enmain_head_destructure_id1VertigoSchwindel12Head, outerKopf, außen2\nand suppose the below is data from  chapter_sub_head SQL table.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nidsub_head_ensub_head_deparent_main_head_idstructure_id1General outer headAllgemeiner äußerer Kopf212TemplesTempel22\nWe can see that the Head, outer main chapter has two sub chapters with id 1 and 2 respectively.\r\nIf a new chapter is to be added in before sub chapter with id 2 that is Temples, then the new added chapter row should contain structure_id value less than the structure_id value of Temples chapter. In this case, we can take values like 1.9. So the chapter_sub_head tables will now changes like this:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nidsub_head_ensub_head_deparent_main_head_idstructure_id1General outer headAllgemeiner äußerer Kopf212TemplesTempel223SkullSchädel21.9\nThis will ensure the chapter sub chapter Skull always comes before Temples when chapter structure is displayed and used in the program.\nIn this case, the chapter structure during display will be :\nVertigo\r\nHead, outer\r\n\tGeneral outer head\r\n\tSkull\r\n\tTemples\n\nImportant PHP functions related to chapters:\ngetAllChapters(): This function retrieves the chapter structure from the database based on the structure_id.\ngetAllChaptersWithPagination(start_page, per_page_chapters, master_chapter_arr)): This function helps retrieve chapters in parts. This is useful assigned symptoms are listed under chapter structure and the accommodating large chapter structure with symptoms becomes difficult in a single web page."},"Topics/Chapter-Structure-Database-Changes":{"slug":"Topics/Chapter-Structure-Database-Changes","filePath":"Topics/Chapter Structure Database Changes.md","title":"Chapter Structure Database Changes","links":[],"tags":[],"content":"Below SQL queries are executed after the classification database is created in the server.\r\nRun the below codes in symptom_classification database.\n-- Changes in chapter_main_head sql table.\n-- Column is added\nALTER TABLE chapter_main_head\nADD COLUMN structure_id INT DEFAULT 0;\n \n-- All values are set as per id\nSET @counter = 0;\n \nUPDATE chapter_main_head\nSET structure_id = (@counter := @counter + 1)\nORDER BY id;\n \n \n-- Changes in chapter_sub_head sql table\n-- Column is added\nALTER TABLE chapter_sub_head\nADD COLUMN structure_id INT DEFAULT 0;\n \n-- All values are set as per id\nSET @counter = 0;\n \nUPDATE chapter_sub_head\nSET structure_id = (@counter := @counter + 1)\nORDER BY id;\n \n \n-- Changes in chapter_sub_head sql table\n-- Column is added\nALTER TABLE chapter_sub_sub_head\nADD COLUMN structure_id INT DEFAULT 0;\n \n-- All values are set as per id\nSET @counter = 0;\n \nUPDATE chapter_sub_sub_head\nSET structure_id = (@counter := @counter + 1)\nORDER BY id;\n \n-- structure_id changed to varchar\nALTER TABLE `chapter_main_head` CHANGE `structure_id` `structure_id` VARCHAR(11) NULL DEFAULT &#039;0&#039;;\n \nALTER TABLE `chapter_sub_head` CHANGE `structure_id` `structure_id` VARCHAR(11) NULL DEFAULT &#039;0&#039;;\n \nALTER TABLE `chapter_sub_sub_head` CHANGE `structure_id` `structure_id` VARCHAR(11) NULL DEFAULT &#039;0&#039;;\nRun the below  codes in the development, staging and production environment. Avoid if changes already exists.\n--adding chapter weight\nALTER TABLE `symptom_chapter_assignment` ADD `chapter_weight` INT(10) NOT NULL DEFAULT &#039;0&#039; AFTER `chapter_id`;"},"Topics/Chapter-Structure-Guide":{"slug":"Topics/Chapter-Structure-Guide","filePath":"Topics/Chapter Structure Guide.md","title":"Chapter Structure Guide","links":["tags/chaptering","Topics/Chapter-Structure-Database-Changes","Topics/Chapter-Structure-Creation,-Installation,-Modification-Process","Topics/Chapter-Assignment,-Display,-Saving-Process-(Technical)","Topics/Chapter-assignment-modification","Topics/Chapter-List-Display-and-Sorting-of-Symptoms"],"tags":["chaptering"],"content":"chaptering\nInitiation of automatic chapter classification process:\nChapters can be classified to the final completed version of the comparison by clicking on the button shown below:\n\nThis starts the automatic chapter classification program in the background. It usually takes only a few seconds for a small comparison. Once this is completed, the browser will automatically redirect to the mode 1 (list view) of chapter assignment table.\n\nHere, if any change of assignment is needed, the edit button can be used. This button redirects to the mode 2 of chapter assignment section.\n\nEditing and deleting chapters:\nUpdating to any of the chapter weights can be done here using the Edit option. In order to delete the assignment the cross icon can be used, upon which a confirmation is asked to the user and accordingly function is executed. Simply clicking the cancel button will show the chapter assigned symptoms in current mode.\nFor navigation arrows can be used, as well as the custom input symptom number through the input field. Assignment can also be made not secured, with the help of NS button.\nAnytime assignment is made followed by the “Final” icon, the assignment is saved in the database and next symptom is automatically redirected in the browser.\nDisplay of symptoms as per chapter structure\nClicking on the “Show Chapter List” from the chapter section menu panel will display the assigned symptoms as per the chapter structure.\n\nOrdering of symptoms for a particular chapter:\nIf the order of the symptoms shown is to be changed, then the above sort button can be clicked.\n\nHere any of these symptoms can be changed from their displayed position by clicking the mouse and dragging in the desired location. The previous and current changed position will be displayed in green color for a second by the program for reference.\n\nTo go back, the browser back button can be used and it will show the new updated symptom list under that chapter in the structure.\n\nChapter Structure Technical Guide:\nChanges in the queries after installation of chapter classification python program:\nCheck: Chapter Structure Database Changes\nCheck additional important topics:\n\nChapter Structure Creation, Installation, Modification Process\nChapter Assignment, Display, Saving Process (Technical)\nChapter assignment modification\nChapter List Display and Sorting of Symptoms\n"},"Topics/Comparison-status-in-different-modes":{"slug":"Topics/Comparison-status-in-different-modes","filePath":"Topics/Comparison status in different modes.md","title":"Comparison status in different modes","links":[],"tags":[],"content":"Comparison status for a source is shown in the materia-medica page. The “comparison_save_status” field, in the “pre_comparison_master_data” sql table is given different value for controlling the status of the comparison.  “comparison_save_status” values:\n“0” ⇒ Blue, when editor is working on a comparison.\n“1” ⇒ Yellow, when editor saves a comparison.\n“2” ⇒ Green, when comparison is finally saved by the supervisor.\n“3” ⇒ Orange, when supervisor is working on a comparison."},"Topics/Comparison-Table-Creation-Process-(Batch-Processing)":{"slug":"Topics/Comparison-Table-Creation-Process-(Batch-Processing)","filePath":"Topics/Comparison Table Creation Process (Batch Processing).md","title":"Comparison Table Creation Process (Batch Processing)","links":[],"tags":[],"content":"Please Note: This process is not yet integrated to Symcom. Only tested. New codes from create-dynamic-comparison-table.php script might not be updated in this process. These needs review and updates before integration.\nWhen comparison button is clicked, the form with id “symptom_comparison_form” is submitted and an ajax request is sent to “check-if-comparison-table-exist-new.php” script along with all the relevant data required to start the comparison.\nBelow link shows the workflow of all the scripts involed in the process:\nDigramatical illustration of the comparison process.\nWorkflow of check-if-comparison-table-exist-new.php script:\n\n\nThe comparison table name is created using the word “comparison_table_” before arznei id, initial source id, comparing source id and the comparison language.\n\n\nThe existing table is first searched in the system from the “pre_comparison_master_data” mysql table and if the table is not present all prerequisite operations are done and comparison table and its highest matches table is created.\n\n\nThe number of initial symptoms is calculated and is then sent as parameters in the shell_exec() command to the script “create-dynamic-comparison-table-new.php”.\n\n\nParameters sent are:\r\n\r\ncomparisonTable =&gt; comparison table name.\r\n\r\nsavedinitialSourceTable =&gt; comparison table name when initial source is a saved comparison.\r\n\r\nsavedDataConnectionsTableOfInitialSource =&gt; connection table name when initial source is a saved comparison.\r\n\r\ninitialSourceId =&gt; initial source id which is quelle_id.\r\n\r\narzneiId =&gt; medicine id.\r\n\r\ncomparingSourceIds =&gt; comparing source ids.\r\n\r\npreComparisonMasterDatainsertedId =&gt; id from pre comparison master table.\r\n\r\ninitialRowsTotalRowsQueryRows =&gt; total number of initial source rows.\r\n\r\ncomparisonOptionToSent =&gt; comparison option.\r\n\r\ncomparisonLanguageToSent =&gt; comaprison language.\n\nWorkflow for create-dynamic-comparison-table-batch-processing.php script:\n\n\nThe parameters sent using shell_exec in the previous script is received.\n\n\nOn the basis of initialRowsTotalRowsQuery value, total batches are computed. Batch Size can be controlled from “batchSize” PHP variable.\n\n\nEach batch is iterated using a for loop and in each loop shell_exec() command is executed to “create-dynamic-initial-insertion-restart.php” script.\n\n\nParameters sent to &quot;create-dynamic-initial-insertion-restart.php&quot; script are:\r\n\r\ncomparisonTable =&gt; comparison table name.\r\n\r\nsavedinitialSourceTable =&gt; comparison table name when initial source is a saved comparison.\r\n\r\nsavedDataConnectionsTableOfInitialSource =&gt; connection table name when initial source is a saved comparison.\r\n\r\ninitialSourceId =&gt; initial source id which is quelle_id.\r\n\r\narzneiId =&gt; medicine id.\r\n\r\ncomparingSourceIds =&gt; comparing source ids.\r\n\r\npreComparisonMasterDatainsertedId =&gt; id from pre comparison master table.\r\n\r\nstartLimitOfInitialsToSent =&gt; start limit for mysql query.\r\n\r\nendLimitOfInitialsToSent =&gt; end limit for mysql query.\r\n\r\nsavedComparisonConnectionsArrToSent =&gt; array which includes connections table if sources are already saved combined sources.\r\n\r\ncomparisonOptionToSent =&gt; comparison option.\r\n\r\ncomparisonLanguageToSent =&gt; comaprison language.\n\n\nUpon completion of the above for loop another shell_exec() command are executed. On for “create-dynamic-insertion-highest-matches.php” and another for “create-dynamic-final-closure.php” script. The first one inserts the highest matched value of each comapring symptoms in the highest matches table. The second one inserts connections of each intial and comparing source if they combined saved source.\n\nWorkflow for create-dynamic-initial-insertion-restart.php script:\n\n\nThe parameters sent by its parent script thrrough script is received.\n\n\nBased on the “startLimitOfInitials” and “endLimitOfInitials” limit values, the initial symptoms are fetched out.\n\n\nFor each of these intial symptoms, a shell_exec() command is executed for “create-dynamic-comparing-selection-restart.php” script.\n\n\nParameters sent to create-dynamic-comparing-selection-restart.php script are:\r\n\r\nsavedComparingSourceTableToSent =&gt; comparison table name when comparing is already saved combined source.\r\n\r\ncomVal =&gt; quelle id of the comparing source.\r\n\r\ncomparisonTableToSent =&gt; comparison table name.\r\n\r\nrunningInitialSymptomIdToSent =&gt; initial id of the current loop.\r\n\r\narzneiId =&gt; medicine id.\r\n\r\nstartLimitOfComparingToSent =&gt; start limit for mysql query.\r\n\r\nendLimitOfComparingToSent =&gt; end limit for mysql query.\r\n\r\ncomparisonOptionToSent =&gt; comparison option.\r\n\r\ncomparisonLanguageToSent =&gt; comaprison language.\n\n\n\nAfter successful execution of each loops, this script seaches for the temporary table where comparing symptoms data are kept by the “create-dynamic-comparing-selection-restart.php” script.\n\n\nWhen temporary table exists and no error is found the comparing symptoms located in the temporary table are inserted to the dynmaic table batch by batch.\n\n\nBatch size can be assigned with “comparingInsertionBatchSize” PHP variable.\n\n\nFor each batch shell_exec() command is executed for “create-dynamic-comparing-insertion-restart.php” script which does the insertion in the comparison table.\n\n\nParameters sent to &quot;create-dynamic-comparing-insertion-restart.php&quot; script are:\r\n\r\ncomparisonTableToSentInsertion =&gt; comparison table name.\r\n\r\nstartLimitOfComparingInsertionToSent =&gt; start limit for mysql query.\r\n\r\nendLimitOfComparingInsertionToSent =&gt; end limit for mysql query.\n\nWorkflow for “create-dynamic-comparing-selection-restart.php” script:\n\n\nParameters sent from parent script “create-dynamic-initial-insertion-restart.php” are received.\n\n\nChecks if temporary table is created for this comparison. If not exist then temporary table is created.\n\n\nComaparing symptoms are fetched and inserted in the temporary tables.\n\n\nWorkflow for “create-dynamic-comparing-insertion-restart.php” script:\n\n\nParameters sent from parent script “create-dynamic-initial-insertion-restart.php” are received.\n\n\nComapring symptoms are fetched from temprary tables using “startLimitOfComparingInsertion” and “endLimitOfComparingInsertion” values.\n\n\nThe comaparing symptoms fetched are finally inserted into comparison table.\n\n\nWorkflow for “create-dynamic-final-closure.php” script:\n\n\nConnection table is created and connections if anything is found is inserted.\n\n\nPre comparison master data table is updated and status field is set to “done”.\n\n\nImportant:\nIn execution of this whole process, the initial symptom synonyms are kept in a txt file under the directory “comparison-writing”. After the whole process gets executed, this txt file is deleted from the directory.\nBasic row insertion illustration:\nBelow states the flow of execution for 3000 comparingf symptoms. Let’s say we have 100 initial symptoms and in each batch 10 initial symptoms are sent for execution,  each on of the  initial symptom is compared with 3000 comparing symptoms. And these 3000 comapring symptoms are first selected and inserted in temporary table in batches of 1000 untill all 3000 comparing symptoms are reached. Then from the temporary table out of the 3000 comparing symptoms which are freshly inserted, comparing symptoms are selected in batches of 500 and inserted in dynamic comparison table.\nInsertion for only one initial symptom is shown here.\nFor 10 intial symptoms per batch:\r\n\r\nAssuming overall 3000 comparing symptoms:\r\n\r\n    1st intial symptom:\r\n\r\n    {\r\n\r\n        1000 comparing symptoms are selected and compared.\r\n\r\n            -&gt; 1000 comparing symptoms are inserted in temp table.\r\n\r\n        next 1000 comparing symptoms are selected and compared.\r\n\r\n            -&gt; next 1000 comparing symptoms are inserted in temp table.\r\n\r\n        next 1000 comparing symptoms are selected and compared.    \r\n\r\n            -&gt; next 1000 comparing symptoms are inserted in temp table.\r\n\r\n    },\r\n\r\n    {\r\n\r\n        500 comparing symptoms are selected from temp table and inserted to comparison table.\r\n\r\n        next 500 comparing symptoms are selected from temp table and inserted to comparison table.\r\n\r\n        .\r\n\r\n        .\r\n\r\n        until 3000 all comparing symptoms are reached\r\n\r\n    }\r\n\r\n    temporary table is truncated here.   \r\n\r\n    2nd initial symptom:\r\n\r\n    {\r\n\r\n        .\r\n\r\n        .\r\n\r\n    }\r\n\r\n    3rd initial symptom:\r\n\r\n    .\r\n\r\n    .\r\n\r\n    10th initial symptom:\n\nControlling Batch Size &amp; Performance:\n1. Number of initial symptoms sent for execution is controlled by &quot;batchSize&quot; PHP variable in &quot;create-dynamic-comparison-table-batch-processing.php&quot; script.\r\n\r\n  \r\n\r\n2. Number of comparing symptoms to be compared for a particular initial is contorlled by &quot;comparingBatchSize&quot; PHP variable in &quot;create-dynamic-comparing-insertion-restart.php&quot; script.\r\n\r\n  \r\n\r\n3. Number of comparing symptoms to be inserted in the comaprison table is controlled by &quot;comparingInsertionBatchSize&quot; PHP variable in &quot;create-dynamic-comparing-insertion-restart.php&quot; script.\n\nImportant Configuration Setting:\n\n\nPersistent database connection is used in all the scripts.\n\n\nmemory_limit in PHP is kept infinite with the help of ini_set() php function.\n\n\nmax_execution_time is set to 0 with the help of ini_set() php function.\n\n\nmax_input_vars is set to 10000 with the help of ini_set() php function.\n\n\nCustomized error catching is done in a separate file.\n\n\nMysql variables like interactive_timeout, wait_timeout and connect_timeout are all default values at present.\n\n\n16gb and 4 cores.\n\n\nNOTE:  If more number of initial or comapring symptoms are compared, please ensure to tune the “batchSize”, “comparingBatchSize” and “comparingInsertionBatchSize” PHP variables for efficient system performance. For larger number of intials or comapring symptoms these values should be lower than the existing values for this particular server configuration.\nAdvantages and optimization as compared to previous code:\n\n\nThe previous workflow executes the whole process in one script due to which the resources allocated by memory are not released due to which full memory was utilized by the process. New process executes each part of symptom selection and insertion in separate scripts, these scripts after execution clears the resources allocated to them and thereby only 50% of the memory was used by the process, other 50% was cached by the system to perform all operations efficiently.\n\n\nDue to batch processing in new approach, the batch size can be manipulated as needed, resulting control of memory even for large data set comparison.\n\n\nAs compared to previous appraoch, new appraoch is 25% more faster in terms of overall process completion.\n\n\nAdditional Experiences &amp; Important Notes:\n\n\nMost PHP variables used are voluntarily unset after each operation as this helps in clearing the memory allocated more frequently, thereby these processes are not completley dependant on PHP garbage collector for resource operations.\n\n\nAll PHP variables and arrays are carefully checked and proceeded for operation in each script as undefined variables leads to PHP warnings and notices and this leads to creation of a large log file.\n\n\nThe whole set up is isolated from the existing development, staging and production environment for tests as there are many functions and scripts dependant on these processes and change of any used script during on going operation leads to error.\n\n\nPHP error logs are also generated by a custom script “create-dynamic-error-catch.php” which saves the errors in custom file inside the comparison-writing directory inside dev-exp. This needs to be removed later when full integration is done.\n\n\nFor database connection, a temporary static php script “db-connection-pool.php” is used at present. This  also needs to be dynamic later when full integration is done.\n\n\nPersisent database connection is used in the process. This ensures that no new connections for database are created for mysql operations resulting in a uniform and stable mysql processes throughout the operation.\n\n\nException handling for shell_exec() command using “error_get_last()” does not confirm accuracy in all cases so it is being used carefully.\n\n\nDue to batch processing, memory consumption by both php and mysql is uniform and hovers around 7GBs of used memeory. CPU processing stays stable at 20%.\n\n\nPlease ensure not to run large comaprison parallely with resource intensive operations like running another large comaprison or git push from different environment during large comparison operation as this may crash the server.\n\n\nGeneral technique for comaprison estimation:\nLet&#039;s say if:\r\n\r\n    Number of initial symptoms (A) = 4109\r\n\r\n    Number of comparing symptoms (B) = 3439\r\n\r\n  \r\n\r\n    Total expected rows in dynamic comparison mysql table = A * B + A\r\n\r\n    which will be = (4109 * 3439) + 4109\r\n\r\n                  = 1,41,34,960 rows.\r\n\r\n  \r\n\r\n    With configuration of 16Gb memory and 4 core CPU:\r\n\r\n    Total operation time : 14 hours.\r\n\r\n    Total space consumed by comaprison mysql table: 18.1 Gb.\n"},"Topics/Connections-among-sources":{"slug":"Topics/Connections-among-sources","filePath":"Topics/Connections among sources.md","title":"Connections among sources","links":["tags/comparison"],"tags":["comparison"],"content":"comparison\nConnections for comparative symptoms under initial symptoms can be done in the icons under “Command” column. All codes for connections are available in separate JavaScript files.\nConnections like connect, disconnect, non-secure connect, non-secure paste, paste, paste edit and connect-edit can be done. All connections are happening following connection rules.\nOther than connections, all symptoms can be added a comment, footnote, searched for its German/English translation and edited with icons under “Info &amp; Linkage” column.\nBelow are the technical steps followed when connections/disconnections are done:\n\nConnect (Connection):\n\n\n\nWhen connect button is clicked in the command icon group, with the help of “connect” class, a jQuery function is initiated.\n\n\nInitial symptom ID, comparing symptom ID, language, initial and comparing year are all extracted.\n\n\nThe program follows the business logic and accordingly starts checking the extracted variables or shows popups to prevent connection.\n\n\nIf the initial year is greater than the comparing year then SWAP connect connection operation starts.\n\n\nIf the initial year is equal to the comparing year then the user is shown a pop up message and option for swap connect, normal connect or just escape is given.\n\n\nIf the initial year is smaller than the comparing then normal connect opeartion starts.\n\n\nFor normal connection normalOperation() function is used. The clicked DOM element is send as a parameter for further operation.\n\n\nInside the function the values extracted from the initial and comparing symptom are then sent through a jquery function “saveConnects()”.\nFunction saveConnects() takes the below parameters:\nConnection Type, comparative ID, Initial ID, comparison language , connected percentage,  comparative symptom text, initial symptom text, comparing quelle code, initial quelle code, comparing year, encoded comparing symptom text de, encoded comparing symptom text en, comparing quelle original language, comparing quelle id, initial year, encoded initial symptom text de, encoded initial symptom en, initial quelle id, initial quelle original language.\n\n\nAfter this DOM manipulation takes place with the help of jquery.\nNOTE: Comparative symptoms after connection is kept inside the “comparativesConnectedCD” class. Initial symptoms after connection is kept inside the “initialsConnectedCD” class when displayed in HTML format.\n\n\n\n\nFor swap connection swapConnectOperation() function is used. The clicked DOM element is send as a parameter for further operation.\n\n\nIf any previous connections are found in the intial or the comparing symptom, then the previous connection details are kept inside an jquery array arrayForEarlierConnection[].\n\n\nAll extracted values like ids of the symptoms and arrays are then sent to “connect-swap-operation.php” via an ajax request for further operations and savings in the connection sql table.\nBrief workflow of “connect-swap-operation.php” script:\nThis function then sends the parameters to “connection-save-script.php” and saves the function parameters in connections SQL table via ajax call.\n\n\nInput received is validated.\n\n\nThe SQL table field with “symptom_id” matching to the initial id is updated:\n\n\nswap ⇒ 1\n\n\nswap_value_de ⇒ The comparing symptom string in German text.\n\n\nSwap_value_en → The comparing symptom string in English text.\n\n\nThe “id” of the initial symptom is fetched.\n\n\nThe subsequent “id” is stored in PHP variable $rowIdToInsertFrom.\n\n\nAll information of the initail id is taken out and stored in a PHP array $connectionDataArray.\n\n\nThe row fields of the comparing symptom id are updated with initial symptom texts, including the value of “swap” equals to “1”.\n\n\nAll comparing symptoms under the initial symptom are selected, then comparing symptom texts are compared with the changed initial symptom.\n\n\nThe compared results are then stored in PHP array $data.\n\n\nIf the “symptom_id” and “initial_symptom_id” of the comparing symptom equals to the initial id that was sent as a parameter, then the “symptom_id” including other fields like “quelle_code”, “quelle_titel” etc of the initial symptom id are updated with the values of that particular comparing symptom. Here the initial id is now fully swapped with the information of the swapped comparing symptom id.\n\n\nThe symptom id information which were in the $data array are then sorted and stored in the $completeSendingArray PHP array.\n\n\nBased on value of the $operationFlag, the ids in the $arrayForEarlierConnection array are compared with the initial and then stored in the array $earlierConnectionSaveArrayFinal.\n\n\nThe ids from the $completeSendingArray array are then appended below the initial id. (The comparing symptoms below the initial are at first deleted and then the new ids and information are inserted).\n\n\nThe ids from $earlierConnectionSaveArrayFinal array are updated in the connection sql table based on the values of $operationFlag.\n\n\nThe id’s with new highest matched percentages are then updated in the highest matches table.\n\n\nOn successful completion of the ajax request, the page is reloaded.\n\n\n\n\n\nConnect (Disconnection):\n\n\n\nOn clicking disconnect button, with the help of “disconnect” class, a jQuery function is initiated.\n\n\nThe program checks if SWAP connect connection exists, if not then below steps are followed.\n\n\nThe program first shows a pop up confirming the user’s input for disconnection operation.\n\n\nDisconnection can happen both from “comparativesConnectedCD” and “initialsConnectedCD” HTML classes. In both the cases the below steps are followed:\n\n\nThe “deleteSymptoms()” function sends the initial symptom ID and comparative symptom ID as parameters to “connection-delete-script.php” for backend disconnection from the connections SQL table.\n\n\nThe program checks if the connection is from previously connected connection with the help of “earlierConnection” class.\n\n\nIf the connection has “earlierConnection” class then the connected initial ID and the symptom ID is passed as parameter to “disconnectEarlierConnection()” functions. More details on this functions later in this documentation.\n\n\n\n\nAfter this the DOM manipulation takes place with the help of jquery.\n\n\n\n\nIf swap connection exist while disconnection, then below steps are followed:\n\n\nDisconnection of the swap connect can be done from the “comparativesConnectedCD” and “initialsConnectedCD” class. In each of the cases, below steps are followed.\n\n\nValues are extracted and sent to “connect-swap-operation.php” via an ajax request for further operations in the connection SQL table. (Swap disconnection process is same as swap connection, the symptom values are reversed and the existing swap connection is deleted form the connection table).\n\n\nAfter successful ajax request, the page is reloaded.\n\n\n\n\n\n\n\nConnect Edit (Connection):\n\n\n\nWhen connect edit (CE) button is clicked, all the information of initial and comparing symptom is extracted with the help of  “symptom-connect-edit-btn” HTML class.\n\n\nIf the initial symptom year is greater than the comparing symptom year the swap connect edit takes place.\n\n\nIf the initial year is equal to the comparing year then the user is shown a pop up message and option for swap connect-edit, normal connect-edit or just escape is given.\n\n\nIf initial symptom year is smaller than the comparing symptom year then normal connect edit operation takes place.\n\n\nNormal connect-edit operation takes place with help of ceNormalOperation() js function. While, the swap connect-edit operation is initiated by swapConnectCeOperation() js function. Both of these functions sends the clicked element as a parameter along with a flag “ceModalDisplay”. Both these functions calls ceModalDisplayFn() js function.\n\n\nThe ceModalDisplayFn() function displays the editor inside a pop up. It extracts the values necessary for the connect edit operation, also keeps the previous connections in an array arrayForEarlierConnection[] if found.\n\n\nOn editing of the initial symptom and submitting the connect edit modal, a jquery function is initiated with the help of “connect-edit-modal-submit-btn” class.\n\n\nIf the flag value of “swapCheck” is “1” then SWAP connect edit connection operation starts. The connectEditSwapOperation() js function is called. Inside the function the extracted values along with arrays is sent to “connect-swap-operation.php” for further operation in the mysql databases.\nNOTE: Steps for swap connect edit is same as swap connect. In the first steps, the initial symptom which is to be swapped is first checked if the initial has already been swapped (this is the case if the initial has previous swap connection and connection is possible), accordingly the sql field of the comparison table is updated with new text values and swap connect edit is further processed. In case of swap, all the comparing symptoms under that initial are checked and compared again, existing comparing symptoms are deleted and new comparing symptoms are inserted.\n\n\nIf the flag value of “swapCheck” is “0” then  normal connect edit operation starts. The function connectEditOperation() is called.  The program then follows the below steps.\n\n\nThe “connectEditOperation()” function takes initial symptom ID, comparative symptom ID, cut off percentage, edited initial symptom text, comparison language, comparison option, comparison table name and operation type as parameters and sends it to “connect-edit-operation.php” to perform backend operation. After successful completion of the backend operation, the comparison page is reloaded. \nBrief workflow of “connect-edit-operation.php” script:\n\n\nInput received is validated.\n\n\nThe SQL table field of the comparison table is updated:\n\n\nfinal_version_de ⇒ edited initial symptom text in german.\n\n\nfinal_version_en ⇒ edited initial symptom text in english.\n\n\nis_final_version_available ⇒ 1.\n\n\nThe id field from the comparison table having the initial symptom ID is taken out and is incremented by one and stored in a PHP variable $rowIdToInsertFrom.\n\n\nAll information of the initial symptom ID  is taken out in arrays.\nNOTE: PHP array $connectionDataArray is used for storing informations of the initial symptom and the comparing symptoms in the connections SQL table.\n\n\nThe comparing symptoms which is connected under that initial symptom is selected, and the comparing string is compared with the new edited initial symptom string.\n\n\nIf the new matched percentage is higher then the pervious matched percentage then the symptom ID of the comparing symptom is stored in $updateHighestMatchSymptomIdArray PHP array.\n\n\nAfter this, the comparing symptoms along with all updated information are stored in a PHP array “$data”.\n\n\nAll symptoms are then sorted according to the new matched percentage and are then copied to PHP array $completeSendingArray.\n\n\nAll the comparing symptoms under that initial are then deleted.\n\n\nInsertion of the new updated comparing symptoms are done from the $completeSendingArray PHP array.\n\n\nInsertion of the updated initial and the connected comparing symptom data are then inserted in the connections SQL table.\n\n\nThe highest matches table is then updated with the values from $updateHighestMatchSymptomIdArray PHP array.\nNOTE: Comparative symptoms after connection of connect edit is kept inside the “comparativesConnectedCE” HTML class. Initial symptoms after connection of connect edit is kept inside the “initialsConnectedCE” HTML class.\n\n\nIf initial is already swapped (previous connection), then accordingly other swap fields are updated instead of final version fields in the sql table.\n\nConnect Edit (Disconnection):\n\n\n\nWhen connect edit (CE) button is clicked for disconnection, the “disconnectCE” class calls a jquery function.\n\n\nThe user is first prompted with a pop up, on confirming the disconnection, the below steps takes place.\n\n\nWhen connection is disconnected from comparaing symptom under “comparativesConnectedCE” or  “initialsConnectedCE” HTML class, below steps stakes place.\n\n\nThe program extracts the ID’s of the comparing and the connected initial symptom.\n\n\nChecks if the connection is from previously connected connection with the help of “earlierConnection” class.\n\n\nIf the connection has “earlierConnection” class then the connected initial ID and the symptom ID is passed as parameter to “deleteSymptoms()” and “disconnectEarlierConnection()” functions. More details on these two functions later in this documentation.\n\n\nIf the connection is not an earlier connection then all the comparatives under that initial is first removed and a loader is shown.\n\n\nThe “connectEditDisconnectOperation()” function is called with parameters initial ID, comparing ID, cut off percentage, comparison option and comparison table name. The function then sends it to “connect-edit-operation.php” to perform backend operation. On successful execution, the comparison page is reloaded.\nWorkflow of “connect-edit-operation.php” script during disconnection is same as connect edit connection but the SQL fields “final_version_de”, “final_version_en”  are updated to NULL and “is_final_version_available” is updated to 0.  Rest process are all same except, insertion in the connection SQL is not done only deletion of the connect edit symptoms for that particular initial ID and comparing ID is done.\n\n\n\n\nIf the disconnection of connect-edit connection is done for swap connect-edited connection then connectEditDisconnectSwapOperation() function is used for further operation. It acts same like the connectEditDisconnectOperation() function.\n\n\n\nPaste (Connection):\n\n\n\nWhen paste button is clicked in the command icon group, with the help of “symptom-paste-btn” HTML class, a jQuery function is initiated.\n\n\nThe program follows the business logic and accordingly follows.\n\n\nInitial symptom ID, comparing symptom ID, language, initial and comparing symptom texts are all extracted.\n\n\nAll values extracted from the initial and comparing symptom are then sent through a jQuery function “saveConnects()”.\n\n\nThe functioning of the saveConnects() function is same as in the case of connect connection.\n\n\nAfter this DOM manipulation takes place with the help of jQuery.\nNOTE: Comparative symptoms after connection is kept inside the “comparativesConnectedPASTE”HTML  class. Initial symptoms after connection is kept inside the “initialsConnectedPASTE”HTML class when displayed.\n\n\n\nPaste (Disconnection):\n\n\n\nOn clicking disconnect button , with the help of “disconnectPaste” HTML class, a jquery function is initiated.\n\n\nThe program first shows a pop up confirming the user’s input for disconnection operation.\n\n\nIf the comparing symptom is inside the “comparativesConnectedPASTE” class then the below steps are followed.\n\n\nThe program checks if the connection is from previously connected connection with the help of “earlierConnection” class.\n\n\nIf the connection has class “earlierConnection”  then deleteSymptoms() function sends initial symptom ID, comparing symptom ID along with operation=’paste’ as parameters to “connection-delete-script.php” for backend disconnection from the connections SQL table. After successful execution the page is reloaded.\n\n\nIf the connection does not have class “earlierConnection”  then deleteSymptoms() function sends initial symptom ID, comparing symptom ID as parameters to “connection-delete-script.php” for backend disconnection from the connections SQL table. After this the DOM manipulation takes place with the help of jquery.\nThe “deleteSymptoms()” function sends its parameters (initial symptom ID, comparing symptom ID, operation) to “connection-delete-script.php”.\nThis function deletes connection between the symptoms in the connection SQL table and in the cases of paste and paste-edit, it updates the ‘connection’ field of the comparison table to ‘0’ if no connect and connect edit connections are found for the initial symptom ID in the connections SQL table.\n\n\n\n\n\nPaste Edit (Connection):\n\n\n\nWhen paste edit (PE) button is clicked, all the information of initial and comparing symptom is extarcted with the help of  “symptom- paste-edit-btn” HTML class.\n\n\nAny previous connection connected with the comparing symptom is taken inside the array “arrayForEarlierConnection[]”.\n\n\nThe values extracted are then sent to “paste-edit-operation.php” via ajax request for backend operation with MySQL table.\n\n\nAfter this DOM manipulation takes place with the help of jQuery.\n\n\nIf the source type is of combined, then the page is reloaded.\n\n\n\nPaste Edit (Disconnection):\n\n\n\nOn clicking disconnect button , with the help of “disconnectPE” class, a jQuery function is initiated.\n\n\nThe program first shows a pop up confirming the user’s input for disconnection operation.\n\n\nThe program then extracts the ids and other values required for disconnection and then sends to the “paste-edit-operation.php” via an ajax request for backend operation.\n\n\nAfter successful operation DOM manipulation takes place with the help of jQuery.\n\n\nFor connect:\nThe “connection” field in the comparison table is updated to “0” for that particular previous connected symptom. The connection is deleted from the connections table.\n\n\nFor connect-edit:\nFields like “connection”, “is_final_version_available”, “swap_ce”,” swap” are all updated to “0” in the comparison table for that particular previous connected symptom.\nFields like “final_version_de”, ”final_version_en”, ”swap_value_ce_de”, ” swap_value_ce_en”,” swap_value_de”, “swap_value_en” are updated to “NULL” for that particular previous connected symptom.\nNOTE: The disconnectEarlierConnection() function disconnects the previously connected connections in case of connect and connect-edit. Initial symptom id, Comparing symptom id and the connection type(CE or connect) is taken as parameter here.\n\n\n\n"},"Topics/Conversion-of-Grading-During-Display":{"slug":"Topics/Conversion-of-Grading-During-Display","filePath":"Topics/Conversion of Grading During Display.md","title":"Conversion of Grading During Display","links":["tags/general","tags/comparison","Topics/Punctuation-removal-from-grading"],"tags":["general","comparison"],"content":"general comparison\nSymptoms displayed on Symcom program are displayed in different text formats/ grades and this is the effect of Gradings assigned to the source or to specific symptoms in the program.\nBasic Workflow is mentioned here:\n\nThe convertTheSymptom() PHP function is responsible for affecting the grades of the symptoms during display.\nPunctuations are fixed from the symptom string. More on this: Punctuation removal from grading\nAll custom HTML tags (which are present in the symptom strings saved in the database) and their converted form are kept in conversionArr.\nBracketed part of the string which is imported as “part of symptom” is affected by grading, hence it is processed.\nThe global grade values assigned are taken out from SQL tables global_grading_set_values and global_grading_sets and kept in globalGradingSignArr with the grade format as its key and is kept in globalGradingArr.\n\n//Example:\n//if formatGrade fetched from SQL row is 3.\n//if formatCustomSign for that row is &quot;strong&quot;.\n$globalGradingSignArr[$formatGrade] = $formatCustomSign;\n//result:\n$globalGradingSignArr[3] = &quot;strong&quot;;\n\nThe grade settings for the symptom is first fetched from the source via quelle_grading_settings SQL table and if symptom specific grades are assigned then it is fetched from symptom_grading_settings SQL table.\nIf edit preview isEditPreview flag is active, which is the flag for showing the converted form when CE is done then the grade setting is fetched from temp_editable_symptom_grading_settings SQL table.\nAll the grade setting fetched are kept in sourceSettingData.\n\nBelow is an illustration on how symptoms will react when kursiv grades are converted from grade setting. This is done for each grade which have been assigned a setting.\n//Example:\n//For kursiv option if 3 is assigned in the grade setting, then.\n$sourceSettingData[&#039;kursiv&#039;] = 3;\n$kursiv = $sourceSettingData[&#039;kursiv&#039;];\n//The global grade for 3 is fetched from global grading array.\n$key = $globalGradingArr[$kursiv];\n//For kursiv, the symptoms are saved in the database with custom HTML tag &quot;non-asterisk-degree-em&quot;.\n//We make changes in the conversionArr.\n$conversionArr[&#039;non-asterisk-degree-em&#039;] = $key;\n//Since globalGradingArr[3] = &quot;strong&quot;, so non-asterisk-degree-em will be assigned &quot;strong&quot;\n//Result\n$conversionArr[&#039;non-asterisk-degree-em&#039;] = &quot;strong&quot;;\n\nIf includeGrade input parameter is active, grade numbers are attached to the symptom string.\nThe conversionArris finally processed and the key of this array is searched in the symptom string and is then replaced with the values of this array in the symptom string.\nFinal manipulation and cleaning is done and the finalized converted symptom string is then returned by the program.\n"},"Topics/Custom-text-box-for-page-navigation":{"slug":"Topics/Custom-text-box-for-page-navigation","filePath":"Topics/Custom text box for page navigation.md","title":"Custom text box for page navigation","links":["tags/comparison"],"tags":["comparison"],"content":"comparison\nCustom text box in the comparison page is used to navigate to the page when sources are big and large number of pages are shown in the comparison process.\nFrontend Changes\n\nUnder nav html tag of the pagination section, a span tag is created with class  custom-page-section.\nInside this class an input element is taken with name and id as custom_page_text_box.\nCSS changes are added in the new-comparison-table-style.css script under dev-exp/assets/css.\n\nEvent Control\n\nWhen id custom_page_text_box is changed, it is captured withon change JavaScript event.\nThe input value is validated only for digits and its range is checked within total number of pages.\nOnce validation is passed, the present address of the URL is taken in JavaScript variable presentAddress.\nThe variable presentAddress is checked for existence of page parameter and accordingly input page value is modified and the webpage is reloaded.\nFailure of validation leads to display of alert with message “No symptoms to show.”\n\nRelated Scripts:\n\ncomparison.php\ncomparison-super.php\nnew-comparison-table-style.css\n"},"Topics/Customized-Array-Creation-for-Initial-Symptom-Display-and-Customized-Pagination":{"slug":"Topics/Customized-Array-Creation-for-Initial-Symptom-Display-and-Customized-Pagination","filePath":"Topics/Customized Array Creation for Initial Symptom Display and Customized Pagination.md","title":"Customized Array Creation for Initial Symptom Display and Customized Pagination","links":["tags/comparison"],"tags":["comparison"],"content":"comparison\nThis array $customizedInitialArray[] is sent to “initialCustomListingModified()” PHP function for final display of initial symptoms in the comparison page. This array is a return from different functions which are responsible for customized filtration of symptoms in the comparison page.\nOn the basis of $unmarkedInitialsCheck value, different cases runs which gives this array final values. $unmarkedInitialsCheck value:\n1 ⇒ for unmarked initials display.\n2 ⇒ for general non secure initial display.\n3 ⇒ for non secure connect connection display.\n4 ⇒ for non secure paste connection display.\n5 ⇒ for display of all connections except normal connect and normal swap.\nFor unmarked, general non secure, non secure connect and non secure paste, “pastetNsArray(), connectNsArray(), generalNsArray(), markingInitialArray()” functions are used. These functions searches the initial via SQL query and returns the initial ids to this customized array.\r\n\t\r\nFor display of all connections except normal connect and normal swap: In this case customNsListings() functions is used. Basic workflow:\n\n\n\nSQL query is executed in the connections table. Initial ids, connection type, non secure connect and earlier connection flag for each search results are put in separate arrays.\n\n\nCase for multiple connect connection under same initial with no non secure connections are taken and then excluded from the final initial arrays.\n\n\nCase for only single connection under one initial which is connect and not non secure connect is taken and then excluded from the final initial arrays.\n\n\nSimilar cases for swap normal connect cases are also taken and excluded.\n\n\nIn brief: For each initial ids’, their key values are taken from the array, each key value is synchronized with non-secure connect, connection type and earlier connection arrays and overall process is executed using PHP predefined functions.\n\n\nFinal array is returned from the function and is then used for comparison process.\n\n\nThe total number of elements of this customized array and per page initial symptoms are finally used for display of initials in the comparison page.\n\n"},"Topics/Display-of-connected-symptoms":{"slug":"Topics/Display-of-connected-symptoms","filePath":"Topics/Display of connected symptoms.md","title":"Display of connected symptoms","links":["tags/comparison"],"tags":["comparison"],"content":"comparison\r\nNOTE:\r\nIn case of single source comparisons, the connections are displayed in order like: connect edit first, then connect, then paste edit and then paste.\nIn the case of combined source comparisons, the connections are displayed as per the latest connection order. This combined source when saved and converted to final completed version, the chronological order that is sorting in order of years (older year to newer) takes place.\nInstant display of connected symptoms is controlled by individual scripts of connect.js, paste.js, connect-edit-exp.js, paste-edit.js.\nDisplay of connected symptoms on load takes place with the help of “connectSave()” js function.\nSymptom ids are kept in js arrays when loaded according to source type: single or combined. This arrays are:\n\n\nsingleConnectionComparativeCheck\n\n\nsingleConnectionInitialCheck\n\n\ncombinedConnectionIntialsCheck\n\n\ncombinedConnectionComparativeCheck\n\n\nThese arrays then send the ids for taking out information with the help of “symptom-connection-operations.php”  php script.\nThe response from this script is then send as parameters to js function connectSave() js function which controls all the display of connected symptoms.\nWorkflow of connect-saved.js script.\nThe “connectSave()” js function is contained in the connect-saved.js script.\nBasic workflow:\n\n\nSwitch case controls every connection case.\n\n\nFirst the initial and comparative HTML symptom text is created using the values of the parameters.\n\n\nThe “source_type” parameters is detected. Source type can be “singleSourceInitial” which is for initials in single source comparison, “singleSourceComparative” for comparing symptoms in single source comparison, “combinedSourceInitials” for initials in combined source comparison, “combinedSourceComparative” for comparing symptoms in combined source comparisons.\n\n\nAfter this, the initials or comparing symptom ids are from the HTML DOM elements using jQuery based on their source type and are appended in the appropriate positions.\n\n\nAfter this, icons for info and linkage column and command columns are modified using “initialsWithComparativesConnectedBelow”, “comparativesWithInitialsConnectedBelow”, “initialsWithComparativesDisconnectedBelow”, “comparativesWithInitialsDisconnectedBelow” and “swapComparativesIcons” js functions.\n\n"},"Topics/Editor-Abbreviation-Column-in-Import-and-Materia-Medica":{"slug":"Topics/Editor-Abbreviation-Column-in-Import-and-Materia-Medica","filePath":"Topics/Editor Abbreviation Column in Import and Materia Medica.md","title":"Editor Abbreviation Column in Import and Materia Medica","links":[],"tags":[],"content":"In our current application, the initials of editors can be added or updated from the “user” menu point in Symcom program, these initials will get saved into the system and reflect in the Materia medica and import pages whenever any changes or modifications are made to the source or a comparison. For log in with “admin” credentials, the initial is taken as “ADMIN” by the program.\nPHP function getUserInitialFromId() is used to get the editor initials or abbreviation. The input parameter should be the user ID.\nNOTE: It is always recommended to follow the PHP script functions.php for proper syntax and parameter selection of all the PHP functions in this documentation."},"Topics/Editor-Privilege":{"slug":"Topics/Editor-Privilege","filePath":"Topics/Editor Privilege.md","title":"Editor Privilege","links":["tags/comparison"],"tags":["comparison"],"content":"comparison\nThe editor privilege is controlled by the $role PHP value. It is “1” for editor and “2” for supervisor. In the editor role, when the comparison is saved, markings for initials with no comparatives are not given as there maybe further edits from the supervisor and those no comparatives initials may show comparatives with different cut-off comparisons. Only in supervisor privilege, when a comparison is saved, all initials with no comparatives are given markings and then processed for SQL completed table creation process after which the comparison becomes a final source ready for more comparisons."},"Topics/Edits-in-symptoms-page":{"slug":"Topics/Edits-in-symptoms-page","filePath":"Topics/Edits in symptoms page.md","title":"Edits in symptoms page","links":[],"tags":[],"content":"Edits can be done for bracket contents, testers, footnotes, chapters and references in the symptoms webpage.\nAssociated scripts:\nassets/js/common.js\r\ndev-exp/functions.php\r\ndev-exp/get-all-provers.php\r\ndev-exp/symptoms.php\r\ndev-exp/save-edits-of-symptoms.php\n\nImportant PHP functions associated:\nfetchMultipleRows()\r\nupdateSymptom()\r\neditExecutionInSymptomsPage()\r\ngetAllTesters()\n\nImportant JS functions associated:\ngetAllProvers()\r\nsaveProverAfterEdit()\n\nNOTE: edit-icon class is added in each html element where edit is enabled.\r\nThis is then controlled by symptom-edit-cancel-btn and symptom-edit-save-btn html classes and JS events."},"Topics/Hering-source-Import":{"slug":"Topics/Hering-source-Import","filePath":"Topics/Hering source Import.md","title":"Hering source Import","links":["tags/import"],"tags":["import"],"content":"import\nTechnical Details:\nHering Sources are special sources with bar and pi symbols in the beginning of the string.\nIn some symptoms theta θ symbol which will appear at the end of the symptom string. The parts after the theta symbol including the symbol itself should not be affected by the grading process. Hering Sources will not contain different text formatting other than plain after the theta part.\nFor this, “symptom_theta_diagnosis” SQL table is created.\nPHP functions thetaDiagnosisOperation() is used for the processing of theta parts in a symptom during the import process. This function takes the symptom string as parameter and when theta symbol is detected, it extracts the characters after it and appends a customized HTML tag named “theta-normal” before saving it in the database.\nThis “theta-normal” customized tag is also added to the conversion array in convertTheSymptom() PHP function in order to make the whole string compatible for the grading process.\nWildcards like {{xoYox}} is used for theta symbol filteration in the convertPatternPortions() PHP function.\nNOTE: Any string manipulated in the import process must be made compatible for the grading process otherwise the program will not detect the symptom parts in order to process the grading operation. No nested tags should be present in the string which is saved in the database.\nFunction thetaInItalics() is used to convert theta symbol into italics in the display process.  It does not affect the values in the database.\nFunction fetchThetaPart() is used for extracting the theta parts from Hering symptom string, the input parameter is BeschreibungFull_de or BeschreibungFull_en which is present in the quelle_import_test i.e. symptoms table and it is of type string.\nAffected scripts:\n1. index.php\r\n2. functions.php\r\n3. symptoms.php\r\n4. delete-quelle-new.php\n\nNOTE:\nNo validation of HTML tags like &lt;em&gt;, &lt;bold&gt; etc and presence of special characters like ( , ), @, [, ] in the theta symptom part for Hering sources is applied  during programming.\nNew PHP variable $multipleCharControl is added to control the double appearance of bar and pi characters inside the bracket contents.\nThis variable is then passed as parameters to seperateTheBrackedString() function.\nif($parOccurrence !== false)\n    $BeschreibungOriginal = seperateTheBrackedString($BeschreibungOriginal, &quot;(&quot;, &quot;)&quot;,&quot;&quot;, $multipleCharControl);\n \n$braOccurrence = mb_strpos ( $BeschreibungOriginal, &quot;[&quot; );\n \nif($braOccurrence !== false)\n    $BeschreibungOriginal = seperateTheBrackedString($BeschreibungOriginal, &quot;[&quot;, &quot;]&quot;, &quot;&quot;, $multipleCharControl);\n \n$BeschreibungOriginal = removeBlankTags($BeschreibungOriginal);\nThis passed parameters act as a flag in the seperateTheBrackedString() function. If this flag is active then operations from the function findTheOpenedTag() is prohibited.\n//A part of the code inside the seperateTheBrackedString() function.\n$openedTag = findTheOpenedTag($remainingBeginingToOccurrenceString);\n$prohibitOpenTag = 0;\nif($multipleCharControl)\n\t$prohibitOpenTag = 1;\nif($openedTag != &quot;&quot; &amp;&amp; $prohibitOpenTag == 0){\n....\n....\n}"},"Topics/Import-section-additional-concepts-=-Allen,-Synonym":{"slug":"Topics/Import-section-additional-concepts-=-Allen,-Synonym","filePath":"Topics/Import section additional concepts = Allen, Synonym.md","title":"Import section additional concepts = Allen, Synonym","links":["tags/import"],"tags":["import"],"content":"import\nConcept as on date: Feb 18, 2023.\nAllen source Literatur/reference detection concept\nAllen sources are special kinds of sources where literatur/references are kept in the document in a different manner, which the program needs to understand and detect them and needs to assign the reference with the associated symptoms. Here is the example of a Allen source:\nLiteratur start\r\n1, Hahnemann, in Chr. Kn., S. Hahnemann, 1839.\r\n53, Fr. Hahnemann, in Chr. Kn., S. Hahnemann, 1839.\r\n22b, Nenning, in Chr. Kn., S. Hahnemann, 1839.\r\n4, Wahle, in Chr. Kn., S. Hahnemann, 1839.\r\n18a, Walther, in Chr. Kn., S. Hahnemann, 1839.\r\n34, Ardoynus, de venen, Lib. II, C. XV (statement, -Hughes), in Chr. Kn., S. Hahnemann, 1839.\r\n7, Hufel. Journ. (statement, -Hughes), in Chr. Kn., S. Hahnemann, 1839.\r\n8, Morgagni, de sed. et Caus. Mort. (observation, -Hughes), in Chr. Kn., S. Hahnemann, 1839.\r\nLiteratur end\r\n\r\nAgitation, with the sore throat, [53].\r\nAn indolent excitement, almost as after coffee, [1].\r\nShe talks nonsense day and night, [4].\r\nIrritated cross temper (eighth day), [22b].\r\nHeadache (ninth day), [18a]; (second day), [34], etc.\r\nDisturbance in the head, so that she thought she had lost her reason, [8]. [Revised by Hughes.]\n\nIn the above Allen source example the first paragraph contains only the literatur/references information. Here in the first paragraph we have two identifier text “Literatur start” and “Literatur end” for identifying the starting and ending of the literatur/references information section. In the Allen source document the strings after the identifier “Literatur end” are considered as symptom strings.\r\nThe literatur/reference identifying number which is found in the symptom string, is presented as a superscript number in the original version and the converted version of the symptom string. I.e.:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nImported symptomOriginal symptomConverted symptomHe believes he will not be able to recover his health, [4].He believes he will not be able to recover his health, 4.He believes he will not be able to recover his health, 4.\nSynonym concept\nWe have synonym database or synonym section in our main administrative panel as Synonyms main menu and two submenus synonym DE and  synonym EN .\nHere we store and manage all the synonyms of their respective languages, we can add new and modify existing synonyms.\nNow when we import a source it collects all the synonyms from the synonym database of the importing source language. In the import process for each symptom the program finds/match the similar word from the symptom string and the synonym database data. And the program links the matched word in the symptom string with synonym words that are matched and stores the information in the symptom string row. We can see these matched synonym information in the info popup box of the symptom string in comparison mask.\nWhen we compare two sources these linked synonyms are also used in the comparison. When two symptom strings gets compared these associated synonym words also participate in the comparison process.\nWe can also add a synonym after importing a source. We need to open the symptom view link of that source and there we will find a Add synonym column for each symptom string with “+” icon button, clicking on this plus icon opens up a popup to add a new synonym for that symptom. And this way also we can add a synonym. i.e.:\n\n\nWhen there is a source which is already imported, and after importing a source we add new synonyms. In this scenario we get an “update” button activated in the materia medica page synonym column with all sources rows which need to be updated with the latest synonym database.\n\nClicking on the “update” button/link of the synonym column(as shown in above screenshot) of a particular source, on the successful completion of the update process that particular source gets updated with the latest synonym database.       \nWe can not use a source or program will not allow a source to make any comparison with any other sources if that particular is not updated with the latest synonym database.\n@G: (Grading) concept\nWhen we import a source in the import page, there are several elements which gets detected  and identified as elements which has certain meanings in the application and need to get process accordingly.\nHere @G is one of the elements which has a certain meaning in the program. @G signifies the grading of a symptom, we can set gradings for a symptom or group of symptoms in the import process by providing @G sign just above the symptoms with the grading value. i.e.\n@G:2\r\n\r\nBeim Mittagsessen plötzlicher Schwindel, als sollte er vorwärts fallen [Gß.]\r\n\r\nBeim Gehen schwindlich [Archiv f. d. homöop. Heilk. V. III.]\r\n\r\n@G:END\r\n\r\nSchwindel in der Stirn, besonders beim Gehen, wo es ihr ist, als ginge alles mit ihr im Kreise herum und wollte mit ihr umfallen [A.f.d.H.]\r\n\r\nSchwindel; wenn sie sitzt und den Kopf vorwärts hält, fast unmerklich; wenn sie aber den Kopf aufrichtet oder bewegt, sogleich Gefühl, als ginge alles mit ihr herum [A.f.d.H.]\r\n\r\n@G:3\r\n\r\nSchwindel.\n\nIn the above example the first two symptoms are assigned with the grading value 2 and with the sign @G:END we are turning off the effect of the @G sign.\nThe symptoms which has gradings will get converted to their according fonts/formats which are set by the admin.\n@K: (Chapter) concept\n@K represents chapter. Same as above @G sign @K sign also has special meaning, When we have @K sign with a value(as chapter) the following symptoms underneath the @K sign will get associated with that value(chapter) until the turn off sign of the @K sign which is @K:END. i.e.\n@K:Kopf\r\n\r\nBeim Mittagsessen plötzlicher Schwindel, als sollte er vorwärts fallen [Gß.]\r\n\r\nBeim Gehen schwindlich [Archiv f. d. homöop. Heilk. V. III.]\r\n\r\n@K:END\r\n\r\nSchwindel in der Stirn, besonders beim Gehen, wo es ihr ist, als ginge alles mit ihr im Kreise herum und wollte mit ihr umfallen [A.f.d.H.]\r\n\r\nSchwindel; wenn sie sitzt und den Kopf vorwärts hält, fast unmerklich; wenn sie aber den Kopf aufrichtet oder bewegt, sogleich Gefühl, als ginge alles mit ihr herum [A.f.d.H.]\r\n\r\n@K:Kopf2\r\n\r\nSchwindel.\n"},"Topics/Important-Functionalities--and--their-workflows":{"slug":"Topics/Important-Functionalities--and--their-workflows","filePath":"Topics/Important Functionalities & their workflows.md","title":"Important Functionalities & their workflows","links":["tags/general"],"tags":["general"],"content":"general\nSource type of a symptom:\nSource type can be assigned for a source using the Books option from the master database Menu Point or by changing the settings of “Symptom Origin” under the the Symptom Type Setting Menu Point.\nSource type are given values as primary, secondary and undefined. If source type of specific symptoms having provers and literature reference needs to be changed then this can be done using the Symptom Origin option of the symptom type setting menu point.\nRelated PHP functions:\n1. fetchSourceTypeModified(symptom id, original quelle id, symptom end detection for t , tt and pallet)\r\n\r\n2.symptomEndIdentifyCheckForAlphaBetaAndT().\n\nBasic Workflow:\n\n\nfetchSourceTypeModified() function first searches for the source type assignment from “sources” SQL table.\n\n\nThen it searhces for assignment from “quelle_symptom_settings” sql table. By default the value is taken from “symptom_type_for_whole_origin” field of the sql table if present.\n\n\nChecks if prover or reference is linked to the symptoms and accordingly the source type is updated from the values of “quelle_symptom_settings” sql table.\n\n\nSymptom type of a symptom:\nSymptom type can be assigned for a source using the settings of “Symptomart” under the the Symptom Type Setting Menu Point.\nSymptom type are given values as proving, intoxication etc.\nRelated PHP functions: fetchSymptomTypeModified(symptom id, original quelle id, extracted symptom string parts based on custom tag)\nand symptomEndIdentifyCheckForAlphaBetaAndT().\nBasic Workflow:\n\n\nfetchSymptomTypeModified() function first searches for the source tyoe assignment from “quelle_symptom_settings” sql table.\n\n\nBy default the value is taken from “symptom_type_for_whole_origin” field of the sql table if present.\n\n\nChecks if prover or reference is linked to the symptoms and accordingly the source type is updated from the values of “quelle_symptom_settings” sql table.\n\n"},"Topics/Individual-upgrade-of-symptoms":{"slug":"Topics/Individual-upgrade-of-symptoms","filePath":"Topics/Individual upgrade of symptoms.md","title":"Individual upgrade of symptoms","links":[],"tags":[],"content":"Individual upgrade can be done from the comparison final view page.\r\nTinymce editor has been modified in common.js and new tiny mce editor has been defined for this individual upgrade of symptoms.\r\nAll grade icons has been redefined.\nIssues faced:\nSymptom text changes. Integrity of the spaces after grade effect.\r\n\r\nShowing correct grade with application of css properties defined in the symptom text.\r\n\r\nText management via css. Tiny mce helper function has been modified several times to reduce bugs.\n\nSymptoms individually upgraded are stored in edited_symptom_text_versions SQL table. It is considered as fixed grade so modifications are done in the convertTheSymptom() PHP function so that it retrieves the individually upgraded symptom from edited_symptom_text_versions SQL table.\nRelated PHP functions:\nupdateSymptomAfterEdit()\r\ngetEditedSymptomText()\r\n\n"},"Topics/Issue-with-less-than-and-greater-than-symptoms":{"slug":"Topics/Issue-with-less-than-and-greater-than-symptoms","filePath":"Topics/Issue with less than and greater than symptoms.md","title":"Issue with less than and greater than symptoms","links":[],"tags":[],"content":"This is one of the simplest scenario:\nThis is how a symptom exists in the word document.\n||For twelve days pain below right scapula; &lt; in evening, after exertion, by deep inspiration and by moving right arm; &gt; by pressure and lying down, especially on right side; the pain extends over a spot as large as the palm; when severe it extends to corresponding part of left side.\n\nThis is how it is saved in the database by the program:\n&lt;bar-two-normal&gt;For twelve days pain below right scapula; &amp;lt; in evening, after exertion, by deep inspiration and by moving right arm; &amp;gt; by pressure and lying down, especially on right side; the pain extends over a spot as large as the palm; when severe it extends to corresponding part of left side.&lt;/bar-two-normal&gt;\nThe &lt; is saved as &amp;lt; and &gt; as &amp;gt;\r\nThe semicolon appearing for these symbols, produces inappropriate results when processed by the program:\n&lt;bar-two-normal class=&quot;text-grade-2&quot;&gt;For twelve days pain below right scapula&lt;/bar-two-normal&gt;;&lt;bar-two-normal class=&quot;text-grade-2&quot;&gt; &amp;lt;&lt;/bar-two-normal&gt;;&lt;bar-two-normal class=&quot;text-grade-2&quot;&gt; in evening&lt;/bar-two-normal&gt;,&lt;bar-two-normal class=&quot;text-grade-2&quot;&gt; after exertion&lt;/bar-two-normal&gt;,&lt;bar-two-normal class=&quot;text-grade-2&quot;&gt; by deep inspiration and by moving right arm&lt;/bar-two-normal&gt;;&lt;bar-two-normal class=&quot;text-grade-2&quot;&gt; &amp;gt;&lt;/bar-two-normal&gt;;&lt;bar-two-normal class=&quot;text-grade-2&quot;&gt; by pressure and lying down&lt;/bar-two-normal&gt;,&lt;bar-two-normal class=&quot;text-grade-2&quot;&gt; especially on right side&lt;/bar-two-normal&gt;;&lt;bar-two-normal class=&quot;text-grade-2&quot;&gt; the pain extends over a spot as large as the palm&lt;/bar-two-normal&gt;;&lt;bar-two-normal class=&quot;text-grade-2&quot;&gt; when severe it extends to corresponding part of left side&lt;/bar-two-normal&gt;.\nThis processed symptom is shown to the user as:\nFor twelve days pain below right scapula; &lt;; in evening, after exertion, by deep inspiration and by moving right arm; &gt;; by pressure and lying down, especially on right side; the pain extends over a spot as large as the palm; when severe it extends to corresponding part of left side.\n\nNote:\r\nIf the processed program is to be manipulated, the replacement of semicolon ; of &amp;lt; or &amp;gt; directly may change the symptom string as semicolon appears also as part of the symptom.\nIf processing is made with usage of &lt; or &gt; symbols, it affects the xml tags and overall symptom structure is disturbed."},"Topics/Kent-Import-(Document-Modification)":{"slug":"Topics/Kent-Import-(Document-Modification)","filePath":"Topics/Kent Import (Document Modification).md","title":"Kent Import (Document Modification)","links":["tags/general"],"tags":["general"],"content":"general\nKent source documents are special type of documents, and these documents need to be restructured to make it compatible for the importing its information.\nWorkflow of the editor:\n\nThe editor selects all the data from the Kent document and copies it.\nNavigates to Kent Import menu point.\nPastes the copied data to the text editor.\nSubmits it. The program then modifies the submitted data, restructures it and the new modified Kent document is automatically downloaded in the browser.\n\nTechnical Flow:\na.  Submitted data is sent through method POST.\r\n\r\nb.  PHP Word class is initialized.\r\n\r\nc.  Each line is iterated.\r\n\r\nd.  modifyKentTagsCapitalizeFirst() PHP function, extracts the HTML tags and makes the first character uppercase. This function only checks the text words from the first(one or two) tags of the string.\r\n\r\ne.  The last occurrence of “(” and “)” is taken out and the page number is then extracted and appended to the front of the string with “@S: ”.\r\n\r\nf.  Final modified line is then inserted in “$finalContentArray[]”. This array is then inserted in the word document by the program and the document is downloaded in the browser.\n"},"Topics/Kürzel-combination-(Source-Code-Control)":{"slug":"Topics/Kürzel-combination-(Source-Code-Control)","filePath":"Topics/Kürzel combination (Source Code Control).md","title":"Kürzel combination (Source Code Control)","links":["tags/general"],"tags":["general"],"content":"general\nSource code is made combining abbreviations of authors + source name abbreviation 3 + band + year of the source.\nFor example: Source code can be : Jr SK2 1843.\nHere “Jr” is author abbreviation, “SK” is title abbreviation of  the source, “2” is band and “1843” is the year.\nTechnical Details:\nPHP function getSourceAbbreviationForMainSection() controls the source code display in the main section. For the master data section which is controlled by API, the source code is generated by SourceController and the function getSourceBookAbbreviationAttribute() defined inside the model file Source.php.\nThese two functions have the same return output.\nRelated SQL tables:\nAuthors\r\nSources\n\nRelated Scripts:\nfunctions.php\r\nSource.php\r\nSourceController.php\n"},"Topics/Listing-of-Initial-Symptoms-in-the-Comparison-Page":{"slug":"Topics/Listing-of-Initial-Symptoms-in-the-Comparison-Page","filePath":"Topics/Listing of Initial Symptoms in the Comparison Page.md","title":"Listing of Initial Symptoms in the Comparison Page","links":["tags/comparison"],"tags":["comparison"],"content":"comparison\nListing of initial symptoms are dynamic. Not only the normal display but customized display of non secure connections and unmarked initials are all done in the “comparison.php” page using the initialCustomListingModified($param, $db, $comparison_table, $page_start, $per_page_initial, $customized_array) PHP function.\nThis function takes database connection, comparison table name, start value of page, per page initial symptom number, value for handling the function and a customized array as parameters.\n$param values:\n1 ⇒ for unmarked initials display.\n2 ⇒ for general non secure initial display.\n3 ⇒ for non secure connect connection display.\n4 ⇒ for non secure paste connection display.\n5 ⇒ for display of all connections except normal connect and normal swap.\nother(default) ⇒ normal display of initials with connections and comparing symptoms.\n$customized_array: PHP array sent from pagination function to control the number of initials to be displayed. This array is  different and has different values.\nThis array is associated with “customNsListings(), pastetNsArray(), connectNsArray(), generalNsArray(), markingInitialArray()” PHP functions which are all responsible for display of initials and the pagination control of the comparison page.\nBasic Workflow of initialCustomListingModified() function:\n\n\nThe total count for the customized array is taken out. It is then used for customized pagination.\n\n\nAccording to start value of the page and the per page initial symptom number, a new PHP array $displayInitialArray[] is created using the $customized_array[] values.\n\n\nFor each id’s of the $displayInitialArray[] array, modified SQL query (as per the value for handling the function) is executed and the info of the initial id is taken out and stored in $allInitialInfo[] array. This array is then returned by the function and is used for display in the comparison page.\n\n"},"Topics/Loading-more-comparatives-in-batches":{"slug":"Topics/Loading-more-comparatives-in-batches","filePath":"Topics/Loading more comparatives in batches.md","title":"Loading more comparatives in batches","links":[],"tags":[],"content":"Div element load more is added.\nHTML Class: load_more_comparatives\r\nJS : getComparativeDataInBatches()\r\nScript: generate-comparative-batch.php\r\nPHP function: getTotalComparativesOfSingleInitialSymptom(), generateComparativeBatch()\r\n\n"},"Topics/Longer-comments-compatible-and-CSS-adjustment-in-symptoms-page":{"slug":"Topics/Longer-comments-compatible-and-CSS-adjustment-in-symptoms-page","filePath":"Topics/Longer comments compatible and CSS adjustment in symptoms page.md","title":"Longer comments compatible and CSS adjustment in symptoms page","links":[],"tags":[],"content":"Improvements:\r\nAdded CSS class comment_css for $row[&#039;Kommentar&#039;] in symptoms.php script.\r\nassets/css/custom.css\r\nInside script:\n/* larger comment css */\r\n.comment_css{\r\n  max-height: 150px; /* You can change this to your preferred height */\r\n  overflow-y: auto;  /* Enables vertical scrollbar when content overflows */\r\n  padding: 10px;\r\n}\n\nSQL changes with query done for development, staging and production databases:\nALTER TABLE `quelle_import_master` CHANGE `import_comment` `import_comment` TEXT CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT &#039;Comment (@C)&#039;;\n \nALTER TABLE `temp_quelle_import_master` CHANGE `import_comment` `import_comment` TEXT CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT &#039;Comment (@C)&#039;;\n \nALTER TABLE `quelle_import_master_backup` CHANGE `import_comment` `import_comment` TEXT CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT &#039;Comment (@C)&#039;;"},"Topics/Marking-of-Symptoms-(Technical-Details)":{"slug":"Topics/Marking-of-Symptoms-(Technical-Details)","filePath":"Topics/Marking of Symptoms (Technical Details).md","title":"Marking of Symptoms (Technical Details)","links":["tags/comparison"],"tags":["comparison"],"content":"comparison\nDatabase: In the main comparison SQL table, the marking is kept in a field name “marked”. The value is “1” when marking is active and by default, the value is “0”.\nAutomatic marking functionality by the program:\n\n\nInitial symptoms with marked value “0” is kept in a php array “markSymptomIds[]”.\n\n\nThis array is then transferred to js array with array name “markSymptomIdsFinalArray[]”.\n\n\nAll the ids in this array are then iterated and if there are no comparatives below this initial, a check mark is given using js function. The general non secure icon is also disabled at this point.\n\n\nNote: Automatic check marks given by the program is dynamic and the checkmarks will change its behavior according to the cut-off percentage of the comparison. Check marks are not directly updated in the SQL table, only when comparison is saved with supervisor privilege the marking with no comparatives will be given a value “1” and during the full comparison saving process.\nManual marking by the user:\nWhen marking is given manually, operation is proceed with the help of ajax.\n“update-marking-symptoms.php” page is used. The marked field in SQL table is updated to “1”.\nGeneral Non Secure (Technical Details):\nGeneral non secure icon is disabled for initial symptoms if the initial has connections or if there are no comparatives below the initial.\nClass ”gen-ns” is used for operating symptoms with general non secure.\nFetching information:\nInitial id and the comparison table name is sent as parameters to “get-general-non-secure-info-comparison-table.php” to fetch any general non secure information of the initial symptom.\naddGenNscNote function:\nJs function “addGenNscNote(param)” is used for adding or modifying information related to general non secure. For enabling general non secure, param value is “1” and for disabling, the value is “0”.\nValue for “confirming” is stored in “ns_confirm” and value for “new” is stored in “ns_new”.\nParameters are then to “update-symptom-info-comparison-table.php” via ajax where further backend modification with SQL table is done.\nNOTE:\nPHP flag “editingNs” is used to check the editing mode for operation of non secure symptoms. Accordingly “data-mark” attribute value is changed with element id “checkingNS”.\nNon secure connect and paste (Technical Details):\nFetching of information:\nClass “symptom-soft-connect-btn” and “symptom-soft-paste-btn” is used for opening the pop up and fetching information from the database.\n“get-non-secure-info-comparison-table.php” script is used to fetch information from the database.\nBackend modification:\nJs function “addnscNote()” is used for connect and “addnscNotePaste()” is used for paste non secure connections.\nSome important PHP functions:\n\n\ncheckInitialInConnectionForConnectConfirm(database, comparisonTable, initialId):\nThis function checks if the initial symptom has more than one connect connection in the connection table. The return value is used for further updation the “non_secure_connect” value in the comparison table during modification of the non secure connect connection.\n\n\ncheckInitialInConnectionForPasteConfirm (database, comparisonTable, initialId):\nThis function checks if the initial symptom has more than one paste connection in the connection table. The return value is used for further updation the “non_secure_paste” value in the comparison table during modification of the non secure paste connection.\n\n\ncheckComparativeConnection(database, comparisonTable, initialId):\nChecks for more than one connection with the same initial in the connection table.\n\n\ninitialCustomListing($param, $db, $comparison_table, $page_start, $per_page_initial):\nThis function helps in initial symptom listing in the comparison page. As per page number the query is modified.\n\n"},"Topics/Marking-of-symptoms":{"slug":"Topics/Marking-of-symptoms","filePath":"Topics/Marking of symptoms.md","title":"Marking of symptoms","links":["tags/comparison","Topics/Marking-of-Symptoms-(Technical-Details)"],"tags":["comparison"],"content":"comparison\nIn the comparison listing, with all initial symptoms there is a check box for marking. This is for quality assurance of the whole comparison during editing. Marking rules:\n\n\nIn fresh state of comparison, all initials will be marked unchecked. However, the initials with no comparatives are directly shown as marked by the program.\n\n\nWhen connections are made with an initial, the checkbox is shown as marked.\n\n\nInitial having comparatives but no connections are made by the editor, in this case the editor will have to mark the checkbox voluntarily.\n\n\nComparison with unmarked symptoms is not allowed to saved.\n\n\nTechnical Details:\nMarking is controlled both in the front end part and in backend.\nFront-end:\nFor initials symptoms with no comparatives, the marking is done with the help of js.\n\n\nDuring the process of listing of symptoms when comparison page is loaded, the initials with “marked” value “0” is stored in PHP array $markSymptomIds[].\n\n\nThis array is then converted to js array “markSymptomIdsFinalArray[]”. For each of the ids in this array, comparatives are checked below each initial id’s, if no comparatives are found then the marking checkbox is marked.\n\n\nAlso, for each of these initials with no comparatives, the general non secure connect button is disabled.\n\n\nBack-end:\n\n\nWhen marking checkbox is checked or unchecked by the user, ajax call is made to “update-marking-symptoms.php” script. Initial id, comparison table and marked Value (0 or 1) is sent as parameters here.\n\n\nThis scripts updates the “marked” field in the comparison table.\n\n\nMore Details: Marking of Symptoms (Technical Details)"},"Topics/Matched-percentage-and-highlighted-words-process-in-comparison-page":{"slug":"Topics/Matched-percentage-and-highlighted-words-process-in-comparison-page","filePath":"Topics/Matched percentage and highlighted words process in comparison page.md","title":"Matched percentage and highlighted words process in comparison page","links":["tags/comparison"],"tags":["comparison"],"content":"comparison\nDisplay of matched percentage is executed by a PHP function newComareSymptom() which is defined in the “functions.php” page.\n\n\nThe function is effective only when comparing symptom codes are executed in comparison page. This functions sends two parameters: the initial symptom text and the comparing symptom text.\n\n\nThe strings passed are first cleaned, removed any special characters, converted to lowercase and every word in symptom sentence is kept in an arrays. One for initial symptom and other for comparing symptom.\n\n\nFor the comparing symptom string, the words which are not “stop-words”, are kept in an array.\n“Stop words” are predefined words which prohibits the program from calculating matched percentage. These words are defined by the user. The “stop-words” panel can be accessed from the comparison page.\n\n\nBoth arrays are then filtered and words with greater than three characters are only kept.\n\n\nThe words are then intersected and unique words are only considered as matched.\n\n\nFirst match for similar words are considered, then match searching for characters in other words are also done. Only the unique matches are then considered.\n\n\nThe matched words are then encapsulated with an HTML tag for adding highlights (styling).\n\n\nFinally, word counts are taken and percentage is calculated for matched percentage. \n(check the newComareSymptom() function in functions.php page for the calculations involved)\n\n"},"Topics/Materia-Medica":{"slug":"Topics/Materia-Medica","filePath":"Topics/Materia Medica.md","title":"Materia Medica","links":["tags/general"],"tags":["general"],"content":"general\nContains all the source information. Provide with a panel for custom search operation.\nTechnical Details:\nThe search panel parameters are send with “POST” method.\nName used in the html form for searching: arznei_search_medica.\nJoining of SQL tables is for the result search.\nTables used: quelle_import_master, quelle, pre_comparison_master_data.\nThe field “is_materia_medica” in “quelle” SQL table should be “1”.\nComparison History:\nHistory of comparison of source is present here. Page provided with a search panel for custom search.\nWhenever a comparison is saved by the supervisor, a copy of the latest comparison (with all connections) is saved in the history page. After a comparison is saved, it is then converted to a final state which becomes eligible for further comparisons. By going to the history page the supervisor can again reactivate the last states of the comparisons of that source in case any more repair is required. Reactivating makes the source comparable again.\nTechnical Details:\nSQL tables used: quelle_import_master, quelle, quelle_autor, autor, pre_comparison_master_data, pre_comparison_master_data_for_history\n Saving of a comparison in the history page from the supervisor:\n Whenever a comparison is saved by the supervisor, the quelle_id, arznei_id and comparison_name is fetched from the “pre_comparison_master_data” table of that particular comparison, it is then send via an API to “update-comparison-name-new.php” script for further operations.\nWorkflow of this script:\n\n\nFetches all information of that source from the “pre_comparison_master_data” SQL table.\n\n\nInserts all the fetched records in the “pre_comparison_master_data_for_history” SQL table.\n\n\nThe inserted id is then kept in a PHP variable.\n\n\nDynamic creation of history table name is done for storing the state of the comparison.\n\n\nDynamic name created is used to create new history tables: dyanamic table, connections, completed and highest_matches.\n\n\nReactivation from the history table is done using the “reactivate-a-comparison-history.php” script in the “history.php” page. When reactivation is done the “comparison_save_status” value is updated to “1” in the “pre_comparison_mster_data” SQL table, which makes the comparison compatible for comparing again by the editors."},"Topics/Miscellaneous-Information":{"slug":"Topics/Miscellaneous-Information","filePath":"Topics/Miscellaneous Information.md","title":"Miscellaneous Information","links":["tags/comparison","tags/general"],"tags":["comparison","general"],"content":"comparison general\n\n\nComparison Loading: New HTML id bodyst is added to the comparison page. Whenever navigation is done in comparison page or comparison is opened from materia medica page, the comparison page will directly scroll to the above id and display the comparison.\n\n\nConnection Business Logic Validation: The backend validation of connection business logic was modified. PHP function “connectionBusinessLogicCheck()” controls the backend validation now and is added in all connection related scripts.\n\n\nGreen plus and minus icon colors for initial symptoms having active connection along with earlier connection:\n\n\nIn symptom-connection-operations.php script, when the rows of a particular initials are selected, the is_earlier_connection field is searched from the connections table and is checked if its value is “0”, which will mean that particular initial has current active connection. So only initials id with current active connections are kept inside this array.\nThe initial id and the current connection exists check are then kept in an array currentConnectionExistsArr which is returned as response.\nThe response is taken in the comparison page and for each of the initial ids, the toggleInitial html class is searched and if earlierSavedConnection class exists then earlierSavedConnection class is removed.\nAssociated scripts:\ncomparison.php\r\ncomparison-super.php\r\nsymptom-connection-operations.php\n\nNOTE: This operations are only work for combined initials symptoms. Refer to the symptom-connection-operations.php scripts for more details.\nLonger Session Fix:\nBoth session.gc_maxlifetime and session_set_cookie_params does not seem to work.\r\nA logic with timestamp is implemented in the route script.\nBut the full fix was done, by changing the phpini script in server both at the server PHP location and in the Apache root folder.\nServer side fixed by: server admin.\nRelated scripts:\nconfig/route.php\nconfig/route-staging.php\nconfig/route-production.php"},"Topics/Navigating-to-initial-symptoms-from-search-window":{"slug":"Topics/Navigating-to-initial-symptoms-from-search-window","filePath":"Topics/Navigating to initial symptoms from search window.md","title":"Navigating to initial symptoms from search window","links":[],"tags":[],"content":"Scripts involved:\r\nassets/js/dataTablesConfig.js\r\ncomparison.php\r\ncomparison-super.php\r\nconnection-function.js\r\n\r\n\r\nWorkflow:\r\nNavigation is possible after clicking with mouse along with the ALT key from keyboard.\r\n\r\nThe comparison webpage is reloaded and scrolled to the selected initial symptom.\r\n\r\nThe initial serial ID is used for detection of the initial symptom via JS.\r\nThe page to be navigated is calculated:\r\ninitial serial ID selected / per page initial symptoms.\r\n\r\nThe ceil value is the page.\r\n\r\n\r\nJS functions involved:\r\nsearchFunctionData()\r\naddParamsAndRedirect()\r\nremoveParamsWithoutReload()\r\n\r\nNOTE: URL parameters are modified. \r\nParams: custom_listing, ns_to_sent, ns_editing, gen_ns_to_sent are removed which are associted with NS listings.\r\n\r\nThese params are removed as navigation inside the NS list is not possible as the initial symptom might not appear in the list.\r\n\r\nThe scrolling is handled in the comaparison.php and comparison-super.php scripts.\n"},"Topics/New-Modification-in-CE,-SWAP-CE-Concept":{"slug":"Topics/New-Modification-in-CE,-SWAP-CE-Concept","filePath":"Topics/New Modification in CE, SWAP CE Concept.md","title":"New Modification in CE, SWAP CE Concept","links":["tags/comparison"],"tags":["comparison"],"content":"comparison\nAccording to our new modifications now if a symptom has two CE connection (through multiple level comparison)\nNow if we remove or disconnect one of the connections the initial symptom will go back to its previous state. Which means if we disconnect the last or we can say the latest CE connection then the initial symptom will go back to its second last CE connection state.\nSimilarly, if we disconnect the second last CE connection only, then the initial will remain same, because the last CE connection is still there, So the initial symptom still holds the effect of the last CE connection.\nIn short, an initial symptom which has connections will always be displayed with the effect of its last or we can say the latest connection.\nWhat happens with disconnected symptom?:\nIf the disconnected symptom belongs to initial source(s) then it will appear as an initial symptom somewhere in the comparison.\nAnd if the disconnected symptom belongs to comparative source(s) then it will appear as a comparative symptom in the comparison in its appropriate place(s).\nExample:\nSuppose we are comparing A_B_C with D_E_F. Here A_B_C is initial source and D_E_F is comparing source.\nHere A_B_C source can have any kind of earlier connection (i. e. C, CE, SWAP CE, P, etc.). Now if we disconnect any earlier connection of A_B_C the disconnected symptoms will appear as initial symptom.\nSame goes for D_E_F (which is the comparative source) here if we disconnect any earlier connection of D_E_F, the disconnected symptom will appear as comparative symptom.\nConcept of grading related to connection process:\nIn each comparison when we do a connection where there is an option available to do grading changes for that particular symptom through this connection, this individual grading data of that particular symptom is getting stored separately on each connection basis or we can say on each comparison basis.\nA symptom can get its gradings or grading data from its source where it belongs.\r\n\r\nOr\r\n\r\nA symptom can have its individual grading data of itself.\n\nIf required a user can set individual gradings for a particular symptom by using the symptom edit process.\nA User also has the facility to set grading for a symptom in a few connections process (i.e. CE, SWAP CE, etc.)\nBy default, the source’s grading setting (If available) gets applied on all the symptoms of that source.\nBut if a symptom has its own individual grading setting, which that symptom can get through symptom edit process or through a connection process (i.e. CE, SWAP CE, etc.), then that symptom always follows its individual grading setting.\nGrading related to disconnection:\nWhen a user disconnects a connection (i.e. CE, SWAP CE, etc.) where the disconnecting symptom has individual grading which got obtained through that connection.\nIn this disconnection process that individual grading also gets deleted, which got obtained through that connection.\nTechnical Workflow:\nWhen we click on the CE or SWAP CE button, we show or populate the symptom data in the CE or SWAP CE popup by fetching from the data fields or hidden fields of that symptom in the HTML. Also we fetch symptom grading data from the database using “fetch-symptom-settings-information.php” script in “connect-edit-exp.js”.\nWhen we click on the Preview button on the CE or SWAP CE popup, we POST the popup from data to “get-preview-of-connect-edited-symptom.php” PHP script through “connect-edit-exp.js” JavaScript page using AJAX. On the basic of the submitted data  “get-preview-of-connect-edited-symptom.php”  PHP script prepare the preview result and sends it back to the page. This PHP script collects the grading settings of the symptom and according to its grading settings prepares the different versions of the symptom (i.e. original version, converted version, etc.) using the “convertTheSymptom()” function which is available in the functions.php PHP page.\nWhen we finally Submit the CE or SWAP CE process, by clicking the submit button we POST the form data to “connect-edit-operation.php” PHP script, Here in this PHP script we store the connect information in database in the dynamic connection table of that comparison (i.e. comparison_table_34_2_257_de_connections). And we also store the individual grading setting data with the comparison ID in the database table “symptom_grading_settings” . Here comparison ID is stored in the “pre_comp_id” (by default it’s value is 0) column of the DB table “symptom_grading_settings”.   \nWhen we click on the disconnection button of CE or SWAP CE connection, it again takes the POST data to the “connect-edit-operation.php” PHP script, here we delete the connection from the dynamic connection table of that comparison. We are also deleting the individual grading setting of the CE or SWAP CE symptom with the help of comparison ID or we can say with the help of the “pre_comp_id” column of the table “symptom_grading_settings” we also delete the individual grading setting of that CE or SWAP CE connection. Then we fetch the last available connection of the symptom (if available after the current disconnection) from the dynamic connection table of the comparison and then updates the symptom to its last available connection’s state.\nRelated scripts:\ndev-exp/functions.php\r\n\r\ndev-exp/fetch-symptom-settings-information.php\r\n\r\ndev-exp/connect-edit-exp.js\r\n\r\ndev-exp/get-preview-of-connect-edited-symptom.php\r\n\r\ndev-exp/connect-edit-operation.php\n"},"Topics/New-Modification-in-normal-symptom-edit,-CE,-SWAP-CE":{"slug":"Topics/New-Modification-in-normal-symptom-edit,-CE,-SWAP-CE","filePath":"Topics/New Modification in normal symptom edit, CE, SWAP CE.md","title":"New Modification in normal symptom edit, CE, SWAP CE","links":["tags/comparison"],"tags":["comparison"],"content":"comparison\nWe can normally edit a symptom form the symptom listing page of a source. While editing a symptom from the symptom listing page of the source, on clicking the edit icon button we get the symptom edit mask /popup.\nHere in this popup according to our new modification, we are always providing the imported version of the symptom to edit in the textarea field. We have also displayed the original and converted version of the symptom just above the textarea field.\nHere in the symptom edit popup we have a settings tab, in this settings tab user can set or modify the grading settings value for the editing symptom.\nThere is a filed add as Individual Upgrade justification where user can write their comment on Upgradation reasons.\nHere user also have control over where the edit should get impacted, user have options to choose whether to edit both original and converted version or edit only converted version.\nWe have also introduced an edit preview phase, where the user can see the result of the edit, just before the final submission of the edit process. User can correct their mistake by clicking the Go back button from the preview phase.\nIn case of CE, SWAP CE:\nSame as normal symptom edit process, in case of CE, SWAP CE connection also we provide the imported version of the symptom to edit in the textarea field. We have also displayed the original and converted version of the symptom just above the textarea field, in the CE or SWAP CE popup.\nIn this popup also we have the settings tab where user can set or modify the grading settings value for the CE or SWAP CE symptom.\nSame way we also have the preview phase, where the user can see the result of the CE or SWAP CE edit, just before the final submission of the CE or SWAP CE process. Here also we can go back to correct our editing by clicking the go back button in the preview phase of the CE or SWAP CE popup. \nTechnical Workflow:\nSymptom edit:\nSymptom edit process also little bit same as the CE, SWAP CE process. When we click on the edit icon button we fetched symptom information/data from the database table with the help of PHP script “get-editable-symptoms.php” using AJAX and populate the fetched data in the symptom edit popup.\nHere clicking on the Preview button of the symptom edit popup, we POST the popup from data to “get-preview-of-edited-symptom.php” PHP script, this script collects the grading settings data of the symptom from the database and according to its grading settings prepares the different versions of the symptom (i.e. original version, converted version, etc.) using the “convertTheSymptom()” function which is available in the “functions.php” PHP page. And sends populated preview result data back, which gets displayed to the user.\nAfter that when user clicks the Submit button in the symptom edit popup, by clicking the submit button we POST the form data to “edit-original-or-converted-symptom.php” PHP script, In this script we are updating the edited symptom string in the database tables – “quelle_import_test” and other applicable dynamic comparison table. Here we are also setting the individual grading setting for the symptom in the symptom_grading_settings table.\nCE or SWAP CE:\nWhen we click on the CE or SWAP CE button, we show or populate the symptom data in the CE or SWAP CE popup by fetching from the data fields or hidden fields of that symptom in the HTML. Also we fetch symptom grading data from the database using “fetch-symptom-settings-information.php” script in “connect-edit-exp.js”.\nWhen we click on the Preview button on the CE or SWAP CE popup, we POST the popup from data to “get-preview-of-connect-edited-symptom.php” PHP script through “connect-edit-exp.js” JavaScript page using AJAX. On the basic of the submitted data  “get-preview-of-connect-edited-symptom.php”  PHP script prepare the preview result and sends it back to the page. This PHP script collects the grading settings of the symptom and according to its grading settings prepares the different versions of the symptom (i.e. original version, converted version, etc.) using the “convertTheSymptom()” function which is available in the functions.php PHP page.\nWhen we finally Submit the CE or SWAP CE process, by clicking the submit button we POST the form data to “connect-edit-operation.php” PHP script, Here in this PHP script we store the connect information in database in the dynamic connection table of that comparison (i.e. comparison_table_34_2_257_de_connections). And we also store the individual grading setting data with the comparison ID in the database table “symptom_grading_settings” . Here comparison ID is stored in the “pre_comp_id” (by default it’s value is 0) column of the DB table “symptom_grading_settings”.\nRelated scripts:\r\n\r\ndev-exp/functions.php\r\n\r\ndev-exp/symptoms.php\r\n\r\ndev-exp/get-editable-symptoms.php\r\n\r\ndev-exp/get-preview-of-edited-symptom.php\r\n\r\ndev-exp/edit-original-or-converted-symptom.php\r\n\r\ndev-exp/fetch-symptom-settings-information.php\r\n\r\ndev-exp/connect-edit-exp.js\r\n\r\ndev-exp/get-preview-of-connect-edited-symptom.php\r\n\r\ndev-exp/connect-edit-operation.php\n"},"Topics/Ordering-of-connected-symptoms-on-the-basis-of-their-connection-type":{"slug":"Topics/Ordering-of-connected-symptoms-on-the-basis-of-their-connection-type","filePath":"Topics/Ordering of connected symptoms on the basis of their connection type.md","title":"Ordering of connected symptoms on the basis of their connection type","links":["tags/comparison"],"tags":["comparison"],"content":"comparison\nConnected symptoms when displayed are displayed in order like: Connect Edit ⇒ Connect ⇒ Paste Edit ⇒ Paste.\nThis ordering is done in both front-end and back-end scripts. For front-end connectionSort() JS function is used. For backend, connected symptoms when displayed symptom-connection-operations.php  PHP script executes the connected symptoms ordering before returning the symptom information to the comparison page."},"Topics/Punctuation-removal-from-grading":{"slug":"Topics/Punctuation-removal-from-grading","filePath":"Topics/Punctuation removal from grading.md","title":"Punctuation removal from grading","links":["tags/general"],"tags":["general"],"content":"general\nPunctuation removal from grading is done by modifying the symptom string having customized html tags. The main idea is to remove the punctuation symbols encapsulated between any html tags, keeping the string intact, that is maintaining the integrity of the tag contents.\nPunctuation in here refers to these symbols: &#039;.&#039;, &#039;,&#039;, &#039;:&#039;, &#039;;&#039;, &#039;?&#039;, &#039;!&#039;, &#039;(&#039;, &#039;)&#039;, &#039;[&#039;, &#039;]&#039;.\nOther characters are not taken into consideration here as symbols like ”-” (hyphen), ”’” (apostrophe), ””“(quotation marks) and ”…”(ellipsis) can arise conflict with the customized tags which helps in the grading process.\nPunctuation removal is done just before display of the symptoms after the conversion process. The related function is: punctuationPositionFix() which is included in the functions.php script.\nThis function takes the input string as a parameter and splits the string into smaller parts where the punctuations occurs with the help of a regex pattern. The sub parts are stored in an array.\nEach of these parts are processed and checked for below categories:\n\n\nIf both open and closed html tags are present in the sub part.\n\n\nIf only open tag is present in the sub part.\n\n\nIf only closed tag is present in the sub part.\n\n\nIf no tag are present in the sub part.\n\n\nConsecutive occurrences of punctuation are also checked before manipulation of the html tags in each part.\nBelow showing a simple illustration:\r\n\r\n  \r\n\r\nInput String = &quot;I have &lt;strong&gt; fever, cough &lt;/strong&gt; and &lt;em&gt;headache. Sometimes stomach ache&lt;/em&gt;&quot;;\r\n\r\n  \r\n\r\nProcessed String = &quot;I have &lt;strong&gt; fever&lt;/strong&gt;,&lt;strong&gt; cough &lt;/strong&gt; and &lt;em&gt;headache&lt;/em&gt;.&lt;em&gt; Sometimes stomach ache&lt;/em&gt;&quot;;\n\nThis function solves the problem of inclusion of punctuation in the gradings and replacement of redundant spaces between comma and dot with just a dot when displaying."},"Topics/Rearrangement-of-symptoms-as-per-source-year-and-paste-connections":{"slug":"Topics/Rearrangement-of-symptoms-as-per-source-year-and-paste-connections","filePath":"Topics/Rearrangement of symptoms as per source year and paste connections.md","title":"Rearrangement of symptoms as per source year and paste connections","links":["tags/comparison"],"tags":["comparison"],"content":"comparison\nWhenever comparative symptoms are pasted or paste-edited, the symptoms then appear under its parent in further comparisons.\nSource name after comparisons can be like : “1790, Gred 1790_HnRA11 1811_HnRA13 1817_HnRA12 1816_AltHB 1889” and symptoms appear in the order as per their source year.\nExample here:\nInitial source is: 1790, Gred 1790_HnRA11 1811_ HnRA13 1817\nComparing spurce is: HnRA12 1816_AltHB 1889\nWhenever the comparison is displayed fresh, the program will sort and display the initial symptoms in the below pattern:\n\n\nAll initials of 1790 with any previous connections (connect, connect edit or swap) of 1811 and 1817. If previous paste connections exist, it will appear below the initials of 1790s.\n\n\nAll initials of 1811 with any previous connections(connect, connect edit or swap) of 1817.\n\n\nAll initials of 1817.\n\n\nTechnical Details:\nRearrangement of symptoms is done when comparison source is saved, The php function “rearrangeSymptomsInOrder()” is used.\nParameters send to the function:\n\n\n$db: database connection.\n\n\n$comparisonTable: comparison table name.\n\n\n$savedConnectionsComparativeIdsArray: array containing data of current paste and paste edit symptoms\n\n\n$dataPastedId: array containing data of paste and paste edit ids.\n\n\n Quelles ids of the comparing is extracted from the table name.\nInitials are first inserted in $savedSortedIdsArray php array. Then, paste and paste-edit symptoms are inserted after their parents.\nAccording to extracted quelles ids of the comparing, the year of the comparing sources are taken and stored in order.\nComapring are then inserted into $savedSortedIdsArray php array as per their year.\nThe $savedSortedIdsArray php array is then returned by the function and this array is used for insertion into the completed table.\nThe $savedSortedIdsArray php array contains symptom ids of the symptom in order as per their source year and pasted connections."},"Topics/Reflexive-grades-with-CEs-and-swap-CEs":{"slug":"Topics/Reflexive-grades-with-CEs-and-swap-CEs","filePath":"Topics/Reflexive grades with CEs and swap CEs.md","title":"Reflexive grades with CEs and swap CEs","links":["tags/general","tags/comparison"],"tags":["general","comparison"],"content":"general comparison\nScenario:\nLet&#039;s say there is initial symptom X from source A and symptom is displaying normal texts with grade 1.\r\n\r\nThere is another symptom Y  from source B which is comparative symptom appearing below X and is displaying normal texts with grade 2.\r\n\r\nIf a CE (Connect Edit) is done and symptom X is connected with symptom Y, then by default the initial symptom X will apply the grades associated with its connected comparative symptom Y from source B. Thereby, displaying the normal text of symptom A in grade 2.\r\n\r\nThe same case can happen if CE is done with swap i.e. SWAP CE where the initial will consider the grades associated with its connected comparative symptom. \r\n\r\nThis is the reflexivity of grades among connected symptom pairs with CEs and SWAP CEs.\n\nBy default, the grades applicable with CEs and SWAP CEs are reflexive unless a checkbox is activated to fix the grading during the connection process.\nBelow the checkbox is shown from the CE modal during comparison process.\n\nTechnical Details:\nWhenever CE or SWAP CEs are done, the gradings are considered as fixed and are fetched from symptom_grading_settings SQL table and is processed by convertTheSymptom() PHP function.\nIn order to make the gradings reflexive as per the connected comparative symptom, some modifications are done.\nSaving of the CE and SWAP CE gradings to become reflexive:\n\nA new flag is_reflexive is introduced in the symptom_grading_settings to save the connection for reflexive grades. The default value is ‘0’ and for connections like CE and SWAP CE, the value is ‘1’. It is also added in the temp_editable_symptom_grading_settings SQL table which is responsible for showing grades in the preview option whenever CE and SWAP CE are done.\nWhenever, CE or SWAP CE is done, the modal with text editor having HTML id connectEditModal is now introduced with a checkbox and if it is checked, the gradings are considered as fixed. The checked value is received in the backend script with name fixed_ce_grade. The default value is ‘1’. When checked, it is ‘0’.\nThe backend scripts responsible for the input from the modal are connect-edit-operations.php and connect-swap-operations.php.\nAfter the connection is saved in the connections SQL table, when the gradings are saved by updateEditedSymptomsSettings() PHP function, the fixed_ce_grade flag value is passes through PHP array gradingData[] as an input field.\nThe PHP function updateEditedSymptomsSettings() further processes the input and is saved in the symptom_grading_settings SQL table.\n\nDisplaying of reflexive grades:\n\nThe display of the grades in the symptom texts are controlled by convertTheSymptom() PHP function. The input is an array and all input parameters are sent as key value pairs in the input array.\nAfter initialization of the grades, the saved grade for that particular input is fetched from symptom_grading_settings SQL table and if the is_reflexive field is found active then the connections table for that comparison is first searched, the connected comparative symptom ID is taken out, the original_quelle_id field value is then fetched for that particular symptom ID from the dynamic comparison table.\nThe original_quelle_id found is kept in PHP variable sourceIdFound and this value is used to fetch the grades from the quelle_grading_settings SQL table.\nThe grades fetched are then processed and the returned output displays the symptom text with the fetched grade values, thus maintaining its reflexivity.\nIf is_edit_preview input key value is found active then reflexivity flag is_reflexive is fetched from temp_editable_symptom_grading_settings SQL table and original_quelle_id is fetched as mentioned above.\n\nRelated scripts:\ncomparison-table-page-modals\r\nfunctions.php\r\nconnect-edit-operations.php\r\nconnect-edit-exp.js\r\nget-preview-of-connect-edited-symptom.php\r\nconnect-swap-operation.php \n"},"Topics/Rules-applicable-to-new-refactored-database-tables.":{"slug":"Topics/Rules-applicable-to-new-refactored-database-tables.","filePath":"Topics/Rules applicable to new refactored database tables..md","title":"Rules applicable to new refactored database tables.","links":[],"tags":[],"content":"\nAll entity tables are in plural form.\r\nFor example: user tables is named as users. Medicines, Testers etc.\nIf table name consists of multiple words to define their meaning, the words are separated with &quot;_&quot;.\r\nFor example: Table english_synonyms.\nRelationship tables with composite keys are given prefix “rel_&quot; with the associated table names in singular form.\r\nFor example: Relationship between roles and users tables is stored in SQL table named &quot;rel_role_user&quot;.\nTemporary tables are given prefix &quot;temp_&quot;.\nTemporary tables used during the import process are given prefix &quot;itemp_&quot;.\nDynamic tables such as tables formed during comparison process are named differently.\r\nComparison table: comparison_table_arzneiID_initialSourceID_comparingSourceID_comparisonLanguage\r\nConnection table: Comparison table name followed by suffix &quot;_connections&quot;\r\nHighest matches table: Comparison table name followed by suffix &quot;_highest_matches&quot;\r\nCompleted table: Comparison table name followed by suffix &quot;_completed&quot;\r\nHistory table: Comparison table name with prefix &quot;history_&quot;.\nID field in table name follows convention “singular form of table name” followed by suffix &#039;_id&#039;.\r\nFor example in users table, user id is named as &#039;user_id&#039;.\nID field of dynamic SQL tables are named only “id”.\nPrimary key attributes are “UNSIGNED”.\nFive audit columns: ip_address, editor_id, creator_id, created_at, updated_at are added to each SQL tables.\nAll table names and fields are in English language.\nHistory tables for a comparison is created dynamically when a comparison is finalized and saved by the supervisor.\nTables in the database should follow 3NF level of normalization.\nFor chaptering process, a different database with name &quot;symptom_classification&quot; is used by the python program. The chapter ID defined in that database are globally accepted by the Symcom program. Any change in chapter name or structure in that database will be effective in throughout the program.\nIt is advised to always escape symptom strings which may contain special characters before insertion to SQL tables.\n"},"Topics/Rules-relating-to-symptom-import":{"slug":"Topics/Rules-relating-to-symptom-import","filePath":"Topics/Rules relating to symptom import.md","title":"Rules relating to symptom import","links":["tags/import"],"tags":["import"],"content":"import\nWhen symptoms are imported to the sources, for identification of different fields like tester, medicine, author, comment, date etc. the program follows certain rules. These rules are also important when patterns are identified within the symptom text and user is asked questions for approval.\nThese rules are:\nRule 1:\r\ndocs.google.com/document/d/1yB71Ix2iARh0MHDzMRCtdO8Vd3xX65hKReK8dqiPg4c/edit#heading=h.tjcrfqgjqhj\nRule 2:\r\ndocs.google.com/document/d/1ckmYAOQktazUUyXldl_GeiEi_hkJdHUzpTkIWg8ByrU/edit#heading=h.sgmxwa1m11rz\nRule 3, 4 and 5:\r\ndocs.google.com/document/d/1IQH62QXRxw3oxtkNJkTujxs0xLN2YGLkrJky-ayILNU/edit#heading=h.5sg3coqe6q1i\nRule 6:\r\ndocs.google.com/document/d/11xILDCucaHzkCl2R_g-W3nSkj5PYucv924DY4Ff9ojc/edit#heading=h.jcgxeb5h9b31"},"Topics/Saving-of-comparisons":{"slug":"Topics/Saving-of-comparisons","filePath":"Topics/Saving of comparisons.md","title":"Saving of comparisons","links":["tags/comparison"],"tags":["comparison"],"content":"comparison\r\nWhen a comparison is saved, the HTML class “comparison-table-save-btn” is revoked. A pop up is displayed to confirm the editor’s input and then the program checks for unmarked initial symptoms or non secure connections with the help of “check-unmarked-symptoms.php” script via an ajax call. If any unmarked or non secure connections are found then the editor is notified with a pop up and then redirects the editor to the secure the connections for saving the comparison.\nIf no unmarked or non secure connections are found then the save process is followed by the “savingComparison()” js function. This function submits the form with id “saveSubmit” and redirects to the main comparison page with HTTP method “POST”.\n“savingComparison(param)” takes parameters 1 or 0.\nThis function changes the input value of the “temp_unmark_check” id as per the param value. For saving the comparison the value of param = 0.\nThe form with id “saveSubmit” takes input three input values : save_comparison, similarity_rate_save and temp_unmark_check and is submitted with the help of HTTP POST method.\nSaving steps in PHP script:\n\n\nThe form input values are detected.\nIf “temp_unmark_check” value = 1 then unmarked symptoms are listed in the comparison page.\nIf “temp_unmark_check” value = 0, then save process follows.\n\n\nFor editor:\n\nThe “comparison_save_status” SQL field of tables “pre_comparison_master_data” and “quelle” is updated to “1”. The comparison status in materia-medica page is now shown in “yellow” color.\n\n\n\nFor supervisor:\n\n\nTotal unmarked initial symptoms with no comparatives match are taken out in an array with the help of “unmarkedSymptoms()” function.\n\n\nAll symptoms are then sorted according to their source year and taken out in an array $savedSortedIdsArray[] with the help of “rearrangeSymptomsInOrder()” function.\n\n\nCompleted table with comparison table name and suffix “_completed” of the comparison is created.\n\n\nThe “quelle_id” of that particular is taken out from the “pre_comparison_master_data” table. This “quelle_id” forms new “quelle_id” for that saved source.\n\n\nEach id from the $savedSortedIdsArray[] is iterated and information is fetched out from the comparison table. This information is then inserted into the completed table.\n\n\nAfter complete insertion, symptoms with paste edit, connect-edit, swap connect, swap connect-edit connections are modified and latest symptom text and associated values are updated in the completed table.\n\n\n\n\nThe “comparison_save_status” SQL field of tables “pre_comparison_master_data” and “quelle” is updated to “2”. The comparison status in materia-medica page is now shown in “green” color and the comparison is finally saved and is ready for more further comparisons."},"Topics/Search-Function-of-the-Initial-Symptom-During-Comparison":{"slug":"Topics/Search-Function-of-the-Initial-Symptom-During-Comparison","filePath":"Topics/Search Function of the Initial Symptom During Comparison.md","title":"Search Function of the Initial Symptom During Comparison","links":["tags/comparison"],"tags":["comparison"],"content":"comparison\nTechnical Details:\nJavaScript Data Tables are used for this function.\nTable is generated dynamically from the search input and is appended to the search modal in the frontend.\nTable is defined on the dataTablesConfig.js script using the HTML id search_initial_table.\nFor fetching symptom information HTML id search_initial_table and class tbody along with JavaScript event click is used.\nFetching of info is exactly same as the other info fetching function present under “Info &amp; Linkage” column in the comparison process.\nNOTE: Any change in the other info fetching function needs to be modified here too.\nOn change of the radio switch from the pop up, the table HTML elements are controlled using jQuery. btn-initial and btn-comparative classes controls this.\nsearch_initial_table_all id is used for the search result from initial.\nsearch_initial_table id is used for search result from comparing.\nsearchFunctionData(parentRowId, comparison_table_name, comparison_language, search_only_initials, callback) JS function fetches the information from the database. This function uses get-symptom-search-result-modified.php script in accordance with ajax to fetch and display the result in data tables.\nsearch_only_initials parameter in this function is the flag and when true this fetches only the initial symptoms from the database.\nRelated scripts:\r\n1. dataTablesConfig.js\r\n2. custom.css\r\n3. comparison-table-page-modules.php\r\n4. get-symptom-search-result-modified.php\n\nMultiple word searching\nThe search function has been updated with multiple word search. For this the default datatable classes dataTables_filter are modified with new HTML id search-comparing-input-field and search-initial-input-field to control the search input field of the datatables.\nkeyup events are added to both the above mentioned ID’s and highlighting of the new search results have been added to both of these events.\nNOTE: Search icon is added to the comparative symptom in all the comparison."},"Topics/Some-jQuery-variables-and-function-name-with-their-usages":{"slug":"Topics/Some-jQuery-variables-and-function-name-with-their-usages","filePath":"Topics/Some jQuery variables and function name with their usages.md","title":"Some jQuery variables and function name with their usages","links":["tags/comparison"],"tags":["comparison"],"content":"comparison\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nVariablesUsageearlierConnectionExistUsed as a flag variable for earlier connection existence.earlierConnectionExistSwapUsed as a flag variable for earlier swap connection existence.operationFlagFlag used for connection operation of previous connected symptoms with new parent. Has different values for connect, ce, paste, pe and swaps.previousSwapConnecectEditFlag used for swap connection of previous swap connect edit symptoms. Updating of symptom text done accordingly in the backend script.sendingElementThe clicked html DOM element is taken here.normalOperation(sendingElement)Js function for normal connect operation.swapConnectOperation(sendingElement)Js function for connect operation with swap.arrayForEarlierConnectionArray for previous connected symptoms, data are kept here. Useful for sending data to backend scripts.earlierConnectionExistCeUsed as a flag variable for earlier connection existence.ceModalDisplayFlag variable to control the connect edit text editor pop up.ceNormalOperation(ceModalDisplay,sendingElement)Js function for initializing normal connect edit operation.swapConnectCeOperation(ceModalDisplay,sendingElement)Js function for initializing connect edit operation with swap.ceModalDisplayFn(ceModalDisplay,sendingElement)Js function for connect edit operation with text editor display On.connectEditOperation()Js function when connect edit connection process is executed.connectEditSwapOperation()Js function when connect edit connection process is executed with swap.$domComparativeJs constant for extracting the DOM element of the comparative symptom.$domInitialJs constant for extracting the DOM element of the initial symptom.saveConnects()Js function for saving connect and paste connection in database.free_flagKept as an extra variable for any paste connection modification.deleteSymptoms(initial id,comparative id,disconnect operation)Js function for disconnection normal paste and connect connection.disconnectEarlierConnection()Js function for disconnection earlier connect connection.checkShellExecution()Js function to check the completion of table creation process in background.singleConnectionInitialCheck[]Js array for checking connection of symptoms with initials.singleConnectionComparativeCheck[]Js array for checking connection of symptoms with comparatives.combinedConnectionIntialsCheck[]Js array for checking connection of symptoms with initials in combined source mode.combinedConnectionComparativeCheck[]Js array for checking connection of symptoms with comparatives in combined source mode.connectSave()Js function which controls all connected symptoms when page is loaded.connectionSort()This function takes html element and helps in sorting of connected symptoms.sorting order: connect-edit→connect→paste edit→paste.symptomTextFilter(text)This function is used for filtration of symptom text when translation is open.reloadConnection()Reloading function with URL modified when show all translation and connections open or closed.onRmmPush final comparison final version to user view section.deleteTheComparison()Function to delete comaprison.deleteTheQuelle()Function to delete source.initialsWithComparativesDisconnectedBelow()Function to change icons of info &amp; linkage during disconnection.comparativesWithInitialsDisconnectedBelow()Function to change icons of info &amp; linkage during disconnection.initialsWithComparativesConnectedBelow()Function to change icons of info &amp;  linkage during connection.comparativesWithInitialsConnectedBelow()Function to change icons of info during connection.markingFunctionOnDisconnection()Function for checkmark of  initial symptoms during disconnectiongenNsFunctionOnDisconnection()General non secure function on page load.connectEditDisconnectSwapOperation()Disconnection of connect edit swap connection.connectEditDisconnectOperation()Disconnect connect edit connection.swapConnectCeOperation()Swap connection function for connect edit connection.deleteSymptoms()Disconnect function for normal connect and paste symptoms.genNsOnLoadFn()General non secure icon control on page load.nonSecureOnLoad()Non secure icon control on page load.translationOnLoadFn()Translation control on page load.footnoteOnLoadFn()Footnote control on page load.commentsOnLoadFn()Comments control on page load.\nJS with backend scripts during connection process:\nJs function interacts with backend PHP scripts for operations with the databases. Some important PHP scripts during connection process are:\n\nconnect-swap-operation.php: used for swap operation with connect and connect-edit.\nconnect-edit-operation.php: used for normal connect edit operations.\npaste-edit-operation.php: used for paste edit operations.\nconnection-save-script.php: used for normal connect and paste operation.    \nconnection-save-script-earlier.php: used for earlier connect and paste symptom operation. \nsymptom-connection-operations.php: used for arrangement of connected symptoms on page load.\n\nImportant html class, id names:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nclass, iddescriptioncomparativesConnectedCDconnect connections under initial symptom.comparativesConnectedCEconnect edit connections under initial symptom.comparativesConnectedPASTEpaste connections under initial symptom.comparativesConnectedPEpaste edit connections under initial symptom.initialsConnectedCDconnect connections under comparing symptom.initialsConnectedCEconnect edit connections under comparing symptom.initialsConnectedPASTEpaste connections under comparing symptom.initialsConnectedPEpaste edit connections under comparing symptom.onRmmPush of final comparison to reference materia medica which is user view section.disconnectPEDisconnect Paste Edit connection.disconnectPasteDisconnect Paste connection.disconnectCEDisconnect connect edit connection.connect-edit-modal-submit-btnConnect edit modal submission.check_custom_nsCheck if comparison page is in non secure connection section.all_initial_translationShow all initial translation checkbox.all_comparative_translationShow all comparatives translation checkbox.symptom-translation-btnSymptom translation icon to handle event.all-connectionsShow all connections.markingMarking of initial symptom event handle."},"Topics/Some-PHP-function-name-and-their-description":{"slug":"Topics/Some-PHP-function-name-and-their-description","filePath":"Topics/Some PHP function name and their description.md","title":"Some PHP function name and their description","links":[],"tags":[],"content":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nfunctiondescriptionpunctuationPositionFixfunction to separate punctuation symbols from customized html tags thereby making it ineffective to gradings.symptomEndIdentifyCheckForAlphaBetaAndTthis function checks if a string has single t or double t .getPreCompIdget pre comparison id from pre comparison master data SQL table based on the comparison table name.getPreCompIdOfIndividualConnectionget pre comparison id individual symptom.checkIsDeletingConnectionInCurrentComparisonfunction used to check if disconnecting connection is from the current comparison  connection table.rearrangeSymptomsInOrderrearrangement of symptoms in order when saving a comparison.markingUpdationupdation of the mark field in the comparison table.genNsUpdationupdation of the gen-ns field in the comparison table.unmarkedSymptomsget number of unmarked symptoms from a comparison.zeroComparativesCheckzero comparatives match below initial symptom check.compareSymptomWithSynonymshighlights the matching words between symptoms pairs."},"Topics/Sorting-of-symptoms-based-on-superscript-numbers":{"slug":"Topics/Sorting-of-symptoms-based-on-superscript-numbers","filePath":"Topics/Sorting of symptoms based on superscript numbers.md","title":"Sorting of symptoms based on superscript numbers","links":["tags/general"],"tags":["general"],"content":"general\nSorting the symptoms according to the superscript (exponent) at the end of each symptom of a word file. After sorting, preprocessing of the symptoms in Word will be done. Only then it is added to SymCom.\nSome specifics\nIf there are several numbers in a row, the first number must always be used, no matter if there are any brackets or the slash-sign.\nExamples:\nAllgemein Affektionen der linken Seite des Kopfes.327/88  → 327\r\n\r\n16/1 → 16\r\n\r\nVor Tisch wenig Appetit.[34]25/15 → 34\r\n\r\n[347]432/32 → 347\r\n\r\nEr hatte sich beim Heben eines schweren Gewichtes überanstrengt **||**.[135]184 → 135\r\n\r\nSeit 10 Monaten kein Rückfall.[Marweg]480/10  → 480\r\n\r\nNach einer Woche machte sie noch eine psychische Krise durch wegen des verlorenen Kindes, die aber spontan wieder verging.[Fuckert]127(2/96)  → 127\n\nAll these number combinations are always one character and only the first number in the row is relevant for sorting.\nSpecial exceptions\nThere might be also a character at the end (seen this only once):\nNach der 1. Gabe _Ruta_ 200 war der Schmerz verschwunden.[7]219H   → 7\n\nIt might happen, that the number at the end is missing:\nBaker-Zyste (_Calc-p_. [chronisch]).Hershoff\n\nThis symptom should then be listed at the end or beginning.\nNumbers in the symptoms are ignored:\nFURCHT*;1 in engen Räumen, Klaustrophobie*.286  → 286\n\nTechnical Details:\nCan be accessed: www.dev.reference-repertory.com/dev-exp/sort-symptoms-to-file.php\r\nCKEditor is used using CDN.\nThe form in the web page accepts option for both sorting with number and sorting with letters. At present only sorting with number is enabled and programmed.\nAny superscript content not containing any number will be sorted at the end of the list. Other symptoms with number in the superscripts are ordered as per the rules mentioned above.\nsupContentControl() PHP function controls the identification the superscript contents and extract the digits present in the superscript content. If the superscript content is no number then digit 10000 is returned by the function.\nThe digits returned are then sent to insertionInMasterArr(master_array, digits_extracted, paragraph_content ) PHP function which does insertion in master_array with digits_extracted as key and paragraph_content as value. Conflicting keys are also handled by this function.\nOnce, the master_array is formed, each of the values are written to a .docx file using PHPWord and sent to the user."},"Topics/Source-Import":{"slug":"Topics/Source-Import","filePath":"Topics/Source Import.md","title":"Source Import","links":["tags/import","Topics/Allen-Source-Import"],"tags":["import"],"content":"import\nTechnical Workflow:\n\nImport of source is done via main web page source-import/import.php script which holds the main UI for importing of symptoms to particular book or magazine.\nOn submission of the import HTML form, it is first validated by JS function importSource() and on successful validation the HTML form with its ID source_import_form is submitted.\nIt is then processed by source-import/onsubmit-import-process.php where it first checks if the import setting is already exists and if it exists error is reported to the user, else the script proceeds to the next lines of codes.\nInsertion of import setting and tester relationship in the temporary tables is done. Tables involved:\n\nitemp_import_source_settings\nrel_itemp_import_source_setting_tester\n\nImport String Manipulation Function:\n\nThe lines pasted in the text editor are kept in symptomsArray and each line is passed through importedStringManipulationProcess() PHP function for deep string scanning and processing.\nCheck for pre defined reference is done. Checks literature start or literatur start in the line. It is controlled by flag isPreDefinedReferenceSection. More details on Allen Source Import Concept can be found here: Allen Source Import\nCheck for the first character of the line is done. Checks @,(,[, or if it is number.\nIf no symptom description is found then the iteration among the line continues and next line is checked.\nIf symptom description is found, it is kept in Beschreibung. If a number is found with Symptom text then the line is further cleaned and the number is kept in Symptomnummer key of variablesArray.\nWhen the symptom description is cleanly extracted, further operations are done. Check for first five character is done. Occurrence of theta is also detected.\n\nImportant PHP functions involved:\n\nconvertPatternPortions(): This function detects the special symbol like *,θ,° etc. and returns the a string having customized HTML tag relating to the special symbol detected.\n\nfindTheOpenedTag(): Finds the opened HTML tag from a string part.\n\nseparateTheApplicableStratingSign(): Separates the special symbol and appends it in front of the symptom string with customized HTML tags.\n\nstructureNonAsteriskAndDegreePortions(): Add customized HTML tag &quot;non-asterisk-degree&quot; with the symptom string.\n\nstructureEndingWithDegreeFormatString(): Add customized HTML tag &quot;endwithdegree&quot; with the symptom string.\n\nstructureEndingWithSingleTFormatString(): Add customized HTML tag &quot;endwithsinglet&quot; with the symptom string.\n\nstructureEndingWithDoubleTFormatString(): Add customized HTML tag &quot;endwithdoublet&quot; with the symptom string.\n\n\nIf literature number is found, it is encapsulated under sup HTML tag.\nResolution of testers for literature source is done. The testers from literature source are kept in prueferFromParray key of variablesArray, this tester is then checked if already exists in the tester database and if not found, then check for approval flag remains active and it is kept in prueferArray key of variablesArray for further processing. Similar checks are done for source literature, medicines which are not present in the database and needs approval.\nThe whole flow is procedural approach so checks and resolutions are done for each cases one by one.\nLast bracketed string, middle bracketed string are also checked tester, medicine or part of a symptom. Several cases exists for string case, all can be easily followed in the code script. Checks for comma, semi-colon, hyphen are also done.\nThe final string manipulation data is kept in variablesArray and is then returned by the function.\nIt is to be remembered that this string manipulation function runs for each element (lines) in the symptomsArray of the onsubmit-import-process.php script so the returned array from the importedStringManipulationProcess() PHP function will contain information on unapproved testers, literatures, medicines if found in any line, and at the end of the processed these are further processed for approval and saved into the master database.\n\nInsertion in temporary tables:\n\nOnce the string is finished and returns from string manipulation function, different parts of the symptom string are taken out from variablesArray returned from the function and is then inserted into the itemp_symptoms SQL table. This is a temporary table where symptom information is kept when import of symptom is done. Other data are also inserted in the temporary tables.\n\nOther SQL tables involved:\nitemp_symptom_grading_settings\nrel_itemp_symptom_tester\nitemp_approved_testers\nitemp_testers\nrel_itemp_symptom_itemp_tester\nrel_itemp_symptom_medicine\nitemp_medicines\nrel_itemp_symptom_itemp_medicine\nrel_itemp_symptom_medicine\nrel_itemp_symptom_literature\nitemp_approved_literatures\nitemp_literatures\nrel_itemp_symptom_itemp_literature\nrel_itemp_symptom_pre_defined_literature\nrel_itemp_symptom_pre_defined_tester\n\nQuestioning process of unapproved temporary data of the symptoms:\n\nOnce insertion of all the symptoms data are done to the temporary tables, the onsubmit-import-process.php script is redirected to the import.php script where the program checks if any unapproved data is present in the temporary tables.\nIf unapproved data are found it is handled by questioning-process-of-unapproved-temporary-symptoms.php script.\n\nTransfer of temporary data to main tables:\n\nOnce all approval of temporary is complete, the data are then sent from temporary tables to main tables. questioning-process-of-unapproved-temporary-symptoms.php script handles this operation.\n\nSQL tables involved:\nitemp_symptoms\nitemp_import_source_settings\nimport_source_settings\nrel_itemp_import_source_setting_tester\nrel_import_source_setting_tester\nrel_source_medicine\nsymptoms\nitemp_symptom_grading_settings\nsymptom_grading_settings\nrel_itemp_symptom_medicine\nrel_symptom_medicine\nrel_itemp_symptom_tester\nrel_symptom_tester\nrel_itemp_symptom_literature\nrel_symptom_literature\nrel_itemp_symptom_pre_defined_literature\nrel_symptom_literature\nrel_itemp_symptom_pre_defined_tester\nrel_symptom_tester\nrel_itemp_import_source_setting_tester\nsources\n\n\nOnce the transferring is complete, the data are deleted from the temporary tables and the import of symptoms to source operation is complete.\n"},"Topics/Source-Settings":{"slug":"Topics/Source-Settings","filePath":"Topics/Source Settings.md","title":"Source Settings","links":[],"tags":[],"content":"Gradings\nTechnical Details:\nGrade Settings shows the list of already assigned grade values.\nThe script responsible for UI: source-settings/global-grading-settings/index.php.\nThe pre existing values from the database are sent in a PHP array allGlobalGradingSets from api/global-grading-setting.php .\nRelated PHP scripts:\nroutes/api.php\nGlobalGradingController.php\nassets/js/globalGradingSetting.js\nsource-settings/global-grading-settings/index.php\napi/global-grading-setting.php\n\nSQL involved:\nglobal_grading_sets\nglobal_grading_set_values\n\nSymptom Type Settings\nThe UI is handled by source-settings/symptom-type-and-origin.php.\nSources are loaded in the search drop down by PHP variable allBooksMagazines which is generated from api/book.php.\nFor a particular source, the data in the select options are loaded by assests/js/source-settings.js. The script sends ajax request to the Symcom master data API with route link source/source-setting and is then handled by getSourceSetting method of SourceController.\nSaving of the source type settings is done with assets/js/ajaxFormSubmit.js script.\nThe content-form class of the form HTML tag is identified by the script and data-source and data-action fields of this form tag is used to generate the route link for connection with Symcom master data API. It is then handled by saveSourceSpecificSymptomTypeAndSymptomOriginSetting method of SourceController.\nScripts:\nsource-settings/symptom-type-and-origin/index.php\nassets/js/ajaxFormSubmit.js\nassets/js/source-settings.js\n\nSQL tables:\nsource_specific_symptom_settings\nsources\n\nGrade Setting\nDisplays the grades assigned to particular source.\nThe UI is handled by source-settings/font.php.\nLoading of saved data is executed by assests/js/source-settings.js, which sends ajax request to the Symcom master data API with route link source/source-setting and is then handled by getSourceSetting method of SourceController.\nSaving of the source grade settings is done with assets/js/ajaxFormSubmit.js script.\nThe content-form class of the form HTML tag is identified by the script and data-source and data-action fields of this form tag is used to generate the route link for connection with Symcom master data API. It is then handled by saveSourceSetting method of SourceController.\nScripts involved:\nassests/js/source-settings.js\nassets/js/ajaxFormSubmit.js\nsource-settings/font.php\nroutes/api.php\nSourceController.php\n\nSQL table involved:\nsource_grading_settings\nsources\n"},"Topics/Symcom-Developer-Guide-(Work-Chart)":{"slug":"Topics/Symcom-Developer-Guide-(Work-Chart)","filePath":"Topics/Symcom Developer Guide (Work Chart).md","title":"Symcom Developer Guide (Work Chart)","links":["tags/import","tags/comparison","Topics/Source-Import","Topics/Source-Settings","Topics/Conversion-of-Grading-During-Display"],"tags":["import","comparison"],"content":"import comparison\nTechnical Help:\nThe whole project is controlled with three different versions. Below are their details:\n\nDevelopment:\nLink: www.dev.reference-repertory.com\nDatabase: development_repertory\nStaging:\nLink: www.stage.reference-repertory.com\nDatabase: staging_repertory\nProduction:\nLink: www.reference-repertory.com\nDatabase: production_repertory\n\nSource Import:\n\nUpon submission of the import form, whole functionality of import, export and saving of symptoms according to the rules is performed by the dev-exp/index.php page.\nAll PHP functions can be found in dev-exp /functions.php page.\nFont conversion of the symptoms are also done during the process of import, but functioning and implementation of  full font conversion is explained in the next section.\nAs showed in the above figure (Fig 1), the following processes takes place:\n\n\nSubmission: The user selects import settings, language, Medicine, Source, Tester and pastes the symptoms from Microsoft Word document to the text editor. Upon submission, the program checks for any error with validations, if errors are found, the program shows an error in the main import page.\n\n\nInitial Processing: The symptom text is taken as a string, cleaned and kept as an element inside an array () whenever a line break is found.\n\nThe program checks if symptoms are already added to the mentioned source by searching for records in the import_source_settings and itemp_ import_source_settings SQL tables in the database. If any errors are found in this process, the program shows error in the main page, else it continues for the next steps.\n\n\n\nPattern Identification: The array is iterated and for each element, the first and last character is taken out. The first character is crucial because this helps the program to identify different patterns(like symptom number, graduation, time, tester etc.) within the symptom text. Similarly, the last bracketed string is also processed for pattern identification.\n\n\nThe program also processes the symptom text strings with font configuration of the sources. Hence, cleaning, trimming and addition of new HTML tags also happens simultaneously in this step.\n\n\nThe symptom text is kept in a PHP variable Beschreibung. Different Beschreibung versions are stored in the SQL table.\n\nThe field description_de_in_document and  description_en_in_document contains symptom text as it is from its original document.\nThe field description_de_with_custom_tags and description_en_with_custom_tags contains symptom text with all ending brackets.\n\n\n\nFor extraction of Tester data from the string, the program first checks if any word starts with @P, if many  strings for Tester are found then all values are taken in a string and are separated by a delimiter “{#^#}”\n-The lookupPruefer() function, searches for the processed Tester in the database tables. If values for Tester are not found, then a PHP flag is used, which is then used later for approval of the pattern from the user. According to the rules a priority value is also set which helps the program to identify the string and ask questions regarding its approval from the user.\nThe final values for Tester is stored in an associative array for further use in the program.\n\n\nSimilar process also takes for Literaturquellen/Source Literature  that is @L. Here lookupLiteratureReference() function is used for searching the processed string in the database table.\n\n\nFor @N, which is a pattern to identify symptom number, first the program extract the strings between “( )” parenthesis and are then checked whether it is numeric or not. The final string is stored in itemp_symptoms SQL table under field symptom_number. If any mismatch is found, then the PHP flag is_symptom_number_mismatch is used for approval from the user at the end of Submission.\n\n\nOther patterns with “ @ ” in the beginning of string  and their respective meanings are mentioned below.\n\n\n@A:Medicine\n@AT:Similar medicine, Similar symptom text (e.g. Opi., during the day)\n@TA:Similar symptom text, Similar medicine (e.g. small boils in crops, Sulph.)\n@L:No Author, Aepli sen. in Hufeland Journ. YYV. (when there is no author reference) \n@U:Unclear(Unklarheit) \n@F:Footnote(Fußnote) \n@T:Text/Symptom text \n@Z:Time \n@K:Chapter \n@UK:Subchapter \n@UUK:Sub Subchapter \n@S:Page  \n@C:Comment(Kommentar) \n@V:Hint(Verweiss) \n@G:Grading/Classification(Graduierung)\n\nAll the extracted values from the patterns mentioned above are stored in itemp_symptoms SQL table in their respective fields.\n\nThe symptom-tester relationship is stored inside itemp_symptom_tester table.\nThe tester details is stored in itemp_testers table.\nIf no approval for tester is required then it is stored in itemp_approved_testers table.\nMedicine is stored in itemp_medicines table.\n“Symptom and literature reference” relationship is stored in itemp_symptom_literatures table.\nThe literature reference details is stored in itemp_literatures table.\nIf no approval for literature reference is required then it is stored in itemp_approved_literatures table.\nNeed for approval is searched in itemp_symptoms table, if no approval is needed then following steps takes place, else redirected to main page for asking questions.\n\nInsertion takes place from itemp_import_source_settings to import_source_settings.\nRelationship between  medicine and source is stored in rel_source_medicine table.\nInsertion of symptom text takes place in symptoms from itemp_symptoms.\nRelationship between symptom-tester is stored in rel_symptom_tester table.\nRelationship between symptom-literatures is stored in rel_symptom_literature table.\nTester, medicine and literature values are finally stored to testers, medicines, literatures tables from their temporary tables.\n\n\nIf there is need for approval\n\nFirst checks for approval of any pre defined tags like @P, @L, @K etc.\nThen checks for priority of tester, medicine, part of symptom, symptom edit, etc.\nAccording to the rules, the program asks questions for each of the categories based on priority in a pop-up.\nThe pop up will continue appearing, till user approves it with yes, no or DO(direct order) button. The DO(direct order) helps the user to manually select the category in which the unidentified pattern belong.\n\n\n\nAfter successful insertion, data from temporary tables are deleted.\n\n\nStoring in temporary tables: The data from the symptom text including pattern approval request and  priorities are all stored in an associative array and is then inserted into itemp_symptoms SQL table.\nApproval for unidentified patterns: When approval is required for strings inside brackets at the end of the symptom text or when no records of tester, literature etc. is found then the page is reloaded with a GET parameter “master”. This helps in identification of the source from itemp_symptoms table. The program:\nFinal processing: In this step, final insertion of the symptom in symptoms SQL table takes place and all categories of the symptom text like tester, medicine, literature, date, etc. are stored in different fields of the table.\n\n\nMore details on the import process: Source Import\nAdmin panel:\nHandling of all Symcom data can be done in this admin panel. This main dashboard consist of:\n\nComparison: which is a link to the source comparison page.\nMaster Data: this option handles all the data.\nUsers: list of users.\nImport: which is a link to the import page.\n\nMaster Data:  \nThis menu has different option for handling of data stored in the SQL databases.\n\nBooks: contains details of all the sources. Addition of new source can also be done here.\n\nRelated SQL tables:\nsources: stores all source data including source_origin_id, publisher_id. Here, the field source_category = 1 for books.\n\nrel_source_tester: stores tester relating to that source.\n\nrel_source_author: stores author relating to that source.\n\nsource_grading_settings:grading setting of that source for font display.\n\n\nMagazines: contains details of all the sources but sources are categorized as magazines.\n\nRelated SQL tables:\nsame as previous but in sources table, the field source_category = 2.\n\n\nMedicines: details of all the medicines.\nRelated SQL tables:\n\nmedicines: stores all medicine data.\nrel_source_medicine: relationship between medicine and quelle.\n\n\nAuthors: details of all the authors.\nRelated SQL tables: \nauthors: stores all author data.\nTester: details of all the proofers/testers.\nRelated SQL tables: testers.\nSource Origin: details of origin.\nRelated SQL tables: source_origins.\nPublishers: details of publishers.\nRelated SQL tables: publishers.\nLiteratures: details of literature.\nRelated SQL tables: literatures.\nGrade Settings: This is the global grading setting menu. Here different text formats like Normal, Sperrschrift (double spaced), Kursiv Sperrschrift etc. are given unique values like 1,2,3,etc. More technical details on grade settings: Source Settings\n\nRelated SQL tables:\nglobal_grading_sets: stores value whether settings is for font or colored.\n\nglobal_grading_settings: stores the values for different font formats like normal, kursiv, bold etc.\n\nglobal_grading_set_values: contains IDs of all font formats.\n\n\nSetting (Font Conversion): This setting menu has select option for different customized tag names with values 1,2,3 etc.\nA source can be configured with a font setting and this font configuration is effective when symptoms are displayed under that source. Full steps of font conversion are shown below:\n\n\nSymptom saved in the symptoms SQL table under column description_de_with_custom_tags and description_en_with_custom_tags is passed through PHP function convertTheSymptom() when symptom listing is processed.\n\n\nThe program searches for patterns by checking the first and last character in a string. It also detects other characters like °(degree) or *(asterisk).\n\n\nDetected patterns are passed to different font formatting functions which returns the string with encapsulated customized HTML tags.\n\n\nThe symptom text is saved in the database.\n\n\nGrade Setting menu in the admin panel has grading values for symptoms with text formats like Normal, Normal within parentheses, Normal begin with degree etc. for each source.\nNow, if the source has been assigned grades via Grade Settings Symcom Menu, the grade details for the source is saved in source_grading_setting SQL table. If value for text format “Bold” grade is set as “3” from the Gradings Menu and if in the source grading setting, the HTML form option for “Normal begin with asterisk” option is set with value “3”, then when the symptom is displayed for that source, if the symptom text is in normal and starts with an asterisk, then due to global grading font setting, the font text will be converted and the word will be displayed in bold.\n\n\n\n\nRelated SQL tables:\nsource_grading_settings: Settings for all custom HTML tags for particluar sources is stored here.\n\nsymptom_grading_settings: Settings for all custom HTML tags for particluar symptoms is stored here.\n\nDetails on the grading conversion function: Conversion of Grading During Display\n\nComparison:\nWhole process of comparison can be divided into three steps:\n\n\nComparison between quelle(sources).\n\n\nConnections among quelle, that is connect, paste, connect-edit, paste-edit.\n\n\nSaving of the comparison sources.\n\n\nComparison among quelle:\nFor every comparison, an SQL table is created using the user setting like medicine and language. The whole comparison is done in 0% and stored in the database.\nWork Flow is mentioned in the below figure.\n\nFig 2: Work Flow showing comparing source process.\nAs showed in the above figure (Fig 2), the following processes takes place:\n\n\n\n\nComparison Button Click: The user selects the settings for comparison. This setting include:\n\nThe percentage(cut-off) in which the comparison would be done.\nThe language for the sources, that is German or English.\nComparison option: compare only symptoms or compare whole symptom text(where last string words with brackets will also be considered).\nMedicine selection.\nInitial source: according to medicine, initial sources will be displayed in the select box.\nComparison source: according to medicine, comparing sources will be displayed in the select box.\n\n\n\nInitial processing: The compare setting submitted is processed by the program with the help of an id “symptom_comparison_form” and below steps are processed:\n\n\nForm validations are done, if no errors are found then an ajax request is sent to “check-if-comparison-table-exist.php” page. This page stores all the setting fields in an PHP SESSION variable with name “comparison_table_data”.\nThis SESSION variable also stores:\n\n\n\nComparison table name as:\n“comparison_table_medicineID_initialSourceID_comparingSourceIDs_language”\n\nIn above, the words in bold are the values taken from comparison setting menu.\n\n\nNOTE: Two more tables are created during comparison. These tables are:\nSame name as comparison table with suffix “_connections” added in one and suffix “_highest_matches” added in another.\nThe “connections” table saves the connection done for that particular comparison and the “highest_matches” table stores the highest matched percentages of all the symptoms. The “highest_matches” table is later used for displaying the unmatched symptoms.\nThe program searches for the comparison table in SQL table “pre_comparison_master_data”. Steps taken when table found or not found is shown in next sections.\n\n\nCreate comparison table: When comparison table name is not found in the SQL table “pre_comparison_master_data”.\n\nThe program first makes an entry with the comparison table name in the “pre_comparison_master_data” SQL table for keeping a reference of the comparison table.\nUsing shell commands, the creation of comparison table is executed in “create-dynamic-comparison-table.php” page.\nWhilst the comparing table creation with the user’s settings is executing, the “pre_comparison_master_data” SQL table is updated with a status “processing”, and while the table creation process is still continuing, the user will be displayed a pop-up showing “the creation process is still executing in background”.\nThe program checks the table status in fixed intervals, if execution is still processing then, the user will be displayed the pop up, if status is “complete” then next step follows.\n\n\n\nCreate comparison table: When comparison table name is found in the SQL table “pre_comparison_master_data”.\nFetching of Data Starts: When a user submits settings to compare between sources, and if comparison table is found in the “pre_comparison_master_data” with status “complete” then:\n\n The comparison page is reloaded.\nComparison table name is retrieved from the SESSION variable “comparison_table_data”. The number of initial symptoms to be displayed per page is also taken.\nThe comparison table name is searched in the database and according to the percentage set by the user, the symptoms from initial sources(in green color) and comparison sources is displayed in rows.\n\n\n\nCreation of connection and highest matches tables: Highest matches table and connection table are created at the same time when comparison table creation process starts. The “connection” table is by default empty for single source comparisons and the highest match table contains all the symptoms with its highest percentage match.\n\n"},"Topics/Symcom-Local-Setup-Details":{"slug":"Topics/Symcom-Local-Setup-Details","filePath":"Topics/Symcom Local Setup Details.md","title":"Symcom Local Setup Details","links":[],"tags":[],"content":"Prerequisites\n\nWindows Operating System\nXAMPP 7.1.33\nPHP Ver. 7.1 - 7.2\nComposer 1.6.3\n\nDownload XAMPP 7.1.33:\nsourceforge.net/projects/xampp/files/XAMPP%20Windows/7.1.33/xampp-windows-x64-7.1.33-1-VC14-installer.exe/download\nAdd XAMPP installation location to Path in environment variables.\n\nC:\\xampp\\php to Path in environment variables if not already done.\n\nDownload Composer Phar 1.6.3:\ngetcomposer.org/download/1.6.3/composer.phar\nNavigate to htdocs directory inside XAMPP installtion directory and clone Git repo:\ngithub.com/crklinkenberg/symcom01.git which is the development link for Symcom.\nThe whole project will now contain under symcom01 folder which is the root directory of the cloned project.\nCopy composer.phar to the cloned directory (root).\nInstall dependencies using the below commands in terminal.\nphp composer.phar show\nphp composer.phar install\n\nCopy composer.phar to  symcom01\\symcom\\api.\nInstall dependencies using the below commands in terminal.\nphp composer.phar show\nphp composer.phar install\n\nOnce all dependencies are installed, it is advised to modify the php.ini variables.\nGo to your xampp installation directory -&gt; php -&gt; (open) php.ini file and make these changes.\n    max_execution_time = 12000.\n    max_input_time = 6000.\n    memory_limit = 1024M.\n    upload_max_filesize = 100M.\n    post_max_size = 100M.\n\nStart XAMPP server.\nOpen XAMPP installed directory and open xampp-control.exe as Administrator. Example C:/xampp/xampp-control.exe\nClick  start button for both Apache and MySQL and wait until they turn green and then after that follow the instructions below.\nDatabase can be accessed from http://localhost/phpmyadmin/ in the browser.\nCreate new database and  import the database extracted from AWS or SQL provided.\nTo import data via terminal:\nIn XAMPP control panel, ind a button named **Shell** in the right hand side and click that button and then use the following command:\n\nmysql -u root -p my_database &lt; &quot;location of the .sql file&quot;\n\nCommand Help:\nroot : is database username\n-p : stands for password which is blank by default\nmy_database : is the database which we created in the http://localhost/phpmyadmin/\n&quot;location of the .sql file&quot; : should be the path of the .sql file that you have with you to import\n\nExample: mysql -u root -p my_database &lt; &quot;C:/Users/Mypc/Downloads/development_repertory.sql\n\nInstallation\nGo to your project directory. Example: C:/xampp/htdocs/symcom01, delete the existing .htaccess file and then rename .htaccess-local to .htaccess.\nChange the configuration in the mentioned location: config/route.php\nOpen this file with an editor and change the database configuration with your details:\n$dbUsername = &#039;root&#039;; // The default Xampp database username is root.\n$dbPassword = &#039;&#039;; // The dufault Xampp database pasword is blank.\n$dbName = &#039;my_database_name&#039;;  \n\nIn this file change PHP variable $absoluteUrl value to your application URL.\nExample: http://localhost/symcom01/. Here symcom01 is the git cloned directory name which is also the project root.\nChange:\n$absoluteUrl = (isset($_SERVER[&#039;HTTPS&#039;]) &amp;&amp; $_SERVER[&#039;HTTPS&#039;] === &#039;on&#039; ? &quot;https&quot; : &quot;http&quot;) . &quot;://$_SERVER[HTTP_HOST]/&quot;;\n\nTo:\n$absoluteUrl = &quot;http://localhost/symcom01/&quot;;\n\nInside C:/xampp/htdocs/symcom01/dev-exp/ directory delete the existing check-if-comparison-table-exist.php page and then rename check-if-comparison-table-exist-local.php page to check-if-comparison-table-exist.php.\nFollow the steps below for the location: C:/xampp/htdocs/symcom01/symcom/api\n\nDelete the existing .env file and then rename .env.development to .env on current location.\nOpen this .env file with an editor and change the database details just like above:\n\nDB_DATABASE=my_database_name\nDB_USERNAME=root\nDB_PASSWORD=\n\nOpen file constants.php in an editor, go to the location: C:/xampp/htdocs/symcom01/symcom/api/config/constants.php\nChange:\nif (app()-&gt;environment(&#039;development&#039;)) {\n\t$configArray2 [&#039;api_base_path&#039;] = &#039;dev.reference-repertory.com/symcom/api/public/&#039;;  \n}\n\nTo:\nif (app()-&gt;environment(&#039;development&#039;)) {\n\t$configArray2 [&#039;api_base_path&#039;] = &#039;http://localhost/symcom01/symcom/api/public/&#039;;  \n}\n\nAfter successful changes, the application can be opened in browser with URL: http://localhost/symcom01/."},"Topics/Symcom-Master-Data-Guide,-API-included":{"slug":"Topics/Symcom-Master-Data-Guide,-API-included","filePath":"Topics/Symcom Master Data Guide, API included.md","title":"Symcom Master Data Guide, API included","links":[],"tags":[],"content":"Technical Details:\nMaster data includes data of Symcom Master data menu topics: Books, Magazines, Medicines, Authors, Testers, Source Origins, Synonyms, Publishers and Literatures.\nFor each of these topics CRUD operations can be performed.\nThe backend is controlled by Laravel API.\nHere is the link to Symcom Master Data API Guide.: app.swaggerhub.com/apis/PARTHAPRATIM0100_1/Symcom-Master-Data-API/2\nIndividual controllers exists for each of the topics. Backend files associated:\nroutes/api.php\nControllers/Api/UserController.php\nControllers/Api/RoleController.php\nControllers/Api/PublisherController.php\nControllers/Api/SourceOriginController.php\nControllers/Api/AuthorController.php\nControllers/Api/TesterController.php\nControllers/Api/SourceController.php\nControllers/Api/MedicineController.php\nControllers/Api/LiteratureController.php\nControllers/Api/GlobalGradingController.php\nControllers/Api/SynonymLiteratureController.php\nControllers/Api/SynonymController.php\n\nThe UI is controlled by individual files present inside directories master-data/and api/.\nFrontend Validations are being controlled by:\nassets/js/ajaxFormSubmit.js\nassets/js/formValidation.js\nassets/js/common.js\n\nAny data existing under master data can later be used in the import process and thereby is related to the comparison processes.\nThe open API compatible yaml document is present inside the master-data-openapi directory.\nAll endpoints are divided into separate files and is later combined to a finalized file combined.yaml using command:\nswagger-cli bundle master-data-api.yaml --outfile combined.yaml --type yaml\n\nThis combined.yaml file is later used with swagger hub."},"Topics/Symptom-Edit-Submission-Workflow":{"slug":"Topics/Symptom-Edit-Submission-Workflow","filePath":"Topics/Symptom Edit Submission Workflow.md","title":"Symptom Edit Submission Workflow","links":[],"tags":[],"content":"1. When symptom edit modal is submitted via HTML class &quot;symptom-edit-modal-submit-btn&quot;, it is handled by &quot;symptom-icon-function.js&quot; script.\r\n2. It is then sent to &quot;update-symptom-and-settings-comparison-table.php&quot; script via ajax.\r\n3. After processing of the string in the above mentioned script it is handled by PHP function storeEditedSymptom(). This function updates in the completed table if only converted version is modified, or updates to both completed and quelle_import_test table if original version is modified. \r\n4. The original version column in SQL table is BeschreibungOriginal_de and converted version column is BeschreibungFull_de.\r\n5. Then modifiyGradingSettingsForTheSymptom() PHP function is called from the update script which saved the grading to symptom_grading_settings SQL table. The symptom type is saved to symptom_type_setting table.\n"},"Topics/Symptom-Type-Setting":{"slug":"Topics/Symptom-Type-Setting","filePath":"Topics/Symptom Type Setting.md","title":"Symptom Type Setting","links":["tags/general"],"tags":["general"],"content":"general\nSymptom Type Setting from Menu Point helps assign symptom properties to a particular source.\nAny of these options can be assigned to any particular field.\n\nFor symptom origins, the options that can be assigned are:\n\nTechnical Details:\n\nThe UI is controlled by symptom-type-and-origin.php script located under directory source-settings. The population of sources is done by api/book.php inside this script.\nPHP variables symptomTypeOptions fetches saved data for symptom type HTML form with id symptom_types.\nWhen the HTML form is saved, it is handled by the Laravel SourceController. The method responsible for this operation is saveSourceSpecificSymptomTypeAndSymptomOriginSetting().\nModel associated: SourceSpecificSymptomSetting.\n"},"Topics/Synonym-Addition-and-Doubtful-Synonyms":{"slug":"Topics/Synonym-Addition-and-Doubtful-Synonyms","filePath":"Topics/Synonym Addition and Doubtful Synonyms.md","title":"Synonym Addition and Doubtful Synonyms","links":["tags/general","Topics/Symcom-Master-Data-Guide,-API-included"],"tags":["general"],"content":"general\nWhen synonyms are added, the literatures for these synonyms are mandatory in the new insertion  form. Doubtful synonyms or doubtful literatures are displayed with yellow background color in the synonym list. Doubtful synonyms do not take part in import and comparison process. Only after resolving of these doubtful synonyms by the supervisor, these synonyms takes part in import and comparison process.\nTechnical Flow:\nLaravel API is used for this process.  Views are contained inside “Master Data” directory. SynonymController.php is responsible for any changes. English and German versions can be controlled sending the input parameters.\nInputs are taken from the form and inserted in SQL table.\nRelated sql tables:\r\n- english_synonyms\r\n- german_synonyms\r\n- rel_synonym_literature_english_synonym\r\n- rel_synonym_literature_german_synonym\r\n- synonym_literatures\n\nRelated Scripts:\n1. assets/js/formValidation.js\r\n2. SynonymController.php\r\n3. master-data\\synonym-en\\add.php\r\n4. master-data\\synonym-en\\edit.php   \r\n5. master-data\\synonym-de\\add.php   \r\n6. master-data\\synonym-de\\edit.php\n\nAdditional Details: Symcom Master Data Guide, API included"},"Topics/Tiny-MCE-editor-for-grade-settings":{"slug":"Topics/Tiny-MCE-editor-for-grade-settings","filePath":"Topics/Tiny-MCE editor for grade settings.md","title":"Tiny-MCE editor for grade settings","links":[],"tags":[],"content":"Related scripts:\r\nconnect-edit-exp.js\r\ntinymce-custom-helper.js\n\nJS function generateDynamicGradeIconsAndTags() is called in connect-edit-exp.js script to load the grade icons based on the source settings of the comparative source."},"Topics/Translation-of-symptoms":{"slug":"Topics/Translation-of-symptoms","filePath":"Topics/Translation of symptoms.md","title":"Translation of symptoms","links":["tags/import","tags/comparison"],"tags":["import","comparison"],"content":"import comparison\n\n\nSymptoms when imported to particular source, is imported using a language(either German or English).\n\n\nThe language in which the source has symptoms are listed in the import source page, each source are listed in rows. Symptoms can be added here with new language, if the source does not contain symptoms with that language.\n\n\nTranslation icon can be clicked in the comparison page to view the symptom text in German or English language.\n\n\nTranslations of all symptoms are loaded on page load and kept in an jQuery array. This is then manipulated when open all translation or just translation button is clicked.\n\n"},"Topics/Turquoise-Color-Changes":{"slug":"Topics/Turquoise-Color-Changes","filePath":"Topics/Turquoise Color Changes.md","title":"Turquoise Color Changes","links":[],"tags":[],"content":"Italics or gradings 2 with html classes text-grade-2 has been shown with a turquoise color.\r\nRelated scripts:\ncomparison.php\r\ncomparison-super.php\n\nTurquoise color added only to comparatives in the comparison.\r\nChanges from JS:\nconst observer = new MutationObserver(function () {\n\t$(&#039;.text-grade-2&#039;).not(&#039;.initial .text-grade-2&#039;).css(&#039;color&#039;, &#039;#017373&#039;);\n});\nIt is also added to the comparative symptoms loaded with the Load More button for large comparisons.\nAdditional Related scripts:\ndev-exp/assets/js/comparison-page-functions.js\r\ndev-exp/comparison-history.php\n\nNew JS variable connections_script introduced in the JS script.\r\nIt takes value from input element with id connections_script in the PHP scripts.\r\nIt is then passed to loadConnectionsForSymptoms() JS function.\nAdditional Changes in JS:\n// Observe changes to the body or a specific container\nobserver.observe(document.body, {\n\tchildList: true,\n\tsubtree: true\n});"},"Topics/Unmarked-and-non-secure-connection-check-before-saving-(Technical-Workflow)":{"slug":"Topics/Unmarked-and-non-secure-connection-check-before-saving-(Technical-Workflow)","filePath":"Topics/Unmarked and non-secure connection check before saving (Technical Workflow).md","title":"Unmarked and non-secure connection check before saving (Technical Workflow)","links":["tags/comparison"],"tags":["comparison"],"content":"comparison\nPHP script “check-unmarked-symptoms.php” is associated with this task.\n\n\nInitial id’s having ongoing connections are taken in a PHP variable $totalUnmarkedNoComparatives with the help of “unmarkedSymptoms()” array.\n\n\nAll unmarked initial ids are then taken out. And the subtracted value from the $totalUnmarkedNoComparatives is then returned to the user which is shown in the pop up.\nThis script also counts the non secure connections and returns its value to the user. From the comparison table, below sql table fields are searched for retrieving the total non secure symptoms:\n\n\nNon Secure Connect ⇒ ns_connect.\n\n\nNon Secure Paste ⇒ ns_paste.\n\n\nGeneral Non Secure ⇒ gen_ns.\n\n\n\n\nFunction unmarkedSymptoms(database, comparison table, similarity rate, param):\nThis function fulfills two purposes, one, it  is used to count the total unmarked initial symptoms having connections (when param = 0), two , it is used to update the unmarked initial symptoms with zero comparative.\nThe $unmarkedSymptomsArrayFinal[] stores all the unmarked initials with zero comparatives. This array is also used for updating the “marked” field to “1” when saving a comparison.\nThe $unmarkedSymptomsArrayFinalNumber[] stores the initial ids having ongoing connections."},"Topics/Unmatched-symptoms-comparison":{"slug":"Topics/Unmatched-symptoms-comparison","filePath":"Topics/Unmatched symptoms comparison.md","title":"Unmatched symptoms comparison","links":[],"tags":[],"content":"Comparison for unmatched symptoms is asked on saving a comparison with save button after verification and checks of non secure symptoms, general non secure symptoms and unmarked initial symptoms.\nStart with click event from comparison-table-save-btn html class.\r\nAssociated scripts:\ncomparison.php\r\ncomparison-super.php\n\nInt value 6 is sent as parameter to JS function `savingComparison(6).\nsavingComparison() submits the save form with id saveSubmit.\nIt updates input with id temp_unmark_check to the param value.\nGets assigned to PHP variable unmarkedInitialsCheck in PHP scripts.\r\nAccording code sections for unmarkedInitialsCheck value 6 is executed where comparison result instead shown with unmatched comparatives symptoms.\n`"},"Topics/User-View-Page":{"slug":"Topics/User-View-Page","filePath":"Topics/User View Page.md","title":"User View Page","links":["tags/userview"],"tags":["userview"],"content":"userview\nComparisons worked upon and when finished can be sent for viewing purpose to the public / users. The supervisor in the Symcom website has the privilege to send the final version of the comparison from the materia medica page to the reference materia medica (RMM) page which is basically the materia medica for the users in the user view section.\nThis user view section is isolated from our working database and is separate also in terms of file structure.\nCurrent development database name: alegra_new_repertory_user_final_view.\nCurrent staging database name: alegra_new_repertory_user_view_stage.\nNOTE: At present, the user view page is being designed only for demonstartaion purpose and to test the functionalities. Full layout design and functionality will be done later.\nFile Structure: User Section files are controlled by the “user-view” directory in the “dev-exp” directory.\nThe “user-includes” directory inside it has scripts which controls the database configuration, routes, JavaScript and PHP functions.\nThe “middle-scripts” directory controls the overall process of each menu points, acts as a controller.\nThe views are all present inside the “user-views” directory.\nThe fetching of information of all the symptoms are done via an api and the scripts relating to it are present inside the “api” folder.\nImportant: Steps to follow to make a final compared source visible in user view:\n\nAt present, developers make the finalized source available in the user view section, so the full process is not automatic, below steps should be followed. Development and staging user view sections are both independent of each other so steps should be followed in both environment whenever required.\nThe finalized source should be checked under RMM column in the materia medica. This will copy the completed and connections table of the finalized source in the user view database.\nNavigate to “dev-exp/table-control-in-user-view.php” in the browser. This will update the user view database with latest data from the current active database. All database dependencies for user view section is done by this script. For migration “user-view/user-migration.php” script is used.\nThe quelle_id of the finalized compared source is copied from pre_comparison_master_data sql table and is pasted in the quelle_id column of the user_settings sql table inside the user view database.\nThe quelle id is pasted in the “user-view/index.php” page and is pushed.\nThe final compared source will now be now visible in the user view section.\n\nBelow are the filtration functionalities of the user view menu points with both conceptual and technical details:\nTechnical Help: The “index.php” script is responsible for showing all the symptoms with customized filtration. All menu points flags are handled here, and respective functions are called for fetching and modifying the data or displaying. The final execution before display is done by the “symptom-list.php” script which is inside the “user-views” directory.\n\nShow Source:\n\nFor each source, an abbreviation system with author and source key is designed.\r\n\r\nRelated PHP function:\n\n\nfetchSourceViewSetting(source view flag, user id, quelle id).\n\n\ngetQuelleAbbreviation(original quelle id, source view fetched).\n\n\n Database field : “source_view” in the user_settings MySQL table.\n\nShow symptom type:\n\nUnder Settings Sources we have the submenu Symptom type setting.\nHere we can deposit certain symptom types to the symptoms of the source.\nIn the default setting, the symptom types are not shown. Users can display the type of symptom behind the symptom. Default is:\r\n\nUsers should be able to display the type of symptom behind the symptom:\nChecking the box causes the selected symptom types to be displayed with a subscript at the end of the symptom (p, t, c and s):\nEx.: checking the two boxes clinical + intracurative symptoms:\n\nIn the user page:\nPressure in the eyes.                                     \nRetinal detachment.\nVisual impairment. c       \nStitches in the eyes. s\nRelated PHP functions: fetchSymptomTypeSetting(symptom type flag, user id, quelle id).\nDatabase field : “symptom_type” in the user_settings MySQL table.\n\nShow contents in brackets:\n\n\nIn the standard version, the contents in brackets that belong to the symptom text and the drug references are displayed. All other bracket contents are not displayed. By clicking the respective boxes, the user can display additional content in brackets.\n\nContens in brackets input values are taken from the html form in “show-bracket-contents.php” script and then are saved in the “contents_in_brackets” field of the “user_settings” SQL table in a serialized PHP array form.\nRelated PHP functions:\n\n\nfetchTesterInfo(original qulle id, symptom id).\n\n\nfetchDrugReference(symptom id).\n\n\nfetchLiteratureRef(symptom id).\n\n\nfetchBracketContentSetting(contents in bracket flag, user id, quelle id).\n\n\nNOTE: For bracket contents, at present the “searchable_text_de” and “searchable_text_en” from completed SQL table is used to display the results. When any of the options are selected, the contents are fetched using PHP functions and appended at the end of the strings with the brackets.\n\nView of grades:\n\n\nAll grades are activated by default. Unchecking means that symptoms with these grades are not displayed. Example: If the user only wants to see symptoms in the 4th and 5th grade, he deactivates the first four grades. If the 1st grade is deactivated, all symptoms in the 1st grade are not displayed. If no grade is activated, you will ­not see any symptoms. Doubtful symptoms (grade 0) are placed in brackets.\r\n\nThe grade value for each grades are taken from the HTML form in the “show-grades.php” script. It is then stored in the “show_grades” field of the “user_setting” SQL table in a serialized PHP array form.\nThis array is fetched using the “fetchGradesSetting()” PHP function and according to the key-value pair, the grade values (1 ,2 , 2.5, 3, 3.2 etc) are then inserted into the “$gradeFilterArray[]” PHP array. This array is sent to the “convertTheSymptomWithGradingFilters()” PHP function which does all the filtration and creates the final symptom string and finally displays it.\n\nGraphical Presentation:\n\n\nIn this menu, users can display the symptom grades in the standard ­setting or in colour. The radio ­buttons are mutually exclusive, i.e. as soon as “Color” is activated, “Standard” is deactivated.\n\r\n\nThe graphical representation is taken from the HTML form in the “show-graphical-presentation.php” script. It is then stored in the “symptom_color” field of the “user_setting” SQL table.\nThis value is then fetched by the PHP function “fetchGraphicalPresentationSetting()” and the return value is stored in the “$symptomColorActive” PHP variable.\nThis variable is then sent to “convertTheSymptomWithGradingFilters()” PHP function as a parameter and this grade conversion function shows the final output.\n\nAuthor Selection:\n\n\nBy default all authors of the RMM are listed and check-marked. Users can exclude a particular author (all sources of that author) from display:\nThe user can selectively exclude individual authors by deactivating the corresponding buttons. If an author is deactivated, all sources of this author and corresponding symptoms of this sources are hidden. It is a function that can be switched on and off, the user can switch the author on again with one click and thus display his sources back in the RMM.\n Example: Exclusion of the author Hering, CJ and all of his works:\n\nAttention : If an author is hidden, not only the initial symptoms of his sources are hidden, but also all symptoms that are related to these initial ­symptoms via connect or connect edit.\nTechnical Help:\nAll authors are displayed using the “exclude-author.php” script in the alphabetical order. On unchecking an author, the author id is taken and kept in a JavaScript array from the “author-control.js” script and when the setting is saved, this array is converted to string and is then submitted. After which the excluded author value is saved in the “author_exclude” field in the “user_settings” SQL table.\nValues from the SQL table is fetched using the “fetchExcludedAuthors()” PHP function and return value is exploded and is the author id is matched with each of the symptoms in the display process and accordingly the matched symptoms are excluded from the display list.\n\nTime Epoch:\r\n\n\nUsers can choose sources of a certain period of time (i.e. from beginning to 1900):\nIn this module, the user can choose the period which he wants to be displayed sources from. In the first field (Select) is the year of the oldest source 1811, in the second field is 2023; these year specifications can be overwritten.  Example: If the user only wants to display sources up to 1980, he writes 1980 in the second field. If he wants to see all symptoms from 1950 onwards, he writes 1950 in the first field and 2023 in the second field.\n\nThe time epoch is taken from the HTML form in the “time-epoch.php” script. It is then stored in the “time_range” field of the “user_setting” SQL table.\nThis value is then fetched using “fetchTimeEpochSetting()” PHP function, the returned value is taken in an array with key “time_epoch” and is then sent along with the “quelle id” to the api for showing all symptoms. In the api function, the time range is extracted from the “time_epoch” value sent and “quelle_jahr” field of the completed table is controlled in order to produce the final lisrt of symptoms."},"Topics/User-view-section-Author-exclusion-and-its-effect-on-CE-symptoms":{"slug":"Topics/User-view-section-Author-exclusion-and-its-effect-on-CE-symptoms","filePath":"Topics/User view section Author exclusion and its effect on CE symptoms.md","title":"User view section Author exclusion and its effect on CE symptoms","links":["tags/userview"],"tags":["userview"],"content":"userview\nIn the user view section, we have our final symptom list displayed. Here we have option to exclude an author, according to which all symptoms of the excluded author will be removed from the displayed symptom list in the user view section.\nHere when we have a CE symptom in the user view section and we exclude the author of the CE symptom then the CE effect of the symptom is also gets removed from the symptom and the symptom is displayed in previous state (the state before the CE).\nTechnical Workflow:\nWhen we deselect an author form the user view filtration options section, through function “fetchExcludedAuthors()” we fetch the deselected authors, Then we collect the source/quelle ids of the deselected authors with the help of the author and source/quelle relationship table “quelle_autor”. Now we have the quelle_id(s) of the deselected/excluded authors. So now when displaying the symptoms we exclude the symptoms of these quelle_id(s).\nNow when the deselected author is a CE symptom’s author, here also we have the quelle_id(s) of the deselected author that we have collected following the same above-mentioned process. Here we exclude the symptoms from displaying which belongs to the these excluded authors quelle_id(s) as mentioned above,now for each symptom which are going to be displayed (means the symptom which don’t belongs to the excluded authors quelle_id(s)), with the help of function “fetchOriginalQuelleOfConnectedSymptom()” we collect the connect edited symptom’s quelle_id, if the displaying symptom is a CE symptom. Now again we check if this quelle_id is in excluded authors quelle_id(s), and If the result is yes, then we collect the previous state of this connect edited symptom with the help of the function “fetchCEdataOfSymptom()” and display this sate of the symptom to the user in the web browser,\nHere also we remove the excluded author’s part from the source name of the displaying symptom in the user view section with the help of function “getQuelleAbbreviation()”.        \nUpdated:\nWe take the sources related to the authors in quelleAsPerAutorArr PHP variable. PHP function fetchMultipleOriginalQuelleOfConnectedCESymptom gives id from pre comparison table and the original source id of the CE connected with that initial in key-value pairs where values are array, sorted as per the latest CE connection.\nThe latest CE active will always be shown unless the author related to the connected CE is excluded.\r\nThe returned data from PHP function fetchMultipleOriginalQuelleOfConnectedCESymptom is kept in variable fetchCeInfo and is then sent as input parameter to PHP function fetchCEdataOfSymptom.\nIf the fetchCeInfo is empty then data is retrieved from BeschreibungFull_de and BeschreibungFull_en columns  in the current completed table.\nIf the fetchCeInfo has values which mean CE is active with the initial symptom and it is not excluded then data is fetched with the help of table_name column in the pre_comparison_master_data SQL table.\nOther flags used in the fetchCEdataOfSymptom function are ceConnectionExists and lang.\nRelated scripts:\ndev-exp/functions.php\r\n\r\ndev-exp/user-view/index.php\r\n\r\ndev-exp/user-view/user-views/symptom-list.php\r\n\r\ndev-exp/user-view/user-includes/user-functions.php\n"},"Topics/User-View-Show-Source-Setting":{"slug":"Topics/User-View-Show-Source-Setting","filePath":"Topics/User View Show Source Setting.md","title":"User View Show Source Setting","links":["tags/userview"],"tags":["userview"],"content":"userview\n\nTechnical Details:\nSource Setting is controlled by getQuelleAbbreviation() PHP function. Quelle id of the symptom, an array containing quelle id of the connected symptom and and option for switch case is sent as parameter in this function.\nWork flow of this function:\nQuelle id from  input is used to fetch information of author abbreviation, title abbreviation and year.\nMultiple authors are concatenated and displayed.\nIf  the symptom has connect edit or swap connect edit connection then the quelle id of the connected symptom is also sent in the array with key “ce_swapce_symptoms_quelle_id”.\nInformation fetching for the connected symptom is same like its parent.\nIf connect edit or swap connections are found then the source code is separated by a ”/” between the parent symptom source and connected symptom source.\nExample:\n\nIn this particular set, teh fourth symptom has been connect edited.\nSouce code of the symptom: PPMJvPKN 1867 , here PPM(author abbreviation) JvP(author abbreviation) KN(title abbreviation one) 1867(year).\nSource code of the connected symptom: SchwPPMEN1879, here Schw(author abbreviation) PPM(author abbreviation) EN(title abbreviation one) 1879(year).\nRelated scripts:\nfunctions.php\nsymptom-list.php"}}